{"id":"172338516139198_842738555765854","from":{"name":"Ahmed Adel","id":"10155949666619129"},"message":"After a while, being temporarily apart from Google i switched to DuckDuckGo (As guys here mentioned and some praised it extensively). Those are my general thoughts:\nAside from its ridiculous name, Ducky is neat search engine that you can heavily customize every bit of it from its background colors, fonts to very tiny details as site icons and so on..\nThe first time(s) you using it, you may have an awkward feeling about its results, but after a while.. and if you really focus on results and its ranking priority, you will find a fact that it shockingly works!. everytime you search about something (specially faqs and gathering info), ducky's put the right answer in front of you, and not any answer.. it prioritize answers from official sources.\nSo if you search \" Error opening explorer.exe win7 \" for example on both Google and Ducky, you will find that Google first results included from tech websites and public forums, while Ducky's first results shows the related topic on MS Tech Forums first, then go to another resources.\n\nThe main problem using Ducky is latency (page loading speed) and when it compared to Google, Google will won by far distance. but there are also other problems such as Image search (very weak btw..), and of course Integration (google search is hugely integrated and diversified).\n\nOverall, Ducky basic search is very good, and its ranking algorithm is shockingly better than Google but when it comes to advanced search options .. it still lacks more features","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/842738555765854"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/842738555765854"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"status","created_time":"2014-11-07T18:22:21+0000","updated_time":"2014-11-07T18:22:21+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"10155071713202292","name":"Hassan Aly Selim"},{"id":"1851508841788910","name":"Ahmed Essam"},{"id":"10210684524123349","name":"Hady Ahmed"},{"id":"10211242369566436","name":"Ebram Tharwat"},{"id":"10212348961303729","name":"Abdulaziz Alaa"},{"id":"803656636456579","name":"Taher Abdelmohsen"},{"id":"10212782797230132","name":"Diaa Sami"}],"paging":{"cursors":{"before":"MTAxNTUwNzE3MTMyMDIyOTIZD","after":"MTAyMTI3ODI3OTcyMzAxMzIZD"}}}}