{"id":"172338516139198_833255506714159","from":{"name":"Mostafa El Malah","id":"1830233070575028"},"message":"5 افكار لتحقق اكبر استفادة من موجة ريادة الاعمال في العالم العربي","story":"Mostafa El Malah shared XApps Solutions's photo to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"1830233070575028","name":"Mostafa El Malah","type":"user","offset":0,"length":16}],"24":[{"id":"117576121678695","name":"XApps Solutions","type":"page","offset":24,"length":15}],"42":[{"id":"496037577165879","name":"","offset":42,"length":5}],"62":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":62,"length":14}]},"picture":"https://fb-s-d-a.akamaihd.net/h-ak-xpf1/v/t1.0-0/s130x130/10615342_496037577165879_5612365051542146757_n.jpg?oh=1293ee2ca83e4ca74e59a0c78dfda557&oe=595BF8A2&__gda__=1496158245_062a4d42f89d7dbedd1a82e3574b480e","link":"https://www.facebook.com/XApps.co/photos/a.423473861088918.1073741828.117576121678695/496037577165879/?type=3","name":"XApps Solutions","description":"5 افكار لتحقق اكبر استفادة من موجة ريادة الاعمال في العالم العربي :\n\nرأي شخصي | عن ريادة الاعمال و الي أين تتجه ؟ و كيف نحقق منها أعلي استفادة في عالمنا العربي \n\nرائد أعمال \nاو \nentrepreneur\n\nكلمة تعني هذا الشخص الذي لديه فكرة يقوم علي تطويرها و تنفيذها علي ارض الواقع \n\nارجو الا تكون موضة او هوجة تندثر و لا تحقق منها استفادة كبيرة في عالمنا العربي مثل موجات التنمية البشرية \nالتي اثرت المحتوي العربي و ايضا ملئته بالكثيرين من المتحدثين بغير علم الذين اثروا سلباً علي سمعة مجال التدريب و مجال التنمية البشرية \n\nو في رأيي الشخصي هناك أشياء يمكن عملها حتي تستفيد من هذه الموجة :\n\n1 - اثراء المحتوي العربي من خلال التدوين و الترجمة للمقالات و الكتب الاجنبية و هذا باب استفادة للمدونين و لمواقع النشر مثل ومضة .. اراجيك .. عالم التقنية و ساسة بوست و غيرها من المواقع التي تتحدث في ريادة الاعمال بشكل اساسي او كجزء من المحتوي المقدم عليها \n\n2 - التدريب لكل رواد الاعمال و اصحاب الافكار و هذا بالطبع موجه لمن لهم القدرة علي التدريب و اعطاء المحاضرات و تنظيم الفعاليات سواء المجانية او المدفوعة و علي من يقدم التدريب ان يلتزم \nبالمصداقية \nو ايضاح مصادر اخري للبحث و التعلم \nو تمييز الغث من الثمين للمتدربين الجدد من المصادر و المراجع \nو يهتم بالاسلوب العلمي في الشرح \nو عليه ان يخوض تجربة واحدة علي الاقل او يشرف و يساعد اكثر من تجربة لعمل ريادي ناشئ حتي يتسم تدريبه و حديثه بالواقعية\n\n3 - نشر الخبرات او التغذية الراجعة الايجابية\npositive feed back\n و هذا هو دورك صديقي رائد الاعمال العربي في ترجيح افضل الكتب التي افادتك \nو كذلك افضل المدربين الذين افادوك لتقدم بذلك تفنيد \nومساعدة لكل رائد اعمال جديد \nو حتي لا ينتشر بيننا فيروس اولئك الذين يجيدون تسويق انفسهم \nو ليس لديهم العلم الكافي و المناسب و للأسف يقوم المتدربين الجدد بنشر كلامهم و صناعتهم كنجوم \n\nلا أقول انك يجب عليك فضح هؤلاء لكن يجب عليك نشر توصيات و اراء ايجابية ممن تري ان لهم دور مؤثر و يجتهدون لإيصال علم نافع \n\n4 - اقامة مشروعات ربحية و غير هادفة للربح لدعم رواد الاعمال تقنياً و علمياً \n\nالمشروعات الربحية في رأيي تقوم بتسريع سير اي عمل إصلاحي في المجتمع \nهناك مشروعات ربحية تخدم رواد الاعمال مثل حاضنات الاعمال و التي توفر مكان للتدريب و مكان للعمل مقابل مشاركة في ارباح المشروع الناشئ \nو ايضاً مسابقات دعم رواد الاعمال التي تقوم بتقييم الافكار و تعطي جوائز للرابحين و كذلك تقدم دعم مالي مقابل شراكة او بدون مقابل و هكذا مراكز الاستشارات و المدربين \nوكذلك شركات برمجة التطبيقات مثل شركة XApps Solutions حيث تهتم بمساعدة رواد الاعمال علي برمجة و تصميم تطبيقات الجوال للاندرويد والايفون باسعار مناسبة و تعمل علي تقديم محتوي يناسب رواد الاعمال في العالم العربي\n\nو لا ننسي بعض الجمعيات او التنظميات الخيرية و الغير هادفة للربح التي تقدم المحاضرات و التدريبات و المسابقات لرواد الاعمال \n\n5- تكوين علاقات من خلال الانترنت و مواقع التواصل الاجتماعي \nالحمد لله يتوفر لنا اليوم التواصل بشكل جيد عبر الكثير من الوسائل لذا يمكنك التواصل مع المدربين و رواد الاعمال مثلك في كل العالم العربي فلا تبخل في استخدام هذه الوسائل و تواصل مع رفقائك من رواد الاعمال في العالم العربي بشكل احترافي لصنع علاقات جيدة بما يسمي \nNetworking\n\nتلك خمسة افكار لتحقق افضل استفادة من موجة ريادة الاعمال في العالم العربي\n\n-- اذا كنت تري ان هناك طرق اخري لدعم رواد الاعمال لم تذكر في المقال اذكرها حتي يستفيد منها الجميع .\n\nمصطفي الملاح","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/833255506714159"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/833255506714159"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"photo","object_id":"496037577165879","created_time":"2014-10-20T01:28:59+0000","updated_time":"2014-10-20T01:28:59+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"1088031311307136","name":"Mohammad Sakr"}],"paging":{"cursors":{"before":"MTA4ODAzMTMxMTMwNzEzNgZDZD","after":"MTA4ODAzMTMxMTMwNzEzNgZDZD"}}}}