{"id":"172338516139198_912605505445825","from":{"name":"Ahmed Ibrahim","id":"1660486024252983"},"story":"Ahmed Ibrahim shared Open Source Learning's photo to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"1660486024252983","name":"Ahmed Ibrahim","type":"user","offset":0,"length":13}],"21":[{"id":"496019083862876","name":"Open Source Learning","type":"page","offset":21,"length":20}],"44":[{"id":"631359993662117","name":"","offset":44,"length":5}],"64":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":64,"length":14}]},"picture":"https://fb-s-d-a.akamaihd.net/h-ak-xfa1/v/t1.0-0/s130x130/13974_631359993662117_3644985831233310227_n.jpg?oh=87d0a4569afc7acb0a0a7ac2610abc37&oe=596B4507&__gda__=1500303431_e47e8583c79f7b03b43c45d382fbab72","link":"https://www.facebook.com/OSL1.2015/photos/a.501121180019333.1073741827.496019083862876/631359993662117/?type=3","name":"Open Source Learning","description":"20 معلومة، يهموك في طريقة شغلك أو مذاكرتك ..\n--\n1- لو عندك تاسك تاخد دقيقتين في أقل .. انسى فكرة التخطيط ليها واعملها حالًا و اخلص منها أو بمعنى آخر اتخلص منها.\n2- لو عندك تاسك تتعلق بالمذاكرة أو الخطط و البحث عن معلومات أو research او كتابة استخدملها الـ Pomodoro Technique .. ودا بوست بيتكلم عنها: http://goo.gl/vUVz5W\n\n3- لو عاوز تداوم على حاجه اربطها بوقت محدد زي أول ما تصحى من النوم أول ما ترجع من الشغل كل يوم الصبح في المترو، انا خلصت كورس اونلاين كاملا في المترو كل يوم الصبح.\n\n4- طريقة من طرق استعادة المعلومات اللي بقالك اكتر من سنه مبتستخدمهاش، انك تدي المعلومات دي لحد تاني .. وانتوا الاتنين كسبانين و هتندهش ازاي العلم اللي ربنا رزقك بيه انت مش مدرك اهميته غير لما تلاقي حد تاني احتاجله و فرق في حياته و كنوع من رد الجميل للي ساعدك لازم تساعد حد تاني.\n\n5- البركة في البكور، بكل ما تعنيه الكلمه من معنى فعلا .. اليوم لما بتبدأه من بدري بيفرق جدا و بتحسه اطول من العادي (ودا تحدي كنت عملته قبل كده عن الموضوع ده: http://goo.gl/DlJAhj )\n\n6- ساعتك البيلوجية دقيقه جدًا ، انا اكتشفت اني بنام 7 ساعات بالدقيقه لدرجة اني لو نمت 11:50 بصحى 6:50 من غير منبه .. حاول تعرف انت بتنام كام ساعه بالظبط و ظبط نومك هيفرق جدًا معاك.\n\n7 - استخدم evernote على الويب و الموبايل و التابلت .. انا عن نفسي جربت حاجات كتير جدا جدا و انا اكتر حد شوفته بيجرب apps .. ايفرنوت اثبت انه الافضل على الاطلاق ببساطته المتناهيه و امكانية انك تعمل عليه اللي انت عاوزه ،، اصبر بس شوية و قرر تستخدمه في كل حاجه .. هتبطل تشيل اي نوتس او اوراق.\n\n8 - الافكار اللي بتيجي كتير جدا .. بس مش معنى كده ان كلها يتعمل .. الواحد زي ما بيضحي بوقته و مجهوده عشان فكره ممكن كمان يضحي بأفكار تانيه عشان الفكره دي.\n\n9 - طاقتك مهما كانت كبيره و مهما كانت فظيعه .. فهي محدوده ،، حاول تستثمرها على قد ما تقدر و متحلمش بإنك تشيل اكتر من اللي تقدر تشيله عشان ده هيأثر على جودة شغلك.\n\n10- وقتك 24 ساعه فقط، اتصرف!\n\n11- اسمع أي نصيحه تتقدملك، اسمعها كويس، خد منها اللي انت عاوزه و اعمل برضه اللي في دماغك.\n\n12- مفيش حاجه ليها آخر .. بس كل الحاجات بتبتدي بأول.\n\n13- اكتب قايمه بكل الوعود عشان متنساش اي حاجه مهما كانت بسيطه، و اوفي بوعودك مهما كان في نظرك متأخر.\n\n14- كل يوم ربع ساعه قبل ما تمشي من مكتبك .. رتب ايميلاتك في labels and folders .. ال700 إيميل اللي مش مترتبين في اسبوع هيبقوا كل واحد في مكانه، و متخافش من التصنيفات الكتير، و ال160 إيميل اللي متردش عليهم هتحس ان الرد عليهم شيء بسيط.\n\n15- المهة (التاسك ) التقيلة على قلبك قسمها لمهام صغيرة.\n\n16- لما تأخد بريك متعملش حاجة تعكنن على اللى جابوك وتبوظ يومك زى أنك تشوف الفيس بوك أو تكلم حد عارف أنه هينكد عليك.\n\n17- إعرف إيه الحاجات اللي بتعملها اللي بتخليك ترتاح و تفك دماغك من كل حاجة . تسافر؟ تاكل أكلة معينة ؟ تخرج مع ناس معينة ؟ تتفرج على فيلم او التلفزيون أو تنام أو تنعزل ؟ أو تروح مكان معين أو تقرأ نوعية كتب معينة ؟\nالمهم إن يبقى عندك كذا حاجة من دول تقدر تعملهم في أوقات متباينة و على حسب ظروفك .. مهم قوي علشان تعرف تواصل إنك تفصل.\n\n18- صلح علاقتك مع ربنا, هتحس بطاقة عظيمة, وبركة في الوقت ..\n\n19- ما تحتفلش بانجازك قبل أوان الاحتفال.\n\n20 - تخلص من عادة \"الحركرك\" و عادة انك تأجل كل حاجة لأخر لحظة ..اوقات كتير مش حتلحق خصوصا لو جالك عفريت الديدلاين في اكتر من مشروع في نفس الوقت.\n--\nالبوست دا مش بتاعي، أنا بس زودت شوية لينكات.. البوست للأستاذة ياسمين مدكتور لحد رقم 15 واللي بعد كده من التعليقات اللي كانت ع البوست عندها.\n---\nدي شوية لينكات لبوستات كنت عملتها قبل كده والناس كل شوية بتسأل عنها:\n\n- 40 حاجة تعملهم في وقت فراغك أو مللك: http://tiny.cc/ttw6ux\n- 20 حاجة تعملهم عشان تذاكر بنفس .. وتبقى مذاكرتك فعّالة: http://tiny.cc/4sw6ux\n- 20 حاجة مفيدة ممكن تعملهم في المواصلات: http://goo.gl/3TAysx\n- 10 حاجات تستغل بيهم الأجازة: http://tiny.cc/5uw6ux\n- Pomodoro Technique : http://tiny.cc/7vw6ux\n- Learning How To Learn : http://tiny.cc/vxw6ux\n- بعض التحديات اللي عملتها:\n- النوم: http://goo.gl/DlJAhj\n- الصمت: http://goo.gl/kSIYTK\n- الصحيان: http://goo.gl/rzsYCJ\n- الموبايل: http://goo.gl/XIgSUQ\n- البلالين: http://goo.gl/9nlCNd\n- شخص نباتي: http://goo.gl/TwEAjR\nby\nعمر أحمدين\n#شير_في_الخير\n#اتعلم\n#ملكش_حجه\n#العلم_لا_يكال_بالبتنجان","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/912605505445825"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/912605505445825"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"photo","object_id":"631359993662117","created_time":"2015-03-20T22:33:50+0000","updated_time":"2015-03-20T22:33:50+0000","is_hidden":false,"is_expired":false}