{"id":"172338516139198_700274580012253","from":{"id":"1614120164","name":"Eslam Hamouda"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/700274580012253"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/700274580012253"}],"privacy":{"value":""},"type":"status","created_time":"2014-02-12T21:20:28+0000","updated_time":"2014-02-13T01:57:15+0000","likes":{"data":[{"id":"721605545","name":"Kareem Kashwaa"},{"id":"100001793708731","name":"Mohamed Badawi"},{"id":"100000550093376","name":"Mohamed Hafez"},{"id":"544815169","name":"Mohamed Meligy"},{"id":"708466785","name":"Mohammed Abdel-Aleem"},{"id":"100006438404998","name":"Ahmed Saeed"},{"id":"100000136656165","name":"Ahmed Sherif"}],"paging":{"cursors":{"after":"MTAwMDAwMTM2NjU2MTY1","before":"NzIxNjA1NTQ1"}}},"comments":{"data":[{"id":"700297863343258","from":{"id":"1055914266","name":"Hady Ahmad"},"message":"Nice work, any reason why you picked the approach of canning multiple screenshots and pushing that to the browser?\n\nRegarding your firewall rule, it's worrisome.. UX wise, it'd be nice to put a description for the rule.\nFrom a security stand point, why aren't you specifying your program as the only candidate for the network activity?\nYou are also not specifying a profile.","can_remove":true,"created_time":"2014-02-12T22:28:55+0000","like_count":2,"user_likes":false},{"id":"700300753342969","from":{"id":"1614120164","name":"Eslam Hamouda"},"message":"Thanks a lot for your feedback , regarding the firewall rules i spent most of time testing a lot of options , the most pain-full one when i specify the path for my app [it really doesn't work for me on other devices on the same network] unless i choose to allow all applications that matches the rule [ and still can't figure out why !] , i really want to be more specified on some options of the rule but i have ended up using the defaults and let Windows decide , the most attribute i was care about is to make remoteip=localsubnet to prevent public access.\nit will be great if you tried to delete my rule and create a custom one and try to figure out the problem then fork the code with solution if you have time , i really appreciate your words :)","can_remove":true,"created_time":"2014-02-12T22:37:59+0000","like_count":0,"user_likes":false},{"id":"700302633342781","from":{"id":"1614120164","name":"Eslam Hamouda"},"message":"about the reason of this stupid heavy-weight approach , i don't have enough experience with image processing to compare which parts of the image has been changed and send the differents only to save some bandwidth , also with a Non-Internet Network you will not care about mass requests which for this reason i picked up this one and works smoothly , also i was thinking of using SignalR & WebAPI(Self-Hosting) but i ended up building my own Web Server!","can_remove":true,"created_time":"2014-02-12T22:44:29+0000","like_count":1,"user_likes":false},{"id":"700388676667510","from":{"id":"1055914266","name":"Hady Ahmad"},"message":"Mohamed Elkady that's not very nice of you. Unless you have something to contribute to a thread, please don't derail one off topic. You're always free to start a thread of your own.\n\nEslam Hamouda  I haven't touched windows (or .net for that matter) in an awfully long time but thanks for the invitation to contribute :) Much appreciated.\n\nThat might give you some pointers http://technet.microsoft.com/en-us/library/dd734783(v=ws.10).aspx#BKMK_3_add\n\nDo you manually type out the application's path or use something more generalized?\n\nAs for the approach, sending part of the image would prompt you to assemble the image on the client side which will end up being a hassle unless you use some creative approach (like maybe dividing your screen up into squares, as for the client side you'll end up with a canvas as your best approach)\n\nHave you considered sending a video stream? That might involve some DX or if windows has some device API I'm not aware of that can let you capture the monitor as a video stream.\nNow streaming that over to the client becomes a painless process and receiving that into a video tag on the client side is just about as easy as it gets.","message_tags":[{"id":"100003348601091","name":"Mohamed Elkady","type":"user","offset":0,"length":14},{"id":"1614120164","name":"Eslam Hamouda","type":"user","offset":183,"length":13}],"can_remove":true,"created_time":"2014-02-13T01:57:15+0000","like_count":1,"user_likes":false}],"paging":{"cursors":{"after":"NzAwMzg4Njc2NjY3NTEw","before":"NzAwMjk3ODYzMzQzMjU4"}}}}