{"id":"172338516139198_1141872965852410","from":{"name":"Mostafa Elsayh","id":"1417211125005592"},"message":"Why do we need Enterprise Architecture?\nليه محتاجين Enterprise Architecture\nThe purpose of enterprise architecture is optimize across the enterprise the often fragmented legacy of processes (both manual and automated) into an integrated environment that is responsive to change and supportive of the delivery of the business strategies. \nالغرض من هيكلة المؤسسات هو تحسين وتطوير المؤسسة من إرث قديم من العمليات والإجراءات يدوية كانت أو أليه إلى بيئة متكاملة تستجيب للتغير وداعمة لتنفيذ إستراتيجية العمل بطريقة صحيحة.\nكلام كبير نحاول نفهم جزء جزء:\nالجزء الأول من الإجابة:\nيعنى أيه  fragmented legacy of processes (both manual and automated) \nأو يعنى أيه إرث قديم من العمليات والإجراءات يدوية كانت أو أليه.\nيعنى على مر الزمان شركتك بتكون بتكبر فى خلال عشرة او خمسة عشر سنه الماضية.\nكان فى أنظم جديدة بيتم إضافتها للشركة كل شوية تدريجيا ومش لازم دفعة واحدة ممكن تكون على فترات متباعدة.\nبعض قرارات التحسين أو تطوير الأنظمة بتكون خاطئة ولم تأخذ فى الإعتراب المدى البعيد لهيكلة الشركة أوممكن نوع العمل نفسة يتغير لكن النظام المتبع لم يتغير لملائمة التغيرات التى حدثت وممكن كمان يكون فى أجزاء من النظام موجودة لم تعد مستخدمة نهائيا لكن غير قادرين على التخلص منها بسبب أنه فى إعتقاد أننا بحاجة لها أو مستخدمها أو أننا خايفين نحذفها لانه ممكن فى حاجات معين متشتغلش.\nكل ده معناه fragmented legacy of processes (both manual and automated)\nوده عايزين نصلحة علشان نوصل لــ an integrated environment بيئة متكاملة.\nفلما تبدأ تفكر فى الـ Enterprise Architecture مطلوب منك أنك تفكر فى النظام ككل مترابط ببعضة مش أجزاء منفصلة.\n\nالجزء الثانى من الإجابة:\nThat is responsive to change and supportive of the delivery of the business strategies. \nيعنى الغرض الأساسى من إستخدم الـ Applications أو التطبيقات والتكنولوجيا هو فى الأخر خدمة الـ business strategies أو سياسة العمل والتغير أو الـ change قادم لامحالة، يعنى محتاجين أنه يكون الـ Architecture بتعنا يقدر يتكيف ويتوائم مع أى تغير هيحصل بسهولة وفى مليون سبب يخلوك تغير فى النظام اللى حاليا شغال (قوانين جديدة – تكنولوجيا جديدة – إجراءات جديدة – متطليات عملاء جديدة – مجلس إدارة جديد – تطبيقات جديدة - مليون سبب - ...) فأحنا محتاجين يكون دائما التكيف لأى تغير أسهل ما يمكن، مش عايزين كل مرة أى تغير نضطر أننا نهد الدنيا ونبنيها من الأول تانى فلما العمل يحتاج أى شئ فالمؤسسة بأكملها بالـ Infrastructure اللى موجود لابد أن يتكيفوا لتفيذ أحتياجات العمل.\n\nتعالو نوضح الكلام بطريقة تانية:\nليه محتاجين Enterprise Architecture\nيتبع...","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1141872965852410"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1141872965852410"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"status","created_time":"2016-05-12T01:17:44+0000","updated_time":"2016-05-12T04:33:34+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"704774279687194","name":"Mohamed Adel Elareef"},{"id":"10212336917157413","name":"Mohamed Alzaki Abdullah"}],"paging":{"cursors":{"before":"NzA0Nzc0Mjc5Njg3MTk0","after":"MTAyMTIzMzY5MTcxNTc0MTMZD"}}},"comments":{"data":[{"created_time":"2016-05-12T04:33:34+0000","from":{"name":"Muhammad Al Rabbani","id":"436443206686932"},"message":"Great stuff, but first you must start with an enetrprise","can_remove":false,"like_count":0,"user_likes":false,"id":"1141942265845480"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEUwTVRrME1qSTJOVGcwTlRRNE1Eb3hORFl6TURJM05qRTAZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEUwTVRrME1qSTJOVGcwTlRRNE1Eb3hORFl6TURJM05qRTAZD"}}}}