{"id":"172338516139198_798984493474594","from":{"id":"522061209","name":"Mostafa Muhammad"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"I am working on a javascript intensive project that I wanted to wrap in a webview to \"app\"itize it but I was disappointed by the poorly performing android WebView ,  Crosswalk is a web runtime built around Chromium which gave me the performance I needed for my app. I am still discovering it but I thought I'd share it with you guys.","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/798984493474594"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/798984493474594"}],"privacy":{"value":""},"type":"status","created_time":"2014-08-13T20:59:42+0000","updated_time":"2014-08-17T03:45:24+0000","likes":{"data":[{"id":"646736197","name":"Waleed Youssry"},{"id":"1383729940","name":"Hisham El-Sheshtawy"},{"id":"774131903","name":"El Sharnoby Mohamed"},{"id":"588981135","name":"محمد عبد القهار"},{"id":"740233917","name":"Muhammad Mahmoud"},{"id":"605146857","name":"Mohammed Abdellatif"},{"id":"1004276189","name":"Mahmoud Fawzy"},{"id":"717738940","name":"Amr Ahmed Elhagary"},{"id":"550693009","name":"Usama Soliman"},{"id":"544815169","name":"Mohamed Meligy"},{"id":"595125669","name":"Ahmad Alfy"},{"id":"695596001","name":"Muhammad Saleh"}],"paging":{"cursors":{"after":"Njk1NTk2MDAx","before":"NjQ2NzM2MTk3"}}},"comments":{"data":[{"id":"798988023474241","from":{"id":"695596001","name":"Muhammad Saleh"},"message":"Ahmed Hassan Salem Mohammed Saudii eh ?","message_tags":[{"id":"687336361","name":"Ahmed Hassan Salem","type":"user","offset":0,"length":18},{"id":"644751676","name":"Mohammed Saudii","type":"user","offset":19,"length":15}],"can_remove":true,"created_time":"2014-08-13T21:10:17+0000","like_count":2,"user_likes":false},{"id":"798997710139939","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Are you plugging it into the Java project phonegap generates?","can_remove":true,"created_time":"2014-08-13T21:39:20+0000","like_count":0,"user_likes":false},{"id":"799000386806338","from":{"id":"522061209","name":"Mostafa Muhammad"},"message":"No, Crosswalk generates its own APKs.\n\nI stumbled upon a cordova-chromium project somewhere but I didn't test thoroughly.\n\nAnother good thing about Crosswalk is that it is written in python so I can look under the hood and even modify it. I'm yet to meet my first gotcha though","can_remove":true,"created_time":"2014-08-13T21:49:01+0000","like_count":4,"user_likes":false},{"id":"800391796667197","from":{"id":"522061209","name":"Mostafa Muhammad"},"message":"After a 4 days hackathon, I think I have a few additional notes\n\n1) Crosswalk will only work on Android 4.0+\n\n2) You can embed Crosswalk into a native Android App (I took that approach), They have a cordova version as well but I didn't test that\n\n3) One of the MOST useful features is the possibility to use Chrome remote debugging to inspect and interact with elements that are in my embedded WebView directly from my desktop browser, Getting all the goodies of Chrome developer tools (Javascript/Dom Breakpoints, Running console code, Real Time CSS modification, etc....)\n\n4) My App size is about 20MB my assets and resources are about ... 5MB, so I think crosswalk does inflate your app size\n\n5) You can have your Javascript code interact with your Java code by using JavascriptInterface as you would with a WebView but to have your Java code execute Javascript code in Crosswalk you have an \"evaluateJavascript\" method which feels cleaner than the \"loadUrl\" approach employed by WebView (Prior to Kitkat which comes with a chromium webview)\n\n6) You can use all sorts of bleeding edge HTML5 and CSS3 in your app, I found the CSS3 Transitions to look spectacular under Crosswalk. Libraries like animate.css work flawlessly on Crosswalk (Thanks Alfy), Also You can use APIs like FileStorage, LocalStorage, Audio, etc. Some of those will require the proper <user-permission> tags in your manifest\n\n7) The app sometimes becomes less responsive and I felt the mobile overheat a bit, nothing objective here just an unsubstantiated observation but It safe to say that while you are using HTML/CSS you should always remember that you are running on a phone with limited resources and that chromium is not doing voodoo magic. If you do expensive stuff in your code your app will lag, drain battery and overheat the device\n\nThat's all I have for now, It was a 4 days hackathon I didn't have time to neither profile nor optimize the code so I think I might have more when I dig into that matter","message_tags":[{"id":"595125669","name":"Alfy","type":"user","offset":1246,"length":4}],"can_remove":true,"created_time":"2014-08-17T03:45:24+0000","like_count":4,"user_likes":false}],"paging":{"cursors":{"after":"WTI5dGJXVnVkRjlqZFhKemIzSTZPREF3TXpreE56azJOalkzTVRrM09qRTBNRGd5TkRjeE1qUTZMVEU9","before":"WTI5dGJXVnVkRjlqZFhKemIzSTZOems0T1RnNE1ESXpORGMwTWpReE9qRTBNRGM1TmpReU1UYzZMVEU9"}}}}