{"id":"172338516139198_1193645907341782","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":"السلام عليكم\n\nمن فضلكم سؤال: هل استخدام Stored عن طريق EF حيكون اسرع من إستخدام Entity نفسها لتنفيذ الأمر ...","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1193645907341782"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1193645907341782"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"status","created_time":"2016-08-01T09:49:28+0000","updated_time":"2016-08-01T21:34:43+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"827049870776926","name":"Ahmed Mohamed Abd El-Hamid"}],"paging":{"cursors":{"before":"ODI3MDQ5ODcwNzc2OTI2","after":"ODI3MDQ5ODcwNzc2OTI2"}}},"comments":{"data":[{"created_time":"2016-08-01T10:16:51+0000","from":{"name":"Meligy","id":"10154884040385170"},"message":"أيوة بس مش كتير. مش فرق ملحوظ في أغلب الحالات ولايستاهل نقل الشغل ليها.\n\nلو معندكش مشكلة معينة التفكير في الحوار ده هيبقى ملوش داعي وربما تضييع وقت عن حاجات أهم مهم تستغل فيها الوقت ويكون ليهة اثر ملحوظ. ده اللي بيسموه premature optimisation,و بيعتبر anti pattern, يعني حاجة ضد ال design patternsكده","can_remove":false,"like_count":4,"user_likes":false,"id":"1193654550674251"},{"created_time":"2016-08-01T10:18:36+0000","from":{"name":"Meligy","id":"10154884040385170"},"message":"طبعا لو فبه حالة معينة بتضطر تجيب entities كتير من السرفر علشان تعمل تعليهم شغل ممكن كله يتعمل في الداتابيس والموضوع بطيء وانت بتفكر في حلول يبقى يستاهل تجرب","can_remove":false,"like_count":0,"user_likes":false,"id":"1193655017340871"},{"created_time":"2016-08-01T10:25:11+0000","from":{"name":"Islam Eldemery","id":"10158221546925461"},"message":"لو عندك stored procedure وبتستخدم ef يبقا انت عملت ال stored لسبب ليكن ال performance ولو كان هوا دا السبب يبقا ليه تنادي على stored عن طريق ال ef نادي عليها manually وامشي ضد الديزاين في الحتة دي بس باعتبارها مهمة والباقي يبقا مع ال ef","can_remove":false,"like_count":0,"user_likes":false,"id":"1193657220673984"},{"created_time":"2016-08-01T10:26:54+0000","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":"الفكرة كلها انى عامل فانكشن فى سضم وللأسف مش راضية تتشتغل عن طريق EF فحليتها عن طريق انى استخدمتها عن طريق Stored فعشان كده بسئل","can_remove":false,"like_count":0,"user_likes":false,"id":"1193657757340597"},{"created_time":"2016-08-01T10:46:13+0000","from":{"name":"Islam Eldemery","id":"10158221546925461"},"message":"بما ان سؤالك عن السرعة انده عليها عادي بدون ef بال sql connection وال sql command","can_remove":false,"like_count":0,"user_likes":false,"id":"1193667657339607"},{"created_time":"2016-08-01T19:55:55+0000","from":{"name":"سامح دعبس","id":"1873036762957490"},"message":"الإجابة التقليدية\nIt depends :)\nهنا عندنا نقطتين:\n1- بالنسبة لل sql server فهو هايعمل optimization للكويريز اللي مكتوبة في الstored procedure و هايعمل برضو optimization للdynamic queries اللي هي بتكتبها بإيدك أو اللي بتطلع من ال EF و بناء عليه, مش هاتحس بفرق كبير إلا لو أخذت في الحسبان النقطة التانية...\n2- بصورة كبيرة, يسيء المبرمجون استخدام ال linq queries في ال EF, و بالتالي الكويريز اللي بتطلع من ال EF بتكون سيئة جدا و بتبهدل ال performance بصورة كبيرة, و المشكلة دي منتشرة جدا. و بالتالي عشان نقارن مقارنة صحيحة لازم تكون بين كود مكتوب في ال stored procedure و كود شبهه بالظبط أو قريب منه قوي طالع من ال EF.\n---------\nمن جهة أخرى فيه 3 مدارس في كتابة في كتابة الكود في الstored procedures أو داخل قاعدة البيانات بصفة عامة (لكل منها مميزات و عيوب خارج نقاط الحديث هنا)\n1- اكتب بزنس عادي عادي أو كل البزنس في ال stored procedure و دي مدرسة قديمة و فيه ناس لسه بتتبعها\n2- ما تكتبش حاجة خالص من البزنس في قاعدة البيانات, لا في stored procedures و لا غيرها, قاعدة البيانات فيها جداول بس, و يمكن كسر هذه القاعدة للضرورة القصوى, و الضرورة تقدر بقدرها :) يعني لازم تذكر أسبابا وجيهة لهذه الفعلة الشنعاء :)\n3- فيه مدرسة جديدة وسط بين الاتنين, بتقول لك البزنس إياك تكتبه في قاعدة البيانات إلا للضرورة القصوى (زي المدرسة 2) لكن الاستعلامات زي المستخدمة في التقارير و البحث ...إلخ مفيش مانع إنك تكتب كود في الداتابيز هنا, و الكود هايكون optimized على القراءة فقط, يعني سريع جدا, و ده architecture pattern اسمه CQRS مع شيء من التبسيط\n----------\nطبعا دي علامات إرشادية مش عقائد يلزم اتباعها, و أنت اللي تقرر هاتمشي إزاي, بس خليك متسق و حافظ على مدرسة واحدة و استمر عليها\n------\nنرجع لسؤالنا, لو سؤالك ده مرتبط بسؤالك اللي سألته قبل كده عن ال full text search و إنك حطه في function أو stored procedure, فنعم, خليه في ال stored procedure و لا يهمك أي مدرسة تتبع, المشكلة تستاهل :)","can_remove":false,"like_count":1,"user_likes":false,"id":"1193982483974791"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEU1TXpZAMU5EVTFNRFkzTkRJMU1Ub3hORGN3TURRMk5qRXgZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEU1TXprNE1qUTRNemszTkRjNU1Ub3hORGN3TURneE16VTEZD"}}}}