{"id":"172338516139198_724010210972023","from":{"id":"100000116116716","name":"Mohamed Sameeh Sharaf"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"انا مش خريج هندسة و بشتغل في الاي تي ، تفتكر في ليا مجال...","picture":"https://fbcdn-profile-a.akamaihd.net/hprofile-ak-xfa1/t1.0-1/p100x100/1506994_617915431634615_691530197_n.jpg","link":"https://www.facebook.com/M.Magdy.soliman/posts/623362534423238","name":"Mahmoud Magdy","description":"ارفع راسك فوق ، انت خريج تجارة (او اي كلية تانية مش هندسة)\nبكيبورد : محمود سعيد ، مصمم الحلول البرمجية ، اي ام سي مصر Solution Architect – EMC Egypt \n\nمقدمة بكيبورد : محمود مجدي\n\nامبارح جالي السؤال المعتاد ، انا مش خريج هندسة و بشتغل في الاي تي ، تفتكر في ليا مجال...\n\nبرضوا السؤال ده بتسأله كتير و كنت بدي اجابة اي كلام صراحة ، بحفز و بقوله لاء طبعا ملهاش علاقة بس مفيش حاجة و رد قوي، قررت انه اقف وقفة مع النفس كده و ارد بما لا يقطع مجالا للشك للسائلين من هنا و الى ابد الابدين في الموضوع ده.\n\nبس قولت مش انا اللي حكتب الاجابة، انا عايز حد يكون هو خريج حاجة مش هندسة علشان يرد ، دورت في قائمة معارفي و اصحابي لقيت 4 ينفع يكونوا احسن ناس ترد على الموضوع ده:\n- محمد مرزوق – محمد خريج تجارة و شغال في مايكروسوفت الشرق الاوسط Senior Consultant\n- محمد سعد و هو خريج اداب و شغال في مايكروسوفت امريكا Technical Sales Professiona (ايوة يا معلم في ناس خريجي اداب و تجارة و اشتغلوا في مايكروسوفت و وصلوا لمايكروسوفت امريكا)\n- احمد طه و ده خريج تربية موسيقية و بيشتغل في اي بي ام\n- محمود سعيد و هو كان شغال في مايكروسوفت و راح دلوقتي EMC\n\nالاربعة ميتخيروش عن بعض ، بس بما ان وصولي لسعيد اسرع فشرحتلوا الموضوع و هو مشكورا كتب الرد ، مش حعطلكوا بقا و مع مقال محمود (و اللي يقولك بعد كده حاجة اسمها كليات القمة ، اخرم عينه و عليك ان تراعي صلة الرحم و متتهورشي).\n\nمحمود كتب التالي:\n\n\"أعمل ما تحب , حتى تحب ما تعمل\" اه!!! ومش العكس (حب ما تعمل , حتي تعمل ما تحب) في راي الشخصى المتواضع اعتقد ان ده اهم عنصر من عناصر النجاح لاي شخص في اي مجال و ده طبعا متزامن في نفس الوقت مع \"بذل الجهد المطلوب والتوكل علي الله عز و جل وحسن الظن فالمردود حتي و لو كان علي عكس الاهواء\" و ممكن نضرب مثال واقعى هنا عليه انا شخصيا:\n\nالبدايه كانت من اكتر من 24 سنة ,حوالى 1988م  لما اتعاملت مع اول جهاز كومبيوتر فالبيت و هوا الجهاز الخاص باحد اخوتى و من هنا بدأ ال باشن\" Passion  اوالشغف , ان مجال الحاسبات او ال IT هوا هيكو ن مجال \"شغلي\" ان شاء الله , و جت الثانوية العامة و مجبتش مجموع كلية هندسة وكانت خيبة امل ليه و لافراد اسرتي و دخلت كلية التجارة و بعد سنتين من الدراسة جبت اول جهاز كومبيوتر خاص بى و ده كان سنة 2000م  ومن هنا بدئت اذاكر حاجات متعلقة بالـ IT و لما الكلية خلصت و كنت مستني الخدمة العسكرية و كانت وزارة المعلومات و الاتصالات بدات فطرح منح الاي تى و كان نصيبى اني التحقت باطول المنح بعد اجتياز الاختبارات الخاصة (من 5000 متفدم ,121 بس اتقبلوا) من جامعة NBU الكندية و فى اخر الدراسة اتيحت ليه الفرصة انى ادرب في سنرجى (لييج او جلوبل نولدج دلوقتى) ثم الاتحاق بالعمل معهم لاربع سنوات تقريبا , ثم سنة و نصف تقريبا مع رقميات فالامارات ثم مع ميكرسوفت مصر لحوالى خمس سنوات , ثم ميكرسوفت جلف لسنة و نصف تانية و اخيرا و ليس باخر (ان شاء الله) أي أم سي.\n\nانا شخصيا لو جيت رجعت الشريط من الول و جيت شوفت الواحد كان موفق في ايه و ايه اللي ممكن اشاركة مع الشباب اللي لسه بيبدأ طريقة , ده هيبقى فالنقاط المختصرة التالية (كلها حصلتلي) و لاي مشورة مفصلة علشان مطولش عليكم , ارجوالتواصل على: http://buff.ly/1mHHeKO\n• تطبيق قاعدة \"اعمل اللي بتحبه\"\n• اخذ المشورة من الاشخاص الموثوق فيهم وفي خبراتهم قب لالقدوم على الخطوات او القرارت المصيرية.\n• عدم التوانى في بذل الجهد المطلوب , لان من جد و جد.\n• استثمر فى نفسك حتى لو مفيش مردود مادي فالوقت القصير.\n• عدم الاستماع للكلام المثبط للهمم زاي (انت مش خريج هندسة, بتوع هندسة لو كانوا فالحوا مكنوش داخلوا مجال الIT (بهزر طبعا , لان اعتقد في مجال ال IT الدراسة الجامعية لكل واحد فينا سواء كانت هندسة, طب, تجارة,الخ ساعدته في حياته  العملية فال اي تى بشكل مباشر او حتى غير مباشر, فهيه فالاخر اضافة\n• اعرف امتي تقول \"لا\" فالوقت المناسب , و لو معرفتش تطبق النقطة رقم \"2\"\n• اهم نقطة , حسن الظن فالله من انه لايضيع اجر من احسن عملا.\n\nطولت عليكم و شكرا.\n\n========\nمحمود سعيد خلص و انا احب اضيف شوية ملاحيظ في الهامش:\nفي ناس حتخرج كلامنا من سياقه ، احنا مش بنقلل من اي كلية و لا بنرفع من اي كلية ، مش تقليل من خريجي هندسة او كومبيوتر او اي حاجة ، بس لانه في ناس كتير منضموش للكليات دي لاسباب كتير ، محدش من الكليات يعتبر الكلام ده اهانة او تقليل لانه ده ليس الهدف و لا الغرض\nاللي حيقول انه الكلام ده بس عندنا ، حرد انه من 3 سنين انا كنت في تركيا باخد كورس و اللي بيدينا الكورس كان شغال في http://buff.ly/1mHHhpT و كان خريج فلسفة و معاه دكتوراه في الفلسفة بس معجبوش الموضوع و اشتغل في ال IT و كان Senior Architect و لسه جاي من مشروع في الناتو (هو بريطاني و شغال في شركة امريكي)\n\nاعتقد انه الامثلة و الكلام اللي فوق ده كافي لأي حد خريج اي حتة انه توصله الرسالة ، مفيش حاجة اسمها كليات القمة الطريق مفتوح للكل ، متخليش حد يعجزك ، ممكن اهلك مش شايفين او مش عارفين، خد كلامهم براحة بس متتكسرشي جوا نفسك ، دوووووووووووس يا برنس و ارفع راسك فوق يا برنجي","icon":"https://fbstatic-a.akamaihd.net/rsrc.php/v2/yD/r/aS8ecmYRys0.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/724010210972023"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/724010210972023"}],"privacy":{"value":""},"type":"link","created_time":"2014-04-01T17:23:10+0000","updated_time":"2014-04-02T18:51:57+0000","likes":{"data":[{"id":"100006628839600","name":"Taha Adel Mansour"},{"id":"100000297525269","name":"Mohamed Amin"},{"id":"536656275","name":"Ahmad Gamal El Din"},{"id":"100006670625829","name":"Ahmed Shallal II"},{"id":"1246823411","name":"Abdelrady Fcis"},{"id":"695596001","name":"Muhammad Saleh"},{"id":"521157584","name":"Haitham Desoki"},{"id":"100001793708731","name":"Mohamed Badawi"},{"id":"558270644","name":"Mahmoud Magdy"}],"paging":{"cursors":{"after":"NTU4MjcwNjQ0","before":"MTAwMDA2NjI4ODM5NjAw"}}},"comments":{"data":[{"id":"724011960971848","from":{"id":"661261340","name":"Mohammad Tayseer"},"message":"أنا خريج هندسة وبأقوللك ليك مجال طالما هتتوكل علي الله بجد وتفضل تتعلم","can_remove":true,"created_time":"2014-04-01T17:28:58+0000","like_count":1,"user_likes":false},{"id":"724013884304989","from":{"id":"100000116116716","name":"Mohamed Sameeh Sharaf"},"message":"ملاحظة : أنا ناقل العنوان من البوست :)","can_remove":true,"created_time":"2014-04-01T17:34:55+0000","like_count":1,"user_likes":false},{"id":"724014064304971","from":{"id":"683348407","name":"Eslam Zidane"},"message":"أنا خريج هندسة و بقول لك بلا وجع قلب :D","can_remove":true,"created_time":"2014-04-01T17:35:20+0000","like_count":3,"user_likes":false},{"id":"724014374304940","from":{"id":"661261340","name":"Mohammad Tayseer"},"message":"Mohamed Sameeh Sharaf مانا عارف :)","message_tags":[{"id":"100000116116716","name":"Mohamed Sameeh Sharaf","type":"user","offset":0,"length":21}],"can_remove":true,"created_time":"2014-04-01T17:36:17+0000","like_count":1,"user_likes":false},{"id":"724014410971603","from":{"id":"100001793708731","name":"Mohamed Badawi"},"message":"الجروب هنا اغلبهم ناس متعاونه ومش محبطة  - نفس البوست ف اماكن تانية كنت هتطلع بانطباع وحش جدا","can_remove":true,"created_time":"2014-04-01T17:36:29+0000","like_count":0,"user_likes":false},{"id":"724048000968244","from":{"id":"512838371","name":"Ahmed Mahmoud"},"message":"انا و 2 صحابي خريجين طب و بنقولك دوس ☺","can_remove":true,"created_time":"2014-04-01T18:53:21+0000","like_count":2,"user_likes":false},{"id":"724062407633470","from":{"id":"1166811676","name":"Mahmoud Kandeel"},"message":"شكراً بجد على المشاركة :)","can_remove":true,"created_time":"2014-04-01T19:32:08+0000","like_count":0,"user_likes":false},{"id":"724066637633047","from":{"id":"695596001","name":"Muhammad Saleh"},"message":"علي فكره انا مش بعترف بالشهادات او بالمسميات الوظيفية والكلام ده\nاللي بيعوز يعمل حاجه بيعملها\nوانا من احسن الناس اللي اشتغلت معاهم كانوا خريجين كليات غير تخصصنا وكلهم كانوا ما شاء الله جامدين جدا\nوبالعكس علي فكره ده في ناس بتبقي عشان عارفه انها مش خريجة كليه في نفس التخصص بتذاكر وبتجتهد عشان تثبت انها تستحق تشتغل في اي مكان وفعلا بجد الناس دي ما شاء الله ربنا يحفظها بيكونوا جامدين جدا\nوربنا يوفقنا كلنااا :)","can_remove":true,"created_time":"2014-04-01T19:42:21+0000","like_count":2,"user_likes":false},{"id":"724069477632763","from":{"id":"100001360671902","name":"Mohamed Moshrif"},"message":"هو الموضوع على حسب إيه بالضبط في ال IT؟؟ يعني الناس اللي مكتوبة اساميهم في الاعلي شغالين في مبيعات وتسويق واستشارات. مجال ال IT نفسه واسع جدا وبيسع ناس من كل التخصصات. فيه دعاية وتسويق ومبيعات واستشارات واداره موارد بشريه وحاجات تانية كتير غير التخصص التقني.\n\nنيجي بقي للتخصص التقني اللي أظن ممكن يكون السؤال عليه. التخصص التقني نفسه برضه فيه مجلة كتير. يعني ممكن ناخد مجال منتشر جدا في مصر زي مجال برمجه مواقع الإنترنت (web development) المجال ده فيه مصممين وناس مثلا بيعملوا graphics بيكونوا بعاد كل البعد عن التخصص التقني.\n\nالتخصص التقني نفسه بينقسم لأكثر من جزء. فيه اجزاء مش بتحتاج أن حد يكون عندي خلفيه عميقه بعلوم الحاسب وكل اللي بيحتاجه دورة ولا اتنين في تكنولوجيا معينة (.net, جافا, الخ) وبيكون كافي انه يستغل فيها زي مثلا برمجه ال Web Interface, وفيه حاجات تانية ماتنفعشي من غير تخصص عميق ودراسه مستفيضه لعلوم الحاسب (على سبيل المثال برمجه ال Indexing system بتاع محرك بحث زي Google)\n\nالشركات العملاقه زي Google و Microsoft وغيره (وده بحكم إني اشتغلت هناك سنين كتيره من عمري) لما بتحب تشغل حد في أي تخصص تقني دقيق في أي من الحاجات اللي بتعملها, بيبقي شرط أساسي إن تكون دراسته ليها علاقه بعلوم الحاسب, بس أحيانا بيشترطوا على الاقل إن طالب الوظيفه يكون معاه ماجستير فوق الشهاده الجامعيه العاديه اللي ليها علاقة بعلوم الحاسب.\n\nالموضوع مش مختلف كتير عن أي مجال تاني على فكرة. يعني مثلا في مجال البناء, ممكن تلاقي مقاول بيعمل 100 حاجة في بناء أي عمارة ولكن لازم فيه اجزاء معينه لا يستطيع عملها الا مهندس. نفس الكلام في الطب, ممكن أي واحد يدي حقنه, يدي دواء, يخيط جرح, يعمل كمادات, لكن في أي حاجة متخصصة بيبقي لازم دكتور متخصص وساعات لازم يكون متخصص في مجال معين في الطب.","can_remove":true,"created_time":"2014-04-01T19:50:42+0000","like_count":3,"user_likes":false},{"id":"724300740942970","from":{"id":"100000243279571","name":"Abobakr Ahmed"},"message":"بس فى شركات كتيرة بتطلب خريج حاسبات او علوم حاسب","can_remove":true,"created_time":"2014-04-02T10:05:56+0000","like_count":0,"user_likes":false},{"id":"724315394274838","from":{"id":"100001793708731","name":"Mohamed Badawi"},"message":"مهو فى رأيي الموضوع مش فكرة ان الشهادة ليها قيمة أو لا - الموضوع ان ممكن تبدأ وممعكش شهادة او لا \nانا شايف انه ممكن فى اى وقت - وهتشتغل - وتتعب وتخلى الدنيا مراحل - وتخطط للى عاوز توصله سواء بتعليم ذاتي او بشهادات تقنية او جامعة هتاخدها مستقبلا \nويعنى الناس لازم تبقى منطقية \nيعنى اعرف ناس دخلت كلية طب بعد سن التلاتين - طب ليه؟ يعنى عاوز تعمل كارير شفت وانت داخل الاربعينات من عمرك ومتصور انك هتقدر تبقى طبيب شاطر ؟ انا شايفها تمسك باحلام وقتها فات اكتر ما هو طموح \nلكن انك شغال ف مجال بتحبه وعاوز تاخد خطوات اعمق فيه وتدرسه اكاديمي حتى دا انا شايفه منطقي اكتر \nباختصار رأيي ان المجال دا مفتوح اكتر من غيره لغير الدارسين اكاديميا يبدأوا فيه - لكن مش معنى كدا ان الدراسة الاكاديمية ملهاش اى قيمة - أنا كواحد شغال من سنين ومدرستش اكاديمي لسه يوميا بكتشف اكتر الصورة الكلية للموضوع وجهلى بتفاصيل كتير مكنتش فاكرها تهمنى","can_remove":true,"created_time":"2014-04-02T11:06:12+0000","like_count":0,"user_likes":false},{"id":"724321964274181","from":{"id":"540788204","name":"Ahmed Hassan"},"message":"انا خريج اداب قسم تاريخ سنة 2002 وبشتغل ويب دفلوبر (.Net) , وبتشغل في مجال الدوت نت من اول ما اتخرجت ودلوقتي لو سألتني انت كنت بتاخد ايه في الجامعة هتلاقيني نسيت كل اللي اخدته ، وحاسس اني متعلمتش وماأخدتش شهادة لاني بشتغل دلوقتي مش بشهادتي ، بشتغل بس باجتهادي ، وحكاية الشغل ديه بتاعت ربنا والارزاق على الله ...:(","can_remove":true,"created_time":"2014-04-02T11:18:51+0000","like_count":2,"user_likes":false},{"id":"724323934273984","from":{"id":"100001360671902","name":"Mohamed Moshrif"},"message":"ارجع للي انا كتبته فوق ده :)","can_remove":true,"created_time":"2014-04-02T11:26:23+0000","like_count":0,"user_likes":false},{"id":"724324240940620","from":{"id":"100001793708731","name":"Mohamed Badawi"},"message":"مترجعش دا بيقول علينا سرنجية وبتوع حقن :D","can_remove":true,"created_time":"2014-04-02T11:27:29+0000","like_count":0,"user_likes":false},{"id":"724374387602272","from":{"id":"100000297525269","name":"Mohamed Amin"},"message":"كلام طيب  - جزاك الله خيرا :)","can_remove":true,"created_time":"2014-04-02T13:26:04+0000","like_count":0,"user_likes":false},{"id":"724415264264851","from":{"id":"1037546276","name":"Shady Atef"},"message":"بما أن أنا في هندسة (كلية قمة زي ما بيقولوا ) هقول كلمتين مبدأيا اللي فيكوا  دايس جامد في مجال ال IT هيعرف ان في حاجات كتير الواحد المفروض يدرسها عشان يبقي كويس زي Algorithms مثﻻ \nطب عاما احنا في هندسة بنركز علي حاجات أكتر من Software و حاجة زي ال Algorithms مش بندرسها ياستفاضة (ممكن مع نفسك تدرسها ( \n\nاحنا بنركز علي ال Circuits & embedded أكثر بتدرس حاجات Related ll Hardware أكثر من Software \n\nحاجة كمان اللي يعرف عين شمس يعرف ان هندسة الشعبة( حاسبات) فيها بتبقي أخر سنتين  في تخصص كهرباء \n\nطب ايه الميزة اللي عندي ومش عندك أنا من الأخر عندي 3 ميزات \n1- بتفحت في الكلية فببقي متعود ع كده في الشغل (مش كل الناس ) \n2- أنا ممكن أشتغل في حاجات تانية غير ال Software زي embedded systems  & Maybe as Electrical Engineer with some courses \n3- في مواد تانية احنا بندرسها زي كتابة تقارير وادارة مشاريع وقانون مختص بتصاريح والكﻻم اللي زيه أغلبية باقي الكليات مش يتدرسه \n\nباختصار أنا شايف ان أعظم فايدة لهندسة هي تعلم أسلوب تفكير محترم ونقد جيد \n\nاه بالمناسبة انا اتعلمت ال Web Development as self-study (Including MVC frameworks in PHP & currently learning Python)\n\nفايدة تانية لهندسة : النقابة :]","can_remove":true,"created_time":"2014-04-02T15:27:41+0000","like_count":0,"user_likes":false},{"id":"724491740923870","from":{"id":"100002820444536","name":"Egypto Dct"},"message":"Mohamed Moshrif (y)","message_tags":[{"id":"100001360671902","name":"Mohamed Moshrif","type":"user","offset":0,"length":15}],"can_remove":true,"created_time":"2014-04-02T18:51:57+0000","like_count":0,"user_likes":false}],"paging":{"cursors":{"after":"NzI0NDkxNzQwOTIzODcw","before":"NzI0MDExOTYwOTcxODQ4"}}}}