{"id":"172338516139198_454908334548880","from":{"id":"597931547","name":"Yasser Makram"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"picture":"https://fbcdn-profile-a.akamaihd.net/hprofile-ak-xpa1/v/t1.0-1/c16.15.184.184/s100x100/67432_163224743701633_7134997_n.jpg?oh=4a3c5f1a3ac2241a2683fcd46dc6ca3b&oe=5454E4AF&__gda__=1412977938_6b6da069f32ec8803bc00142e5ef2d4b","link":"https://www.facebook.com/barmagly/posts/490191284338309","name":"برمج","description":"هل نظام براءات الاختراع يساعد فعلا على الإبداع؟\nوضع نظام براءات الاختراع للحفاظ على حقوق المبدعين وتوفير مظلة أمان من السرقة وخاصة لحماية الكيانات الصغيرة من جور الشركات ذات الميزانيات الضخمة واستغلال ميزانياتها في قتل إبداع الصغار بسرقتها وتسويقها بشكل أفضل. ذلك على المستوى النظري.\nولكن على المستوى العملي أثبت نظام البراءات أنه يسمح بتسجيل أفكار أساسية معطلة لأي شكل من الإبداع ، ولكن الإبداع والتطور مستمر  في مجال البرمجيات فكيف يمكن تفسير ذلك؟\nببساطة مجال البرمجيات حديث للغاية والتطور فيه مذهل فالشركات الكبيرة يمكنها الالتفاف على هذا النظام باتفاقيات تبادل البراءات مثل الاتفاق القائم بين مايكروسوفت وأبل. أما الأفراد والشركات الصغيرة تفلت بارتفاع تكلفة المقاضاة وحرية النشر خاصة باستخدام الويب.\nولكن انتشار متاجر التطبيقات والسلطة التي تعطيها للشركات العملاقة قد تغير ذلك. فعملية المراجعة التي تقتصر الآن على بعض شروط الأمان وخطوط عريضة لجودة التطبيق قد تمتد إلى براءات الاختراع المستخدمة في التطبيق.\nعلى سبيل المثال ميزة أساسية في التطبيقات حاليا مثل استجابة التطبيق لاستدارة الجهاز إذا كانت مسجلة كبراءة لابد من ترخيصها لتستخدم ويمكن منع أي تطبيق لا يرخصها من الدخول على سوق التطبيقات. مثل هذه السياسات غير مفعلة حاليا لأن الأسواق في مرحلة البناء والشركات ترغب في تشجيع الأفراد والشركات لدخول السوق ولكن لا يجد ما يمنع من تفعيل هذه السياسات باتفاق بين افاعلين الأكبر في هذه الأسواق.\nيبقى الويب كخط دفاع أخير ضد هذه السياسات وهنا تظهر أهمية الوقوف بالمرصاد ضد أي شكل من أشكال الرقابة الحكومية على الويب. هذا ما أرى والله أعلم.","icon":"https://fbstatic-a.akamaihd.net/rsrc.php/v2/yD/r/aS8ecmYRys0.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/454908334548880"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/454908334548880"}],"privacy":{"value":""},"type":"link","created_time":"2012-08-30T19:29:05+0000","updated_time":"2012-08-30T19:29:05+0000","likes":{"data":[{"id":"100002045429029","name":"مُحَمَّد أبو آدم"}],"paging":{"cursors":{"after":"MTAwMDAyMDQ1NDI5MDI5","before":"MTAwMDAyMDQ1NDI5MDI5"}}}}