{"id":"172338516139198_653678844671827","from":{"id":"683805169","name":"Mohamed El Sayed"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"دا فريق العمل المسئول عن برنامج جميل جداً من فئة البرامج المتخصصه في إدارة ميزانية البيت ومتابعة النفقات إسمه YNAB.\nالملاحظ فى الصفحه (واللى ممكن يكون غريب عند بعض الناس) إن أعمار أغلب المبرمجين فى الفريق شكلهم فوق ال 35 او يمكن كمان فوق ال 45 سنة, والبرنامج ناجح, والناس عاملين شغل ممتاز.\nطيب ليه انا بعمل شير لحاجه زى دى؟ علشان أحاول أصحح الصورة المغلوطه اللى بتصور انك لو عندك 30 ~ 35 سنة ولسه بتكتب كود, أو لسه مبقتش Senior, أو Team Leader لحد دلوقتى تبقي فاشل, إلى أخر النماذج اللى على نفس الشكل, يفهموا إن الموضوع مش كدا خالص.\nالموضوع كله متعلق بخبراتك المتراكمه وبمهاراتك وبحبك وفهمك للبرمجه.\n\nإشتغل وبطل التفكير الحكومي بتاع سنتين من التخرج يبقي لازم ابقي Senior, يعدى كمان 3 سنين أبقي Team Leader, بالشكل دا لما يبقي عندك 40 سنة المفروض تبقي رئيس حكومه.\nالدليل على كلامي فى الجزئية الأخيره إن الواحد صادف العديد من المبرمجين أصحاب المناصب إشي دا Senior ودا team lead ودا بقي يقولك انا technical lead  والأخير دا يخضك ويقولك انا Architect, وبالنقاش معاهم بتبان الصوره وهى إنهم من أصحاب الفكر الحكومي اللى وجدوا شركات ضعيفة المستوي ممكن يقنعوهم بأنهم مؤهلين للمناصب دي, وخبراتهم لا يمكن أبداً أن تؤهلهم لتلك المناصب لو كانوا فى شركات بتعرف إزاى تختبر الناس قبل ما توظفهم.\nالشيء الأخر اللى بيلعب دور كبير فى خلق النماذج دى هى المحسوبيه والوساطه فى الشغل. ودا شيء بيدمر أى شخص مجتهد لما يلاقي اللى جنبه علشان بيمسح جوخ (مصطلح مصري أصيل, دور عليه :) ) او بيطاطي للمدير, إترقي واتمريس عليه, والتاني ياعيني لسه فى مكانه لأنه مجتهد بس, من غير حتة المحلسه دي.\nالخلاصه: إشتغل وإجتهد لنفسك, وبإذن الله ربنا هيوفقك وسيبك من وهم المناصب اللى بالسنة وسنتين دى.\nعنوان الصفحه: http://www.youneedabudget.com/company/team","picture":"https://fbexternal-a.akamaihd.net/safe_image.php?d=AQDcQph6p6yP2IyU&w=154&h=154&url=http%3A%2F%2Fcdn.youneedabudget.com%2Fimg%2Fmade%2Fimg%2Fpages%2FTeam%2FGrahamBorlandrevised_140_190_c1.jpg","link":"http://www.youneedabudget.com/company/team","name":"The Team | YNAB","caption":"www.youneedabudget.com","description":"The YNAB Team hails from Australia to Austin, Texas — from Massachusetts to Maine — and a tiny hop from Arizona to Utah. Did we mention Switzerland?","icon":"https://fbstatic-a.akamaihd.net/rsrc.php/v2/yD/r/aS8ecmYRys0.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/653678844671827"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/653678844671827"}],"privacy":{"value":""},"type":"link","created_time":"2013-11-15T08:08:55+0000","updated_time":"2013-11-15T08:08:55+0000","likes":{"data":[{"id":"1246823411","name":"Abdelrady Fcis"},{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},{"id":"1167642849","name":"Mehdi Bahou Amarsal"},{"id":"1313616083","name":"Amr Elramsisy"},{"id":"770091061","name":"Tarik Ibrahim"},{"id":"554691641","name":"Mohammed Khalil"},{"id":"1614120164","name":"Eslam Hamouda"}],"paging":{"cursors":{"after":"MTYxNDEyMDE2NA==","before":"MTI0NjgyMzQxMQ=="}}}}