{"id":"172338516139198_738546486185062","from":{"id":"652024918","name":"Amr Eldib"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"WADL Documents\nIf you're familiar with SOAP APIs, they have WSDL documents that describe the data types and methods of the API.\nREST seem to have something similar, WADL documents.\nAnybody has expierence with WADL?\nI'd like to work on generating WADL for a REST API, and I'm not sure how.\nMore info on WADL\nhttps://en.wikipedia.org/wiki/Web_Application_Description_Language","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/738546486185062"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/738546486185062"}],"privacy":{"value":""},"type":"status","created_time":"2014-04-29T05:56:57+0000","updated_time":"2014-04-30T19:21:10+0000","likes":{"data":[{"id":"100001458637962","name":"Ahmed El-Jabry"},{"id":"548509156","name":"Ahmed Gaber"}],"paging":{"cursors":{"after":"NTQ4NTA5MTU2","before":"MTAwMDAxNDU4NjM3OTYy"}}},"comments":{"data":[{"id":"738566006183110","from":{"id":"676490633","name":"Emad Mokhtar Habib"},"message":"If you done this most of .NET will kiss soap good bye, because most of them are getting away from pain of consuming RESTfull APIs in VS","can_remove":true,"created_time":"2014-04-29T07:25:10+0000","like_count":0,"user_likes":false},{"id":"738580606181650","from":{"id":"1055914266","name":"Hady Ahmad"},"message":"Emad SOAP is not going anywhere. VS is a tool, if it offers poor facilities for consuming web services in however form they are then that's VS's problem.\n\n.NET as a platform and a core piece of infrastructure is and will continue to be used in the enterprise market and that market is not moving away from SOAP. \n\nCertainly not with their more than half a billion dollars of investments put in what we now call legacy enterprise systems, it'll take at least a couple of decades for such a move to happen and until some alternative proves to be more bloated than what's already there -pun intended-.\n\nNow, REST APIs are far from painful to consume, that's kind of unintuitive to say given the purpose it came to existence is exactly the opposite, making it easy to consume web resources, a poorly designed REST interface isn't really REST, it's just a really poorly designed web API.\n\nAnd a poorly designed REST client isn't a RESTful API's problem.\n\nAmr Eldib what exactly are you trying to accomplish, there are a number of different approaches for self describing services and resource discovery. You have HATEOAS, that's another viable approach.","message_tags":[{"id":"676490633","name":"Emad","type":"user","offset":0,"length":4},{"id":"652024918","name":"Amr Eldib","type":"user","offset":950,"length":9}],"can_remove":true,"created_time":"2014-04-29T08:37:21+0000","like_count":1,"user_likes":false},{"id":"738733796166331","from":{"id":"652024918","name":"Amr Eldib"},"message":"I don't think SOAP and REST aim to compete. SOAP is more formal and standardized. While REST is quick and easy to start with.\nBut SOAP is more complete than REST. Like Scott Hanselman said in a podcast: \"I don't want my bank to be using REST, SOAP is more secured and boring.\"","can_remove":true,"created_time":"2014-04-29T16:03:36+0000","like_count":1,"user_likes":false},{"id":"738735039499540","from":{"id":"652024918","name":"Amr Eldib"},"message":"Hady Ahmed A web server product I use everyday (I support) has a REST API. For me to test this API, I have to compose the requests using Fiddler or in a web application. This is very painful, takes forever, and I always make mistakes.\nI found that SoapUI supports REST and WADL. So, I thought if I can write a WADL document that describe the REST API of the product, then I can fix this.\nThere's a very good documentation of the REST API but it's not in WADL format. It's just a human-readable help document. I'm looking into how to turn this into WADL.","message_tags":[{"id":"1055914266","name":"Hady Ahmed","type":"user","offset":0,"length":10}],"can_remove":true,"created_time":"2014-04-29T16:07:01+0000","like_count":0,"user_likes":false},{"id":"738769656162745","from":{"id":"1055914266","name":"Hady Ahmad"},"message":"Amr Eldib Well SoapUI as of version 4.6 supports REST testing with a full array of convenient features. I'm really just probing here, if you can avoid generating WADL documents then you're in a better shape.\n\nhttp://www.soapui.org/REST-Testing/getting-started.html If this doesn't cover your problem, we'll push towards a more direct approach with WADL.\nI suppose what you're really trying to accomplish is automating the whole process, either by automatically generating a WADL from the REST API and using that for your testing or\nThe REST API returning its own WADL to be used in testing.\n\nEffectively, not having to define a test suit manually, updating the test suit as the service updates its interface and so forth, am I correct?","message_tags":[{"id":"652024918","name":"Amr Eldib","type":"user","offset":0,"length":9}],"can_remove":true,"created_time":"2014-04-29T17:35:10+0000","like_count":0,"user_likes":false},{"id":"738772859495758","from":{"id":"652024918","name":"Amr Eldib"},"message":"I'm trying to use SoapUI. It can use WADL to generate all the requests and easily reproduce them.\nSo, I can create a WADL document and then give it to everyone on the team, and we can use that very easily.\nMy question is: how can I create this WADL document?\nIs there a tool that can automatically generate a WADL document from a public API?\nCan I manually create the WADL document by reading the documentation and authoring the document? What tool would I use? what's the syntax?","can_remove":true,"created_time":"2014-04-29T17:44:22+0000","like_count":0,"user_likes":false},{"id":"738916092814768","from":{"id":"661261340","name":"Mohammad Tayseer"},"message":"SOAP vs. REST reminds me with the argument over static vs. dynamic programming languages.\n\nREST was created because SOAP was complex. I remember once that I met problems connecting to a .net SOAP service from a J2ME SOAP client, because each side supported his own interpretation of SOAP! I went back to good old HTTP & it Just Worked (TM)","can_remove":true,"created_time":"2014-04-29T23:43:24+0000","like_count":1,"user_likes":true},{"id":"739297736109937","from":{"id":"1055914266","name":"Hady Ahmad"},"message":"You can definitely write it by hand, although that's an unpleasant experience. Like WSDL, it's just one of those things that are hard to avoid. Here are the specs\n\nhttp://www.w3.org/Submission/wadl/\n\nSome examples:\n\nhttps://github.com/freenerd/soundcloud-api-wadl\n\nhttps://code.google.com/p/pomodoro-server/source/browse/#svn%2Ftrunk%2Fsrc","can_remove":true,"created_time":"2014-04-30T19:21:10+0000","like_count":1,"user_likes":true}],"paging":{"cursors":{"after":"WTI5dGJXVnVkRjlqZFhKemIzSTZOek01TWprM056TTJNVEE1T1RNM09qRXpPVGc0T0RVMk56QTZMVEU9","before":"WTI5dGJXVnVkRjlqZFhKemIzSTZOek00TlRZMk1EQTJNVGd6TVRFd09qRXpPVGczTlRZek1UQTZMVEU9"}}}}