{"id":"172338516139198_935000623206313","from":{"name":"Mohammad Fouad","id":"10154777096910845"},"message":"Anyone here going isA?","story":"Mohammad Fouad shared Cloud Weekend's event to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"10154777096910845","name":"Mohammad Fouad","type":"user","offset":0,"length":14}],"22":[{"id":"1517296145156215","name":"Cloud Weekend","type":"page","offset":22,"length":13}],"38":[{"id":"1598955083708290","name":"Cloud Weekend 2015","type":"event","offset":38,"length":5}],"58":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":58,"length":14}]},"picture":"https://fb-s-d-a.akamaihd.net/h-ak-xpt1/v/t1.0-0/c107.0.130.130/p130x130/11201623_1626088804276948_3282434992854405182_n.png?oh=b982d0bfc80313c50c8aee73201240aa&oe=597040A0&__gda__=1500739431_c8245745faad2a876a0258f01fccfdbc","link":"https://www.facebook.com/events/1598955083708290/","name":"Cloud Weekend 2015","caption":"Cloud Weekend 2015","description":"Egypt's Biggest Cloud Computing and Big Data summit\n\nCloud Weekend 2015 is the 3rd iteration of the Cloud Weekend series launched in 2012. This year we will focus on the emerging trends in Cloud Computing and Big Data  inspired by the latest advances concerning the infrastructure, operations, analytics and available services throughout the global network.\n\nCloud Weekend 2015: We Talk Cloud! \n\nCloud Weekend 2015 brings together a strong array of the CIOs and CTOs of the top Cloud Computing and Big Data players in addition to architects, senior engineers, IT leaders across the board starting with business, to academia and governmental bodies. \n\nSpeakers at Cloud Weekend 2015 are regional and international industry thought leaders from Telecom Egypt (TE), Dell, EMC2, IBM, Microsoft, Oracle, SAP,Vodafone, TeraData, Cloud11, and Google.\n\nCloud Weekend 2015 Structure: \n\n-- Keynotes: Top Notch Speakers from all around the world covering the most advanced technologies from the world\n\n-- Panel Discussions: Top leaders in each track will be discussing a hot topic in each category, sharing their opinions and vision.\n\n-- Sessions: Through 30 minute session, our speakers will cover the latest technologies and introduce their products\n\n--Workshops: Parallel workshops will be introduced to implement the different technologies and get hands-on the different products.\n\n-- Exhibition: Summit sponsors will have a space to have their representatives communicating with our audience.\n \nWhy should you attend?\n\nThe Conference will not only impart valuable knowledge, it will also help you inspire and connect with peers, customers, partners, prospective vendors and colleagues from global multi-national organizations in more profitable and refreshing way. When you attend CW15 you will:\n\n- Become a recognized face/name in Cloud space.\n\n- Develop and share ideas, innovation and knowledge on Cloud Computing and Big Data best practices.\n\n- Meet like-minded cloud professionals and make new business connections. \n\n- Meet new companies and people in the cloud space and build mutually-beneficial business relationships.\n\nWhat’s New this Year?\n\nTo ensure that we grow with and adjust to changing industry needs and priorities, we have made some notable changes while simultaneously moving the brand forward to acknowledge the differing maturity stages, investment levels and adoption phases.\n\n- More keynotes and bellwether speakers from leading international companies.\n\n- World-class panel discussions on the main topics of the conference.\n\n- Cloud Exhibition and on-site workshops for some hands-on experience with latest technologies.\n\n- More networking activities, and group discussions, and way more fun!\n\nHow to attend Cloud Weekend 2015?\n\n• Visit http://bit.ly/cloudweekend\n\n• Create an @[249167708461403:274:Eventtus] account or sign up with Facebook then click on \"Get ticket\" to apply\n\n• Wait for an approval/rejection email with a confirmation code in case of approval\n\n• Buy your ticket from Vodafone stores. Vodafone branches selling our tickets: www.eventtus.com/wheretopay\n\nFollow our social media for speakers and agenda announcements on: twitter @cloudweekend - instagram @cloudweekend \n\n#CWCairo\nWe Talk Cloud!\nwww.cloudweekend.com","icon":"https://www.facebook.com/images/icons/event.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/935000623206313"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/935000623206313"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"event","object_id":"1598955083708290","created_time":"2015-05-02T18:50:25+0000","updated_time":"2015-05-02T18:50:25+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"10154239898491363","name":"Mohammad Ali Diab"}],"paging":{"cursors":{"before":"MTAxNTQyMzk4OTg0OTEzNjMZD","after":"MTAxNTQyMzk4OTg0OTEzNjMZD"}}}}