{"id":"172338516139198_686791748027203","from":{"id":"544815169","name":"Mohamed Meligy"},"to":{"data":[{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"Mohamed Alaa tell us how you moved from Windows and (for only very little part of your time) VS, to Rails abs later Node. JS\nالمايكروفون معاك. اتفضل\nP.S. Might be good topic for Ask Developer Podcast too","message_tags":{"0":[{"id":"100002045429029","name":"Mohamed Alaa","type":"user","offset":0,"length":12}]},"actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/686791748027203"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/686791748027203"}],"privacy":{"value":""},"type":"status","application":{"name":"Mobile","id":"2915120374"},"created_time":"2014-01-18T01:43:36+0000","updated_time":"2014-01-21T05:11:44+0000","likes":{"data":[{"id":"530281302","name":"Alaa Ali Abdullah"},{"id":"587461065","name":"Shady M. Najib"},{"id":"100001793708731","name":"Mohamed Badawi"},{"id":"661261340","name":"Mohammad Tayseer"}],"paging":{"cursors":{"after":"NjYxMjYxMzQw","before":"NTMwMjgxMzAy"}}},"comments":{"data":[{"id":"686809244692120","from":{"id":"661261340","name":"Mohammad Tayseer"},"message":"I think a video demo of a small app made with Rails will make it easier for people to compare","can_remove":true,"created_time":"2014-01-18T02:23:36+0000","like_count":1,"user_likes":false},{"id":"686816188024759","from":{"id":"1055914266","name":"Hady Ahmad"},"message":"Mohammad Tayseer compare rails with what?","message_tags":[{"id":"661261340","name":"Mohammad Tayseer","type":"user","offset":0,"length":16}],"can_remove":true,"created_time":"2014-01-18T02:48:10+0000","like_count":0,"user_likes":false},{"id":"686818428024535","from":{"id":"661261340","name":"Mohammad Tayseer"},"message":"With whatever they are using","can_remove":true,"created_time":"2014-01-18T02:58:31+0000","like_count":0,"user_likes":false},{"id":"686832804689764","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"The question is not about comparing Rails or Node.  The question is about how he made the transition,  especially as a designer,  not a dev-savvy person.","can_remove":true,"created_time":"2014-01-18T04:07:19+0000","like_count":0,"user_likes":false},{"id":"686859834687061","from":{"id":"652024918","name":"Amr Eldib"},"message":"That's an important distinction. I'd like to learn about that too, transition rather than comparing.","can_remove":true,"created_time":"2014-01-18T06:09:07+0000","like_count":0,"user_likes":false},{"id":"686872061352505","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"Thanks a lot guys I just saw the post now as I was traveling to the Capital of Mexico to fix some stuff with the Government for one of the projects i'm working on. \n\nI would love To make it a podcast explaining how i made the transition, the motives and Yes I started my career 9 years ago as a Graphic designer then a web designer, after that i was more of a user interface designer which is a role that you have to be involved more with developers assisting their work and always supporting them with slicing which made me very passionate about development in Silverkey Mohamed Meligy used to call me Friend of Developers :) and the rest of the team as well. \n\nIt was just very complicated for me to learn programming language such as C#. i tried a lot but i couldn't and i had all the mentality to resolve problems may be i wasn't a programmer but i could give him the solution in a direct way and he use his skills of programming to resolve it.\n\nAfter That When I moved to Mexico I had already a very good experience \"or that's what i thought :)\" as a User Interface Designer. and i had experience delivering .NET themes, Sharepoint Themes, etc... all what we use in most of the egyptian companies.\n\nThen I found a job as a Front End Developer in Freshout and it was actually funny because i was being hired to work on a project that was very late to be delivered and they contracted me for only 3 Months :) Now I'm almost 3 years working with them :)\n\nThey don't use any of the technologies we use in Egypt they were depending a lot on Ruby on Rails (I haven't heard of it before) and very high skills in Javascript which i didn't have as well. i was only depending on jQuery plugins. and lets say i had someone that really hated me for no reason and he was always giving a bad impression to my boss which was making me very angry and frustrated you want to learn to keep up but they are always pulling you down! So it wasn't a good start and i wasn't that easy.\n\nI found my self in a position where i must push my skills. BTW they don't use windows at all they use MAC which was also another challenge for me as I was a normal mac user never had the interest to push my skills in using a mac. and i was a loyal windows user :) that was another challenge for me also. You can say I'm a stubborn person which i insist about making something i dream of it days and night and I don't give up till I get it.\n\nNow I'm a Front End Developer I manage most of the projects in our company as an Agency and as a Product company I have a team working with me. My role can change a lot from a project to another sometimes I'm a Backend developer sometimes I'm a front End and sometimes My involvement in a project can be to project manage it. I get involved also in some decisions in the products we do. The person that was always giving bad impressions about me was working under my supervision in the future and he didn't like how the things got changed and he quite (I never treated him as he did). \n\nThe company has a HUGEEEE rule on my learning path and  they were helping me a lot to be the person I am now. and the person i will be in the future. they educated us on a different concept you can be the best programmer in the world but if you don't have a mentality to solve problems before you even start programming most probably you will make a disaster out of the project you are working on. you will not deliver on time and if you did you will have the worst un-maintainable code in this project.","message_tags":[{"id":"544815169","name":"Mohamed Meligy","type":"user","offset":572,"length":14}],"can_remove":true,"created_time":"2014-01-18T07:06:48+0000","like_count":5,"user_likes":true},{"id":"686872694685775","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"I will write more details and I would love to make it a topic for the next Egyptian Geeks/Ask a Developer Podcast :)","can_remove":true,"created_time":"2014-01-18T07:08:18+0000","like_count":0,"user_likes":false},{"id":"686872928019085","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"Mohamed Meligy You have to attend this podcast :)","message_tags":[{"id":"544815169","name":"Mohamed Meligy","type":"user","offset":0,"length":14}],"can_remove":true,"created_time":"2014-01-18T07:09:45+0000","like_count":0,"user_likes":false},{"id":"686878681351843","from":{"id":"740765313","name":"Mohamed Elsherif"},"message":"Sounds like a good topic for a hangout, I think we can do it as early as next Saturday Jan 25th","can_remove":true,"created_time":"2014-01-18T07:40:35+0000","like_count":5,"user_likes":false},{"id":"686879161351795","from":{"id":"100000224131120","name":"Moutaz Shams"},"message":"متخيل ريهام السلهي هي اللي عامله اللقاء معاه على المحور وبتطرده في آخر الحلقة بسبب التطاول على الدوت-نت :D","can_remove":true,"created_time":"2014-01-18T07:44:23+0000","like_count":1,"user_likes":false},{"id":"686905431349168","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Thanks a lot Mohamed Alaa :)\n\nCan you expand more on the experience itself as well? How did you get from what you call a normal mac user to getting familiar with using Rails and Node tools daily? What was the learning path? The steps and phases if you see what mean. Thanks again.","message_tags":[{"id":"100002045429029","name":"Mohamed Alaa","type":"user","offset":13,"length":12}],"can_remove":true,"created_time":"2014-01-18T09:35:30+0000","like_count":1,"user_likes":false},{"id":"688527344520310","from":{"id":"740765313","name":"Mohamed Elsherif"},"message":"https://www.facebook.com/events/1393735840884800/?ref=3&ref_newsfeed_story_type=regular","can_remove":true,"created_time":"2014-01-21T05:11:44+0000","like_count":2,"user_likes":true}],"paging":{"cursors":{"after":"Njg4NTI3MzQ0NTIwMzEw","before":"Njg2ODA5MjQ0NjkyMTIw"}}}}