{"id":"172338516139198_1177892158917157","from":{"name":"Amro Samy","id":"1340940709288148"},"message":"I know it is out of context, but I'm just sharing it for you to make use of it. \nThis is an event held by students studying at U.S. universities and European ones, and Dr. Tarek Rakha (at MIT). The event is intended to introduce the concept of studying abroad and the procedures for the process, and the fund. So, if you're interested in obtaining a degree, just contact the people at the event!!","story":"Amro Samy shared STEM Motivation's event to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"1340940709288148","name":"Amro Samy","type":"user","offset":0,"length":9}],"17":[{"id":"1655592474653243","name":"STEM Motivation","type":"page","offset":17,"length":15}],"35":[{"id":"1066678113424633","name":"College Pathway","type":"event","offset":35,"length":5}],"55":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":55,"length":14}]},"picture":"https://fb-s-d-a.akamaihd.net/h-ak-xta1/v/t1.0-0/c29.0.130.130/p130x130/13697195_1778737069005449_4482362273142125705_n.jpg?oh=ec5851407e4893789d2fdde24a9ebb3f&oe=592655D8&__gda__=1496178762_743cbcee904a213f4a94bd5fdbc5bdef","link":"https://www.facebook.com/events/1066678113424633/","name":"College Pathway","caption":"College Pathway","description":"المنح دايمًا بنعرف عنها حاجات في شكل خطوات وتعليمات، مبنكونش عارفين درجة صحتها أو واقعيتها، وبنكون حاسين ان الناس اللي بتاخد منح دي من كوكب تاني غيرنا و في فكرة دايما في دماغنا إننا عشان نسافر لازم يكون معانا فلوس او نكون من أوائل الثانوية العامة او نكون جايبين درجات خرافية في الامتحانات الدولية؛ هل دا صح؟ طب ازاي نقدم على المنح؟ نسبة قبولنا هل هتكون عالية ولا مفيش أمل؟ قوة الـ Application بتاعنا بتتحدد على أساس ايه؟ \n\nعشان كده  قررنا نجيبلك ناس من قلب التجربة، ناس سافروا وأخدوا منح فعلًا بمعنى أصح ناس فعلا يعرفوا يفيدوك عشان يحطّوك على أول الطريق، وعشان تعرف تفاصيل التقديم خطوة بخطوة وتكون على أرض ثابتة و تحررك من كل الشائعات اللي فوق دي\n\nفي College Pathway هتعرف عن 4 أنواع من المنح:\n1- منح ألمانيا خاصة و أوروبا بشكل عام.      \nيعني هتعرف ازاي تقدم على المنح و هل فعلا السفر لاوروبا محتاج منح ولا ممكن تقدر توفر انت الفلوس؟ و لو عايز تتعلم ألماني ايه المراكز المعتمة و الـ تاخد منها شهادات فعلا موثوقة و ايه الأماكن الـ تروحها علشان تعرف المنح الـ شغالة فالوقت دا.\n\n2- منح أمريكا لطلاب الـ  undergraduate \nأمريكا فعلا من البلاد الغالية في التعليم حتى على الأمريكان نفسهم بس دا مش معناه اننا نفقد الأمل، أمريكا فيها اكتر من ٤٥٠٠ جامعة اكيد في واحدة فيهم تناسبك فكل حاجة و تديك منحة \n\n3- منح أمريكا لطلاب الـ Graduate \nودي بقى نسيبها مفاجأة في اليوم علشان منبوظهاش عليكم بس هنجيبلكوا ناس عاشوا فعلا التجربة و يمكن لِسَّه عايشنها لغاية دلوقتي.\n\n4- منح جوه مصر\nالمنح مش شرط تكون هتسافر بره، لو أنت عايز تتعلم تعليم أحسن في جامعات محترمة جوه مصر في جامعات زي (الجامعة الأمريكية والألمانية والبريطانية وجامعة النيل وجامعة زويل) هنقولك ازاي من الصفر \n\nهنستناكم يوم السبت 23-7 في جامعة زويل للعلوم والتكنولوجيا من 9 الصبح لـ5 مساءً، ويوم الأحد 24-7 هنكرر نفس البرنامج عشان اللي مش مناسبه الميعاد الأول \n\nسعر الـتيكت 25 ج، وعشان تستلم الـTicket بتاعتك املأ الفورم دي عشان ننزل أقرب الأماكن للناس وهنبلغك قبلها، الفورم هتكون مهمة وقت الـRegistration للايفينت عشان الناس هتدخل ببياناتها\nو عشان الناس اللي من أماكن بعيدة دي أرقام فودافون كاش اللي ممكن تحولوا عليها الفلوس وتاخدوا التيكت يوم الايفينت، لكن الأفضل طبعًا تروح تستلم الـTicket بنفسك\n+201098186013\nلينك الفورم: http://goo.gl/forms/8Xkwq2LBwPpFvLMJ2'\n\nولو عندك أي استفسار عن الحجز ممكن تكلمنا على الأرقام دي: \n1- الجيزة و القاهرة 01017610197\n2. اكتوبر 01124869049\n2- شبرا 01061390936\n3-كفرالشيخ 01013344783\n5- بنها 01007804046\nتنويه: ارقام فودافون كاش للتحويل فقط مش للاستفسار و شكرا. \n\n#College_Pathway\n#STEM_Motivation \n#ZCSU","icon":"https://www.facebook.com/images/icons/event.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1177892158917157"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1177892158917157"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"event","object_id":"1066678113424633","created_time":"2016-07-08T21:38:00+0000","updated_time":"2016-07-08T21:38:00+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"580982248767898","name":"Mona Abouelkhair"},{"id":"1200777176707152","name":"Ahmad Dawoud"},{"id":"1220747848038855","name":"Amr Hamdy"},{"id":"670618186444388","name":"Aya Fawzy"},{"id":"342947436105550","name":"Muhammed Nagy"},{"id":"1804882236439585","name":"Ahmed Marey"},{"id":"1728123627478018","name":"Ahmed Ali"},{"id":"1233205586796783","name":"Ahmed Naser"}],"paging":{"cursors":{"before":"NTgwOTgyMjQ4NzY3ODk4","after":"MTIzMzIwNTU4Njc5Njc4MwZDZD"}}}}