{"id":"172338516139198_808351315871245","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"كنت عيز اخد راي الجيكس فى حاجة مهمة جدا بنسبالي...\nانا دخلت مجال البرمجة من حوالي سنتين تقريبا وعندي مشكلة\nفى خلال السنتين دول كنت ديما بذاكر وبتعلم حاجات جديدة باستمرار\nيعني مثلا اتعلمت c#,asp.net,sql server,winforms وذاكرت شوية game developement وعملت لعبة صغيرة علي قدي المهم دايما بطبق اللي بتعلمه\nوحاليا شغال بقالي سنة ونص ويب ديفلوبر, من فترة قريبة قررت اني اتوجه للاوبن سورس فبدات اتعلم php, mysql, laravel framework\nالمشكلة انى بذاكر وبطبق ديما يعني بدعم المذاكرة دي بتطبيق ولو حتي بعمل امثلة علي اللي اتعلمته...\nبس مشكلتي اني لو رجعت للحاجة بعد فترة بلاقي نفسي نسيت حاجات كتير !!\nفبضطر اني ارجع اقرا شوية عشن انعش الذاكرة وافتكر..\nمع العلم اني مذاكرتش بورقة وقلم كل مصادري كتب وفيديوهات وحاجات زي كده..\nافيدوني ايه الحل اني اثبت كل حاجة بتعلمها في دماغي ولما ارجعلها بعد فترة الاقيها موجودة ... هل في طريقة للمذاكرة معينة ممكن تساعدني ؟ هل الخرائط الذهنية والكلام اللي من النوع ده هيساعدني ؟\nمحتاج مساعدتكم..وشكرا ليكم مقدماً","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/808351315871245"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/808351315871245"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"status","created_time":"2014-09-02T20:40:55+0000","updated_time":"2014-09-04T01:53:13+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"10207671091048083","name":"Khaled Mhd"},{"id":"715713385273130","name":"Ahmad Magdy"},{"id":"703740743120479","name":"Mahmoud Elsheemi"},{"id":"1615887465092802","name":"Abdelrahman M. Moez"},{"id":"599781276899213","name":"Mostafa Hussein"}],"paging":{"cursors":{"before":"MTAyMDc2NzEwOTEwNDgwODMZD","after":"NTk5NzgxMjc2ODk5MjEz"}}},"comments":{"data":[{"created_time":"2014-09-02T20:43:54+0000","from":{"name":"Mahmoud Fahmy Elbalasy","id":"10206865647514640"},"message":"رجز في حاجات معينه و شغلها مبني علي بعض و ابعد عن التشتيت","can_remove":false,"like_count":1,"user_likes":false,"id":"808352042537839"},{"created_time":"2014-09-02T20:47:52+0000","from":{"name":"Abdelrahman M. Moez","id":"1615887465092802"},"message":"اللى بيحصلك ده طبيعى ماتقلقش .. و لو هتفتكر حاجة فهتبقى مجرد الـ basics .. فزى ما #محمود قال كده ... ركز و ابعد عن التشتيت :)","can_remove":false,"like_count":1,"user_likes":false,"id":"808353492537694"},{"created_time":"2014-09-02T20:49:37+0000","from":{"name":"Mahmoud Elsheemi","id":"703740743120479"},"message":"على فكرة انا مبتدئ ولسه بدرس بس فعلا انا عارف المشكلة دى لانها شائعة وفعلا زى ماقال الاعضاء حاول يبقى عندك خلفية بسيطة عن كل حاجة بس تركز فى مجال واحد عشان ساعتها المعلومات هتكون مبنية على بعضها وهتقدر تربط كل شئ فى دماغك من غير ماتنساه","can_remove":false,"like_count":1,"user_likes":false,"id":"808354005870976"},{"created_time":"2014-09-02T20:56:05+0000","from":{"name":"Mohamed Elsherif","id":"10158483817400314"},"message":"ده عادي, في الآخر مستحيل تفضل فاكر تفاصيل كل حاجة طول الوقت, الخبرة نفسها بتفضل معاك و بتحس بيها و انت بتعمل حاجة عملتها قبل كده حتى لو بقالك فترة كبيرة بعيد عنها, لكن دايماً حتحتاج تراجع تفاصيل أو تدور عليها تاني.","can_remove":false,"like_count":7,"user_likes":false,"id":"808356149204095"},{"created_time":"2014-09-02T20:58:52+0000","from":{"name":"Sabr Bry","id":"10202565635620285"},"message":"Mohammed Ezzat this is quite normal ( at least this is what happens with me ) .. I read posts i wrote 8 years ago .. and i know nothing about what i was talking about then :)\n\nالفكره انك -كاستنتاج- متعلم البرمجه بالدراع مش خريج كليه\nفانت حاسس انك متأخر او ان في حاجات كتير محتاج تتعلمها\nوده مش حقيقي\n\nI think it's time to change your mind from learning too many languages to I want to do 'X' and i need to know 'Y' inorder to do 'X'\n\nExample:\n\nI want to make an iPHone application that does X,Y,Z .. so i need to learn objective-c, and for the backend i need to know dynamoDB & Php ..etc","can_remove":false,"like_count":6,"message_tags":[{"id":"10209738059582902","length":14,"name":"Mohammed Ezzat","offset":0,"type":"user"}],"user_likes":false,"id":"808356769204033"},{"created_time":"2014-09-02T21:14:19+0000","from":{"name":"Sameh Magharious","id":"10154141190610448"},"message":"زي مااتقال, دي مشكلة عامة, و مش بس في مجالنا .. ابسلوتلي :D\nنفس المشكلة دي بتواجهك في الجامعة لما تبدأ كورس معتمد علي كورس تاني اخدته من سنة, بتضطر تراجعه تاني.\n\nنقطة مهمة لازم تخلي بالك منها و هي إنك تفرق بين المفاهيم Concepts  والتفاصيل Details. مش مشكلة إنك تنسي التفاصيل لأني دي حاجة مش هتقدر تتجنبها, لكن إنك تنسي المفاهيم هي دي المشكلة. معظم اللي Architects الناجحين اللي اتعاملت معاهم, لاحظت إني المفاهيم الاساسية بتجري في دمهم رغم انهم مابيكتبوش كود من سنين وعشان كده قادرين يبنوا انظمة ناجحة\n\nوإنت بتذاكر حاول تقف عند أي مفاهيم جديدة واقراها أو ذاكرها أكتر من مرة, بعدين لخصها بطريقتك. بعد كده كمل علي التفاصيل عادي. أول ماتحس إنك نسيت كل حاجة, ارجع للي كتبته وهتلاقي أكتر من 50% من التفاصيل رجعت في ذاكرتك لوحدها.","can_remove":false,"like_count":8,"user_likes":false,"id":"808361519203558"},{"created_time":"2014-09-02T21:27:00+0000","from":{"name":"أحمد سراچ","id":"1238373282942943"},"message":"بالتطبيق ده أنت إجتازت 80% يا مان :) \nإستمر \nبس الفكرة إنك لازم تدون كل كود أنت بتكتبه و ده العامل اللى كلنا بنهرب منه \nو كل يومين إمسك الكشكول و إقرأ اللى أنت كتبته قراءة سريعه \nأرجو إنى  أكون أفدتك :) \nمتجربة =D","can_remove":false,"like_count":1,"user_likes":false,"id":"808366415869735"},{"created_time":"2014-09-02T21:54:27+0000","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"خلى بالك الموضوع دا طبيعي جداً وبيحصل لكل الناس, وبالتالى متحسسش نفسك إن دا عيب أو نقصان من الواجب إكماله, بالعكس, دا هيفضل, بس المهم تتأقلم معاه بشكل سليم.\nفي رأيي المتواضع, أكتر حاجه ممكن تفيدك جدا جدا جدا (إكتبها عدد مرات زى ما انت عاوز :) ), إنك يكون عندك blog حتى لو كان خاص بيك ومش ناشره (طبعاً الأفضل نشره حتى ولو هيكون كلامك فيه كله إتداس واتهري فى 100 بلوج تانى).\n\nأكبر إستفاده هتكون إنك وانت متعمق فى تقنيه معينه او Framework معين, هتبقي معلوماتك فيه دقيقه وقيمه, وبالتالى هتعرف تكتب عنها بشكل منظم وسليم و تو ذا بوينت :), وبالتالى هتخلى البلوك بتاعك عباره عن مجموعه من ال tricks و ال reminders ليك بإنك تعمل post لكل موضوع اتعلمته او طبقت عليه أو واجهتك مشكله دوختك حبتين وبعد كدا حلتها, إكتبها فى البلوج (بالتاج المناسب) حتى لو هتكتبها وهتنساها خالص مش مشكله.\nلما تعمل كدا وانت بتروح من التقنيه دى للغه دى وهكذا, لك أن تتصور لو حبيت فى يوم ترجع لحاجه او لحل مشكله بتواجهها بعد فتره كبيره, قد إيه البلوج بتاعك هيكون مفيد ليك (زى فكرة المذاكره بالورقه والقلم اللى كنت بتتكلم عنها).\n\nمعلش طولت عليك, بس بأكد عليك مره تانيه, إعمل بلوج (وياريت تشاركه معانا)    \n\nبالتوفيق :)","can_remove":false,"like_count":4,"user_likes":false,"id":"808373315869045"},{"created_time":"2014-09-02T21:55:54+0000","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"حاجه أخيره بتشتت الناس وممكن تحبطهم, متركزش قوي فى أسلوبك فى الكتابه وإن كل حاجه لازم تكون perfect.\nإكتب كأنك بتتكلم مع نفسك, ومع الوقت أسلوبك هيتطور. :)","can_remove":false,"like_count":2,"user_likes":false,"id":"808373675869009"},{"created_time":"2014-09-03T23:29:56+0000","from":{"name":"Mohammed Sameer","id":"10158336928805371"},"message":"انا ماعرفش اشتغل من غير google. لاني مش حافظ كل ال API  الي باستخدمها. ايوه مع الخبره و كده الواحد بيحفظ شويه بس صعب جدا تحفظ كل حاجه.\n\nانا مره كنت في تدريب علي شيء ما و المدرب سالني انت ازاي قادر تبرمج من غير مايكون ال  API reference مفتوح قدامك؟ و كان ردي ان بادور في جوجل لما باحتاج. الهدف من الحدوته  هو انك مش الوحيد في الموضوع ده","can_remove":false,"like_count":1,"user_likes":false,"id":"808821192490924"},{"created_time":"2014-09-04T01:36:05+0000","from":{"name":"Mohamed Hashem","id":"1387228811341413"},"message":"هو ممكن يكون اللينك ده موضوعه بعيد شويه بس فى ارتباط بعض الشئ \nhttp://www.hanselman.com/blog/AmIReallyADeveloperOrJustAGoodGoogler.aspx","can_remove":false,"like_count":3,"user_likes":false,"id":"808854089154301"},{"created_time":"2014-09-04T01:53:13+0000","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"شكرا ليكم يا جماعة استفدت من كلامكم جدا..","can_remove":false,"like_count":0,"user_likes":false,"id":"808857792487264"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZAPREE0TXpVeU1EUXlOVE0zT0RNNU9qRTBNRGsyT1RBMk16UT0ZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZAPREE0T0RVM056a3lORGczTWpZAME9qRTBNRGszT1RVMU9UTT0ZD"}}}}