{"id":"172338516139198_1030760426963665","from":{"name":"Sameh Saeed","id":"10154266644607344"},"story":"Sameh Saeed shared Source Valley's photo to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"10154266644607344","name":"Sameh Saeed","type":"user","offset":0,"length":11}],"19":[{"id":"1448329132127224","name":"Source Valley","type":"page","offset":19,"length":13}],"35":[{"id":"1510728119220658","name":"","offset":35,"length":5}],"55":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":55,"length":14}]},"picture":"https://fb-s-c-a.akamaihd.net/h-ak-xat1/v/t1.0-0/s130x130/12241781_1510728119220658_24376208814760577_n.jpg?oh=e4d3376b80c181b8a24e561f07ee8561&oe=595C66AB&__gda__=1498907754_68c5e12eb7e06c6327125b9a42ab32e4","link":"https://www.facebook.com/SourceValley/photos/a.1448687935424677.1073741828.1448329132127224/1510728119220658/?type=3","name":"Source Valley","description":"طيب الكلام بتعنا النهارده هيكون عن حجتين مع بعض\n Graphical User Interface (GUI) Vs (CLI) Command line Interface\nيا اخ انا مش فاهم حاجه ايه كومو... و جراف... ايه ! مش فاهم\n--------------------------------------------------------\nهقولك انا يا سيدي شوف انت لما بتيجي تتفرج علي فيلم اجنبي و تلاقي واحد ماسك شاشه سوده كده و نازل تكته و تخبيط في الكيبورد و تحس انك مش فاهم حاجه\n\"متقلقش انت مش لوحدك في الغالب الراجل نفسه مش فاهم حاجه برضه\"\nهي ديه يا سيدي بقي الـ CLI - Command line Interface و مميزتها بقي :\n1 - مش بتستهلك حاجه من امكنيات جهازك \n2 - بتديك تحكم و حريه في انك تستخدم كل ال Command اللي بتقدر عن طريقها تتحكم في الجهاز او السيرفر بتاعك\n3 - بما انها مفهاش صور و روسومات و شغل شقلبه كتير فبتكون اسرع بكتييييير و مع ذلك اخف علي الجهاز بتاعك\n4 - الوسيله الاسرع و الاخف و الاكتر فاعليه لما بتيجي تتحكم في سيرفر موجود في مكان تاني\n\"تخيل معايا بتتحكم في سيرفر موجود في امريكا مين اسرع يبعت الكلام اللي في الشاشه السوده ولا يبعتلي الـ Desktop كله اشوفه و ابتدي اتحكم فيه\"\n--------------------------------------------------------\nبس المشكله اللي قبلتنا هنا ان فيه حاجات مش هنقدر نستخدمها علي الشاشه السوده او زي متفقنا بقي اسمها CLI - Command line Interface زيه ايه مثلا :\nالصور, الافلام, الالعاب و اي حاجه من هذا القبيل,\nو عشان كده جيه هنا دور الـ GUI - Graphical User Interface و ده يا سيدي الحاجات المرسومه و المرئيه عندك اللي حضرتك قاعد و بتقرأ عن طرقها الكلام ده دلوقتي او بتتفرج علي فيلم او تشوف صوره صاحبك اللي قاعد مقضيها في الساحل فتعمله لايك.\n--------------------------------------------------------\n الموضوع اول مبدأ  كان اسمه سعتها X و كان عباره عن مربعات كده تقدر تشوفها من هنا https://goo.gl/srKKaC, بعدين اتطور شويه و بقي اسمه x11 و بعدين  فيه شركه اسمها x.org و شركه كمان اسمها freedesktop.org اتحدوا مع بعض و عملوا حاجه اسمها X.Org Foundation و فضلوا يطورا فيه لحد دلوقتي معظم الواجهات دلوقتي مبنيه عليه م بيشتغلو مع بعض عشان يوفرولنا الشكل اللي احنا شيفينوا دلوقتي.\n--------------------------------------------------------\nدلوقتي هبتدي اقولكم علي اشهر الواجهات الموجوده عندنا في لينيكس و مزياهم\n\n1 - Unity \nده الواجهه الرئيسيه لواحده من اشهر التوزيعات الموجوده Ubuntu \nو بتطور بشكل كبير و سهله في الاستخدام و ده الشكل بتعها http://goo.gl/OXMlYl\n\n2 - GNOME \nو ديه بقي واحد من اقدم و اعرق الواجهات سريعه و من مميزتها انك تقدر تضيف  عليها اضفات زياده علي حسب رغبتك بتيح ليك سهوله و مزايا كتير جدا مش موجوده في اي واجهه تانيه و تقدر تشوف شكلها من هنا http://goo.gl/9sM20n\n\n3 - KDE\n يعتبر من اكتر الواجهات الشبيهه بـ Windows يعني مش هتحس انك بعيد لو لسه في عالم الـ open source و بتقدر تضيف فيه Widgets و تظبط فيه زي ما انت عايز بس للاسف كل ده بيجي علي  حساب السرعه و ده شكله http://goo.gl/DyBRsa\n\n4 - Xfce\n ده بقي يعتبر من اخف الواجهات اللي ممكن تستعملها سريع و خفيف جدا و لو جهازك امكنياته مش كبيره قوي فده هيديك افضل اداء\n\n5 - Cinnamon \nده الواجهه الرئيسيه لواحده من اشهر و اخف و اسرع التوزيعات Linux Mint و ميزته انه خفيف و سريع رغم كده موفر شكل جميل و متناسق و سهل الاستخدام و ده شكله http://goo.gl/cRzO90\n\n6 - LXDE\nده بقي متصمم مخصوص عشان الاجهزه القديمه اللي امكنياتها علي قدها عشان برضه مينفعش ننساها رغم كده موفر معظم الحاجات اللي اي مستخدم طبيعي يحتجها\n\n7 - Xmonad او i3\nهما اتنين مختلفين بس يعتبر ليهم نفس المزايا و هي انه خفيف جدا و سريع جدا و ده يعتبر موجه اكتر لل Sys Admins اللي بيحتاجوا يقسموا الشاشه بتعتهم لكذا شاشه عشان يقروا يعملوا حاجات و يرقبوا النظام ماشي ازاي في كذا مكان في نفس الوقت ده شكل الXmonad لتوضيح http://goo.gl/PURTUo\nده بقي شكل الـ i3 عشان نعرف نفرق بينهم http://goo.gl/Rs3GXr\n--------------------------------------------------------\nو بكده نكون خلصنا الفرق بين الاتنين,\nشاركونا بأرئكم ايه اكتر واجهه بتحبها,\n و لو فيه اي استفسار, اقتراح او رأي نحب نسمعها منكم\n\n#Snowflake","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1030760426963665"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1030760426963665"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"photo","object_id":"1510728119220658","created_time":"2015-11-11T03:46:46+0000","updated_time":"2015-11-11T03:46:46+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"934652753304957","name":"Mohamed Hassan Soltan"},{"id":"1317342155017349","name":"Ahmed Elsayed Shahawi"},{"id":"10211111455435727","name":"Mohamed Shaban"}],"paging":{"cursors":{"before":"OTM0NjUyNzUzMzA0OTU3","after":"MTAyMTExMTE0NTU0MzU3MjcZD"}}}}