{"id":"172338516139198_1299063983466640","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"مفيش حد مصرى للأسف من اللى بيراجعوا الألعاب ساندنى بأى شىء \nحاجه تكسف \nدايما بحب تكون ألعابى مختلفة مش بحب التقليد \nالتفكير فى فكرة لعبه جديدة ممكن ياخد منى وقت اكتر من وقت تنفيذ اللعبه نفسه \nفى الفترة الأخيرة قررت انى أشتغل فى ألعاب بمسميات عربية مش انجليزى علشان حاسس ان لازم نثبت نفسنا فى المجال ده بأى شكل من الاشكال \nبس النتيجة بتكون ضعيفة للمرة التانيه على التوالى \nلأن مفيش دعم حقيقى حتى عل فيس \nبعت لأكنر من حد ليهم قنوات على اليوتيوب \nبيعملوا مراجعات على اليوتيوب للألعاب وكده وللأسف قالولوا حلو وبرافو عليك بس اللعبه محتاجه تطوير عشان ننزلها  عندنا \nوكأن الناس اللى عملوا GTA  ولا Assasin  أول ألعابهم فى بداية حياتهم كانت كده على طول \nمبدئوش من الصفر \nأتمنى الفكر ده يتغير شوية وندعم بعض خصوصا لما الواحد يكون بيتعب بجد وبيحاول يقدم أفكار جديدة \n\nمش عايز أطول أكتر من كده بس عموما لو حابب تساعد فى انتشار اللعبه اعملها شير لاصحابك \nعلشان تلاقى بكرة حد يدعمك ويساعدك فى شغلك او فى اى مكان انت هتشتغل فيه \nوشكرا مقدما","story":"Mostafa Yahia shared a link to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"10211945267005669","name":"Mostafa Yahia","type":"user","offset":0,"length":13}],"42":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":42,"length":14}]},"picture":"https://fbexternal-a.akamaihd.net/safe_image.php?d=AQCkC0emZVDeJJIQ&w=130&h=130&url=https%3A%2F%2Flh3.googleusercontent.com%2FQj9uboEyHqswJ94Z2Wo1mMzWZnUyBbcBHjxibC6WrUaO5etcB7urhj_V6rp6EhdUdCTU%3Dh900&cfs=1&sx=0&sy=0&sw=527&sh=527&_nc_hash=AQD7VKZWePIsR6jz","link":"http://play.google.com/store/apps/details?id=gobla.game.familygame","name":"شجرة العيلة","icon":"https://www.facebook.com/images/icons/post.gif","actions":[{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1299063983466640"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"link","status_type":"shared_story","created_time":"2016-11-20T09:36:24+0000","updated_time":"2016-11-21T22:03:42+0000","shares":{"count":1},"is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"10155221819966004","name":"Harot Hindi"},{"id":"1480954635272474","name":"Ahmed Gharbia"},{"id":"1114731738648932","name":"Maioi Ahmed"},{"id":"10155089803254116","name":"Mustafa Gamal"},{"id":"1413693455348322","name":"Mahmoud Essam"},{"id":"1247070775342639","name":"Ahmed Ibrahim"}],"paging":{"cursors":{"before":"MTAxNTUyMjE4MTk5NjYwMDQZD","after":"MTI0NzA3MDc3NTM0MjYzOQZDZD"}}},"comments":{"data":[{"created_time":"2016-11-20T09:53:50+0000","from":{"name":"Ashraf Kaabi","id":"10155206502385921"},"message":"انا كنت بدعمك اول ما نزلت اللعبة و حتي بلغتك بافكار و مشاكل صغيرة.\nبس اول ما حطيت الاعلانات كنت انا وصلت للمستوي السابع. بلغت عن مشكلة اعلان كل 30 ثانية و بصراحة بدون زعل الاعلانات كرهتني فيها و مسحتها حسيتها زيها زي كتير و العاب كلها سبام.\n\nانا مش عاوز انظر عليك في اي حاجة لان الفكرة عبقرية و تنفيذ جميل بس انتا بتقتل اللعبة بنفسك لانك بتدور علي ربح قبل الانتشار.\n\nعاوز تنتشر اللعبة زي ما هي بدون اعلانات مع تطوير مستمر هتنتشر جامد لما توصل لعدد يوزرز معينة هتلاقي فيه بزنس موديل راقي زي انك تعمل مراحل ك expansion pack بفلوس. او تعمل حتي مليون حاجة تنفع زي العاب coc و كلاش رويال اللي بتحقق ملايين يوميا بدون تضمين اي اعلانات.\n\nانا اسف للاطالة و اسف اني انتقدت كم نقطة بس انا فعلا معجب بلعبتك اوي و انتقادي ليك انك عاوزك تتطور و تكبر.","can_remove":false,"like_count":7,"user_likes":false,"id":"1299070520132653"},{"created_time":"2016-11-20T10:06:58+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"شكرا ليك يا أشرف على دعمك \nبالنسبة للإعلانات والتطوير انا طورت اللعبه حوالى 6 مرات بعد تنزيلها وحاليا اللعبه فيها 12 لغز \nوقللت مدة ظهور الاعلانات كمان  \nموضوع الربح قبل الانتشار \nأظن هى وجهات نظر شوية بتختلف من شخص للتانى \nلان الحقيقة انا كتير شوفت العاب نزلت باعلاناتها ونجحت نجاح كبير بسبب المساندة والدعم \nبالاضافة ان الاعلانات ممكن متظهرلكش لو قفلت النت أثناء تشغيل اللعبه \nويمكن لان محدش اشتكى من الاعلانات من الاساس فده مخلنيش افكر امسحها حاليا \nغير ان احيانا فى ظروف بتجبرك تحط اعلان ومتعملش مثلا App - in purchase  \nبس هى المشكلة الحقيقية اللى قابلتها وناس كتير قالولى عليها ان اللعبه بالعربى مش انجلش \nواقرب مثال على كده ان اول لعبه عملتها اسمها Ball Goal  مليانه اعلانات برضوا بس عملت لحد دلوقتى 30 الف داونلود  \nفاظن لو الناس قررت تدعم فعلا وتساند الموضوع هيتغير كتير","can_remove":false,"like_count":0,"user_likes":false,"id":"1299074920132213"},{"created_time":"2016-11-20T10:10:27+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"وبالعكس فى ناس كتير كلمونى وقالولى هندوس على الاعلانات عشان ندعمك \nفالاعلانات تقدر تقول هى دعم للمطور أكتر منها سبام او اى حاجه تانيه","can_remove":false,"like_count":0,"user_likes":false,"id":"1299076203465418"},{"created_time":"2016-11-20T10:10:39+0000","from":{"name":"Omar Ahmed","id":"1226032454184188"},"message":"الالعاب دلوقتي معتمدة بشكل جزري على ال Artistic view ...اللي بيشوف اللعبة مش هيفهم انت طلع عينك ازاي في البرمجة بتاعتها...هو كل همه الشكل النهاءي.\nفعلشان كده نصيحتى يا تدور على حد يشتغل معاك ويكون متخصص 3D يا تعلم نفسك بنفسك ال3D علشان تقتدر تطلع output الي حد ما مقبول للعين مش للذهن","can_remove":false,"like_count":6,"user_likes":false,"id":"1299076270132078"},{"created_time":"2016-11-20T10:19:37+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"انا عارف فعلا الموضوع ده ان الشكل النهائى والديزاين اللى قايمه عليه اللعبه اكيد بيصنع الفارق \nبس ده لو اللعبه كبيرة  او فيها حركة كتير \nلكن انا لعبتى 2D  وهى لعبه Puzzle  وكمان مفهاش أى حركة هى لعبه معتمدة على الصوت أكتر من الصورة  وهى لعبه معتمدة على الفكرة نفسها أكتر من اى حاجه تانيه \nوتعبت فيها كتير عشان أحاول أخلى الديزاين بتاعها مش حلو أوى \nبس على الاقل مقبول وكويس مش وحش أوى سىء يعنى \n\nو اكيد طبعا انا بتعلم كل يوم حاجه جديدة فى مجال الديزاين عشان أحاول أعلى نفسى فى الجزئية ده","can_remove":false,"like_count":0,"user_likes":false,"id":"1299084986797873"},{"created_time":"2016-11-20T11:50:46+0000","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"انا حابب اكلمك فى جزئية تانية غير اللعبة نفسها، فكرة \"مافيش حد بيدعمنى\" و \"الناس هتدوس على الإعلانات علشان تدعمنى\" ، التفكير ده مش هيخليك تمشى لقدام وهتفضل شايف نفسك ضحية المجتمع اللى مابيقدرش مواهبك وتعبك، انا حابك تفكر بشكل براجماتى اكتر، فكر بالأرقام وحلل مشاكلك و الroot cause  وحلها، فكرة ان الناس لازم تقف جنبى علشان انجح ده ماينفعش يا سيد مصطفى،  الناس لو مابتراجعش اللى بتعمل يبقى اكيد السبب مش انهم كارهينك او مش عاوزين يدعموك لأن انت مش مهم بالنسبة ليهم المهم ليهم ان المحتوى بتاعهم يكون على مستوى معين من الكواليتى واللى انت عامله مش معدى للمستوى ده nothing personal فعليك تشوف اللى انت عامله ليه مش واصل للكواليتى اللى بتخلى الناس تعمله مراجعات وتحله، \nانا اتفرجت على السكرين شوتس بتاعة الجيم دلوقتى ، اول حاجة الأيقونة اللى محطوطة دى مش ايقونة ، كواليتى كل ال assets لازم تتحسن، الصور اللى مشدودة بالعرض دى زى السهم اللى تحت خالص ماينفعش تعملها scale كده لازم ت respect the image ratio .\nخللى همك انك تركز على انك تعلى مستواك اكتر من انك تجيب العيب على الناس اللى بتراجع الجيمز او المجتمع اللى مش بيدعمك.","can_remove":false,"like_count":64,"user_likes":false,"id":"1299132016793170"},{"created_time":"2016-11-20T12:09:10+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"ومين قال ان فى حاجه personal  ! \nانا قولت \nوللأسف قالولوا حلو وبرافو عليك بس اللعبه محتاجه تطوير عشان ننزلها عندنا \nفانا قولت كده وعارف السبب \nبس فى نقطة صغيره انت مش واخد بالك منها يمكن \nوهى الدعم والتشجيع \nاللى بيراجع اللألعاب ده واحد فاهم صح ! \nاحتمال يكون بروجرامر او ديزاينر فى الاساس او ليه علاقة بالمجال عموما وبالتالى  هو واحد فاهم كويس  اوى المجال وعارف ان المجال فى مصر لسه فى بداياته وكل واحد بيكافح وبيحاول عشان يوصل لحاجه \nفلما تكون فاهم المجال كويس وتحلل اللعبه اللى قدامك وتلاقى فعلا ان متعوب فيها ووراها هدف وان صناعة الألعاب فى بلدك محتاجه تطوير وان لسه فى بدايتها يمكن بتشجيعك \nانا ممكن بعد 3 او 4 شهور اكون احسن بمراحل من دلوقتى \nلكن تخيل لو واحد عمل لعبه احسن منى بس محدش دعمه ولا شيرله ولا ساعده فى أى شىء \nأبسط شىء اول ما هيجيله شغل فى شركة هيسيب المجال ده تماما ومش هيستمر فيه والموهبة هتروح \nانا الحمد لله بقالى 3 سنين فى المجال حتى الان ومش مستنى دعم من حد لان هدفى فى الاساس بناء ستوديو للألعاب واتخطيت خطوات كبيرة حتى الان \nفبدعم من حد او من غير دعم انا هنجح بمشيئة الله تعالى فيوم من الايام \nلكن انا بتكلم بالنيابة عن ناس كتير ممكن يكونوا عملوا احسن منى لكن محدش وقف قدامهم واصابهم الاحباط لام ألعابهم اتحطت فى الارشيف \nلما حد فينا بيخترع شىء ويروح يقدمه للحكومه بيرموا اختراعه فى الدرج وبيقولوله برافو يا حبيبى ومحدش بيسمع عنه \nاحنا الشباب لازم نغير المفهوم ده ونقف مع بعض \nمش هينفع نستمر كده على طول \nوللعلم ده سبب كافى ورئيسى لعدم وجود محتوى عربى قوى على النت \nلاننا مش بندعم بعض :)","can_remove":false,"like_count":0,"user_likes":false,"id":"1299150146791357"},{"created_time":"2016-11-20T12:20:34+0000","from":{"name":"Hassan Aly Selim","id":"10155071713202292"},"message":"I agree with what Emad is saying.\nThink of it this way, game development is ridiculously easy these days (thanks to free engines like Unity and Unreal), so many people make a lot of games (there are a lot of Egyptian Game Devs BTW, including my own Startup) so the market is very saturated, this makes it very very hard to get noticed and game reviewers get tons of emails from people asking them to test their game, and they have to pick!\nAnd regarding Egyptian Game Reviewers ... these people mostly just want to play high-production games like GTA and CoD, very few of them appreciate the beauty of small indie games, so convincing them to play a game that doesn't have fancy explosion effects is a very hard thing to do.\nSo basically, you shouldn't expect to be noticed, because this is the norm, my team makes games just because we like making games, and while we hope one day it can be self-sustaining, we know that there is a very small chance for that to really happen.\n(which is why we started focusing on something different, we're trying to make a VR Arcade ... but that's off-topic)","can_remove":false,"like_count":8,"user_likes":false,"id":"1299159496790422"},{"created_time":"2016-11-20T12:26:22+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"Hassan Aly Selim @Excuse ! if all people think that way , we will never achieve our goals \nwhen we create a game , we have to try all ways to achieve people and to get noticed , not to surrender to the environment and say no way to get noticed , SORRY!","can_remove":false,"like_count":0,"message_tags":[{"id":"10155071713202292","length":16,"name":"Hassan Aly Selim","offset":0,"type":"user"}],"user_likes":false,"id":"1299162376790134"},{"created_time":"2016-11-20T12:39:54+0000","from":{"name":"Meligy","id":"10154884040385170"},"message":"You lost me at \"مفيش حد مصرى للأسف من اللى بيراجعوا الألعاب ساندنى بأى شىء \"\nI didn't bother read more...","can_remove":false,"like_count":23,"user_likes":false,"id":"1299170223456016"},{"created_time":"2016-11-20T12:41:54+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"يمكن لأنك اتعودت ان مفيش حد مصرى بيساعد :) Mohamed Meligy \nفده بقا شىء طبيعى بالنسبة لك","can_remove":false,"like_count":0,"message_tags":[{"id":"10154884040385170","length":14,"name":"Meligy","offset":43,"type":"user"}],"user_likes":false,"id":"1299171160122589"},{"created_time":"2016-11-20T13:23:21+0000","from":{"name":"Waled Saleh","id":"10158302198825357"},"message":"ليه ياعم ملقتشى حد يساعدك ! :( \nما احنا قاعدين اهو نساعدك انت وغيرك :] \nانا و Ahmed Saleh قول انت عاوز اي ونساعدك\nخبرات فوق 4 سنين","can_remove":false,"like_count":0,"message_tags":[{"id":"10158326787715574","length":11,"name":"Ahmed Saleh","offset":78,"type":"user"}],"user_likes":false,"id":"1299193076787064"},{"created_time":"2016-11-20T13:39:44+0000","from":{"name":"Amera Wageeh","id":"1506043442763016"},"message":"بص انا مش هناقش حضرتك فيه حد بيدعم ولا مفيش ونوع الدعم وجدوى دا من عدمه\nانا هتكلم ان حضرتك دلوقتى عندك منتج ما بغض النظر عن نوعه\n لو مستنى دعم الناس عمرك ماهتتقدم اشتغل على نفسك وعلى منتجك\n ولو انت شايف انه مفيش دعم دا سبب ادعى انك تشتغل على نفسك اكتر واكتر وتسيب منتجك وشغلك هو اللى يتكلم عنك ويدعم نفسه بنفسه بس كدا :)","can_remove":false,"like_count":3,"user_likes":false,"id":"1299205106785861"},{"created_time":"2016-11-20T13:43:08+0000","from":{"name":"Hossam Rehan","id":"10155550218990616"},"message":"حبببي ممكن تراجع كتاب التجربة الخيالية عن أول لعبة مصرية 3D أبوحديد أو بوحة وتعرف إنك school boy جنبهم في وقت لا كان في إمكانيات ولا أي نيلة ، ومع ذلك التجربة أثرت كل مشارك فيها بشكل شخصي كبير على المستوى المهني ، ومعلش في الكلمة أنا شفت برومو اللعبة بتاعتك صدقني لو بلعبها هعملها uninstall دا غير طريقتك الفجة في طرح فكرتك ، أنا لو في قرارة نفسي هساعدك بعد طريقتك الهجومية على ناس مجهولة صدقني هوقف دعم ، عيد نظر في أفكارك أنت مش هنا في سايبر أيمن إبن أحلام كراوية عشان تحسس الناس إنك فلتة العصر ، اعرف الجروب اللي أنت داخل فيه شمال مين الأول وبعدين احكي براحتك ، دي نصيحة لو مش مهمة بالنسبة لك يبقى احفظ الكلمة دي(  ابقى قابلني)","can_remove":false,"like_count":6,"user_likes":false,"id":"1299208156785556"},{"created_time":"2016-11-20T14:00:12+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"Waled Saleh شكرا ليك \nAmera Wageeh انا مش مستنى دعم من حد انا مستغرب بس اننا مش بندعم بعض \nلكن وجود دعم او لأ ده مش هيوقفنى نهائى","can_remove":false,"like_count":0,"message_tags":[{"id":"10158302198825357","length":11,"name":"Waled Saleh","offset":0,"type":"user"},{"id":"1506043442763016","length":12,"name":"Amera Wageeh","offset":22,"type":"user"}],"user_likes":false,"id":"1299217510117954"},{"created_time":"2016-11-20T14:47:33+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"أحب أوضحلكوا المشلكة بشكل أكبر \nعشان يكون الموضوع مش محصور فييا كواحد بيكافح يوصل للى عايزة \nفريق ilogic  \nاللى فاز فى سنة 2014 بالمركز التالت فى مسابقة Imagine Cup  أكبر مسابقة للأبلكيشنز فى العالم تحت رعاية شركة مايكروسوفت \nفاز فى قسم الألعاب عن لعبة عملها إسمها Pubby in pubble \nاللعبه نزلت على الاندرويد بقالها سنتين \nكام داونلود ؟ :) \n1000\nتخيلوا لما شباب مصرى زى الفل يتعب كل ده ويكسب مركز تالت فى مسابقة عالمية ولعبتهم متجبش غير ألف وشوية داونلود ؟ \nانتوا عارفين ده معناه ايه ؟ ولا لأ ؟ \nيعنى لعبه احسن من لعبى مليون مرة وكسبوا بيها جايزة كبيرة جدا وبرضوا محدش دعمهم فهمتوا فكرتى ولا لسه ؟ :) \nEmad Elsaid Hassan Aly Selim Mariam Maarouf Amera Wageeh Waled Saleh\nيارب يكون قصدى بها واضح للجميع","can_remove":false,"like_count":0,"message_tags":[{"id":"10154379038212957","length":11,"name":"Emad Elsaid","offset":601,"type":"user"},{"id":"10155071713202292","length":16,"name":"Hassan Aly Selim","offset":613,"type":"user"},{"id":"10154848350731638","length":14,"name":"Mariam Maarouf","offset":630,"type":"user"},{"id":"1506043442763016","length":12,"name":"Amera Wageeh","offset":645,"type":"user"},{"id":"10158302198825357","length":11,"name":"Waled Saleh","offset":658,"type":"user"}],"user_likes":false,"id":"1299246046781767"},{"created_time":"2016-11-20T14:56:59+0000","from":{"name":"Mustafa Dagher","id":"10212394020589663"},"message":"يابني بال mentality دي صدقني ما هتطور لحد بنها حتى، مش توصل للعالم!\nبطل شغل \"انت مبقتش مهتم بيا ده\" و \"مبقتش فارق في حياتكم\".. \nمن نفس النبرة بتاعة كلامك هرد \"الإهتمام مبيتشحتش\"\nانا نزلت اللعبة مطيقتهاش يومين، محتاجة تطوير و شغل كتير، انت عارف كدة كويس و عارف انك محتاج تتعلم و تحسنها، ال users و ال reviews مش بالشحاتة، روح ذاكر و اجتهد و اعمل حاجة نضيفة فعلا الناس هتقف وراك... و المجال مش ميت و بيبتدي في مصر ولا حاجة، في ناس يعتبروا مبتدأين سابقينك بسنين ضوئية هنا في مصر من اول الديزاين لحد كل حاجة..\nانت عمال تدلل على الفكرة الكويسة.. و عملت حاجة عالسخان و بكروتة و عايزها تكسب فلوس بسرعة، و بتكلم الناس بمنطق \"حرام عليكم معندكوش اخوات ديفيلوبرز؟\"\nحاجة زي اللي انت عاملها دي اعتبرها بتتعلم فيها، \nمش اروح انا اعمل سيستم في مشروع تخرج يكون بالنسبة ليا كطالب مثلا عبقري ، امشي عالشركات اشحت عليه و اقولهم اشتروه مني عشان انا شاطر و طيب و عشان تدعموني...\n\nلو عندي حاجة شايفها كويسة و هب اول shot ليا و عايز فعلا اخد دعم اروح اديها ببلاش مثلا لمؤسسات خيرية معندهمش زيها و هكذا بحيث يستخدموها و يقولولي ريفيوز و يطلعولي bugs احلها و افهم السوق و الشغل من خلالهم... مش اول ما اشطح احط اعلانات و انزل حاجتي بأسوأ quality و بعدين اشحت بيها من منطلق الدعم!!!","can_remove":false,"like_count":3,"user_likes":false,"id":"1299251640114541"},{"created_time":"2016-11-20T15:03:28+0000","from":{"name":"Ahmed Saleh","id":"10158326787715574"},"message":"مفيش منتور في مصر !","can_remove":false,"like_count":0,"user_likes":false,"id":"1299255483447490"},{"created_time":"2016-11-20T15:04:08+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"اتفضل قول الايجابيات اللى شوفتها والسلبيات \nمعنديش اى مشكلة انا بحب أسمع من كل الناس  :) Mohamed Atef","can_remove":false,"like_count":1,"user_likes":false,"id":"1299255763447462"},{"created_time":"2016-11-20T15:39:14+0000","from":{"name":"Antoun P. Gorgy","id":"10158298358505487"},"message":"انا معترض علي كلام كتير من اللي انت كتبه وعلي طريقة التفكير بس الناس بالفعل قالت كل اللي ممكن يتقال. اما بخصوص اللعبة، كنقد موضوعي هو الآتي:\n1. Images and resources used are of a very low quality, they are pixelated. \n2. The language and the user journey and experience is not attractive. \n3. The UI is not fully displayed in high end phones. \n4. You are using unity, while the app doesn't use any 3d or things like that, so why use unity then. \n5. The ads are many and annoying, most of professional games use less ads, so at least you should start with less or no ads at all! \n6. The game level is not professional and reviewers are not providing a charity services to review free a game that is not up to their level. This will harm their reputation!","can_remove":false,"like_count":5,"user_likes":false,"id":"1299279363445102"},{"created_time":"2016-11-20T16:15:48+0000","from":{"name":"Mohammed Fathy","id":"10154999699563956"},"message":"انا قرأت تقريبا معظم تعليقاتك و مكنتش فاهم طلبك للدعم في كل تعليق ووضح ليا اكتر بعد قرأة تعليقك علي استاذ اشرف فوق و مقارنتك لالعاب فيها اعلانات لكن انا حابب اقولك كام نقطه لان انا بشتغل نفس شغلتك و مفكرتش انزل بوست زي ده ولا مره:\n١ - لازم تعمل حاجه الناس محتاجاها يعني لو هتعمل لعبه يبقي لازم تكون لعبه ذات فكر جديد او ميزه جديده ولازم تكون جودتها عاليا جدا ، اوعي ترفع لعبه او تطبيق و جودتها سيئة ،، راجع تعليق Antoun عليك \n٢- لما تطلب دعم الناس سواء عشان ينزلوا اللعبه او حتي يستثمروا فيها ،، لازم تبقي الصيغه افضل من كده و افضل طريقه هوا انك يبقي عندك  شبكة كبيره جدا من الاصدقاء او الجروبات اللي مهتمه بده  عشان الناس مش بتعمل حاجه ببلاش .. لكن تقدر تطلب منهم تقييم للعبه بدون ما تطلب انهم ينزلوها  عشان تقدر تحل مشاكلها  وغير كده فيه مواقع كتير ممكن تفيدك في موضوع التقييم ده قبل الرفع بردو \n٣- متقارنش نفسك بحد حاول تعمل حاجه انت فعلا شايف انها ممكن  تعجب الناس ولو منجحتش اشتغل علي حاجه تانيه  ،،، لعبة انجري بيرد طلعت بعد ٥٠ لعبة فاشلة وممكن تراجع ده في المقالالت عن اللعبه .\n٤- لازم تتعلم كتير والموضوع مالوش علاقه بسنك في المجال ده في اصغر مني ومنك و اتعلم صح وعمل تطبيق واحد وبيدخل اكتر من ٥٠٠٠ دولار من التظبيق ده بس \n٤- قبل ما تقرر انك تشتغل في الالعاب كان لازم تدرس السوق الاول قبل الفكره.. السوق العربي متعود علي جودة الالعاب العاليه وعشان تقدر تدخل السوق ده فانت لازم تتعلم كويس الاول وبعد كده تدرس السوق كويس وايه شكل اللعبة اللي ممكن تجذب انتباه معظم العرب ده غير الوقت الكبير اللي انت محتاج تحطه في حاجه زي دي \n٥- شوف مصمم كويس سواء للجرافيكس او الصوتيات يشاركك او ادفع له مبلغ مقابل انه يعملك حاجه محترمه وبجوده عاليه تخلص بيها شغلك ، متطلعش حاجه نص كم وتقول انا لسه في الاول ومحتاج دعمكم ،، مفيش حد هيبص لشغلك لو هوا نص كم ، طلع لغز واحد بس بدال ١٠ بس تكون الجوده عاليه وابسط مثال علي ده اللعبه اللي قلبت الموازين فلابي بيرد في اول ٢٠١٥","can_remove":false,"like_count":5,"user_likes":false,"id":"1299356036770768"},{"created_time":"2016-11-20T16:22:29+0000","from":{"name":"Mahmoud Ashraf","id":"1345593358855570"},"message":"أنا قريت تقريبا كل كلمة فى البوست بالكومنتس والخلاصة \n\"أنت محتاج كورس marketing صغير قوي عشان تعرف ان اللي بتعمله دا غلط \"\nحتى لو سيشن صغيرة عند حد كويس","can_remove":false,"like_count":3,"user_likes":false,"id":"1299359876770384"},{"created_time":"2016-11-20T16:26:01+0000","from":{"name":"Hossam Rehan","id":"10155550218990616"},"message":"الرجالة كلها كفت ووفت بصراحة لكن لازلت للأسف تتبع أسلوبك الهجومي وبتحاول ترد على نقط المفترض إنها اتكتبت عشان تساعدك وأنت داخل شمال كأننا في مباراة ، هضربلك مثال على إنك لو فضلت كدا من غير ماتتقبل نصح الناس هتفشل ، كان في لعبة كل الناس عارفاها دلوقت وكانت مكسرة الدنيا على الرغم من عدم جودتها الفنية فضلاً عن فكرتها (العبيطة جداً) إسمها Flappy Bird اللعبة دي عملها واحد هاوي من فيتنام وكانت بتدر عليه دخل يومي فقط من الإعلانات حوالي 50 ألف دولار أيوة الرقم صح ، تخيل واحد على هامش الجغرافيا في العالم وبيربح المبلغ دا ، قوم بقى الولد يعمل ايه ، طبعاً كلنا عرفنا اللعبة من الخطوة دي ، لغى لعبته من على الاستور وزعم إن دا بسبب الإدمان عليها وإنها كخ ، تعرف وصلت اللعبة لفين بعد الحركة دي ؟؟ ملايين الملايين ، فدا جانب صغير جداً انت مستهتر بيه اسمه التسويق ، ومش هقولك جرافك ولا حركات بقولك لعبة بتفكرنا بألعاب الـ (8bits) بتاعة زمان ، فلا الفكرة ولا الشغل هو اللي هيظهرك ، التسويق الصايع باختصار.","can_remove":false,"like_count":2,"user_likes":false,"id":"1299363300103375"},{"created_time":"2016-11-20T16:35:53+0000","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"Mahmoud Ashraf الغلط انى أقول الصح واللى للأسف بيحصل !","can_remove":false,"like_count":0,"message_tags":[{"id":"1345593358855570","length":14,"name":"Mahmoud Ashraf","offset":0,"type":"user"}],"user_likes":false,"id":"1299375713435467"},{"created_time":"2016-11-20T17:27:20+0000","from":{"name":"Maher Samir","id":"1350030681723646"},"message":"والله انا بعد ما قرات الكومنتات كلها ونزلت اللعبه مش شايف ان الموضوع غير الدعم عشان الاعلانات.. يعني انت مغرق اللعبه اعلانات وشايف ان المساعده ان الناس تدعمك عشان اي سبب بس انا مش شايف غير الاعلانات... معلش يعني الي هايعمل ريفيو عن اللعبه ده مش هايفرق حاجه عن اي واحد هاينصحك هنا الا انه بيعمل الريفيو في فيديو قدام الناس... دا كمان الي هاينصحك هنا هاينصحك علي المستوي التقني اكتر ومن مشاهدتي للعبه دا الي انت محتاجه مش محتاج واحد يوتيوبر.. انت اصلا طلعت بروداكشن بسرعه ومستعجل ع الريفنيو... حتي لو انت شايف انك اخدت وقت طويل فا بردو انت استعجلت.. كنت عاوز تاخد راي الناس ولازم تطلع ع الاستور اعمل تست فلايت وابعت للناس ع الاقل تبعتلهم من غير اعلانات عشان محدش يتقفل م اللعبه بتاعتك... كذا حد حاول يوضحلك انك متنزلش ب اعلانات م الاول وانت كان ليك راي تاني وخلاص... الناس هنا كل واحد كلمك علي حاجه معينه وكل واحد حسب مجاله وانت واخد الموضوع من ناحيه تانيه خالص... باشا مشكلتلك مش في اللعبه او اعلاناتك او المجتمع الي منفضلك او مستواك او وقتك الكتير الي بيضيع علي حاجه الكوالتي بتاعتها مش قد كدة لمجرد انها تنزل ع الاستور... مشكلتك ان محدش مقتنع بحاجه انت بتعملها او بتقولها.. ومش محتاج اقولك الموضوع مش شخصي","can_remove":false,"like_count":3,"user_likes":false,"id":"1299412413431797"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEk1T1RBM01EVXlNREV6TWpZAMU16b3hORGM1TmpNMU5qTXgZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEk1T1RReE1qUXhNelF6TVRjNU56b3hORGM1TmpZAeU9EUXcZD"},"next":"https://graph.facebook.com/v2.2/172338516139198_1299063983466640/comments?access_token=EAAEFxxeGv2oBALll8soOElB2cX7dFL0l0vgAi6oICOanjJYU1kOAKh0Lqcu5UyA7nIx0dgge89V567pmclXuGCsRw9lWX8BKEKyxKSa7LZBvla48KEPsZB4m7KKivz2epuuJ7F20w0bJL6tTCeLu9TBax3SFgZD&limit=25&after=WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEk1T1RReE1qUXhNelF6TVRjNU56b3hORGM1TmpZAeU9EUXcZD"}}}