{"id":"172338516139198_437584929614554","from":{"id":"683805169","name":"Mohamed El Sayed"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"Using chrome's own states method (About Memory tab) and with the same number/kind of tabs opened, chrome is eating 1.13 GB of RAM, and Firefox takes only 216 MB.\nI know, I've many extensions on chrome, but the sum of them all is around 320 MBs.","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/437584929614554"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/437584929614554"}],"privacy":{"value":""},"type":"status","created_time":"2012-07-13T13:26:16+0000","updated_time":"2012-07-15T12:00:34+0000","comments":{"data":[{"id":"437588069614240","from":{"id":"1468673267","name":"Sameh Ammar"},"message":"كنت مدمن كروم   وكنت بحس انه الفيرفوكس تقيل ولكن ف الاصدارت الاخيرة للكروم  تقريبا  بيدمر الدنيا رجعت للفيرفوكس","can_remove":true,"created_time":"2012-07-13T13:37:31+0000","like_count":0,"user_likes":false},{"id":"438213499551697","from":{"id":"1099451191","name":"Beshoy Shehata"},"message":"I have 73 addons on Firefox, average opened tabs range from 25 to 40 (sometimes more than that, sometimes less), and it takes only about 1 giga RAM. after Installing MemoryFox, Firefox only consume RAM that ranges from 100 MB to 500 MB :D","can_remove":true,"created_time":"2012-07-15T02:40:16+0000","like_count":1,"user_likes":false},{"id":"438213586218355","from":{"id":"1099451191","name":"Beshoy Shehata"},"message":"I love Google, but really Chrome is CRAP, or it is only me not liking it. Just my 2 cents :)","can_remove":true,"created_time":"2012-07-15T02:40:59+0000","like_count":1,"user_likes":false},{"id":"438314976208216","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Just because the extensions show their memory in task manager can't get you 100% confidence they are irrelevant.\nThere could be a lot of things affecting this:\n- Side effects of loaded extensions in each of the pages\n- The obvious, amount of opened tabs\n- The less obvious, like amount of closed tabs\n- and also amount of history, bookmarks, and even cookies\n- Not to mention size of session-specific history (since browser we opened)\n- Does the memory include HTML5 local storage that maube some sites support in certain browser implementation but not another?\n- Do the sites include Flash? Is it sure to perform equally in both browsers?\n\nTo have a fair comparison, you need to create a new user profile, and perform the same exact steps (including closing tabs or going from one page to another in same tab), without extensions or themes or anything.","can_remove":true,"created_time":"2012-07-15T10:34:25+0000","like_count":0,"user_likes":false},{"id":"438318369541210","from":{"id":"683805169","name":"Mohamed El Sayed"},"message":"Thank you Mohamed Meligy for this nice comment, I've already did a clean comparison between FF and chrome inside a fresh Windows 7 VM , both browsers with new installation with NO EXTENSTIONS at all,  and chrome still eats more ram than FF, see the results below:\n\nnew window (no tabs, just after a system restart): \nFF==> 102MB,\nChrome==> 168MB\n\nopen 10 tabs: \nFF==> 486MB\nChrome==> 752MB\n\n5 minutes after closing the 10 tabs,\nFF==> 131MB\nchrome==> 196MB\n\nit's now clear enough to say that Chrome team has made a BIG mistake in recent versions that affects memory consumption, but I have no clue about what specifically is causing this.\n\nI love Chrome, but I'm now forced to get back to FF.","message_tags":[{"id":"544815169","name":"Mohamed Meligy","type":"user","offset":10,"length":14}],"can_remove":true,"created_time":"2012-07-15T10:49:41+0000","like_count":0,"user_likes":false},{"id":"438319472874433","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"I wouldn't worry about ~ 100 MB RAM difference, not in recent time machines. The other difference you refer to (the jump after 5 minutes) looks like a V8 JavaScript VM thing to me. Looks like a lot of JavaScript objects or so that were later garbage collected. Maybe they have an issue though (which to me is sort-of acceptable). Might be worth bringing it to them.","can_remove":true,"created_time":"2012-07-15T10:53:37+0000","like_count":0,"user_likes":false},{"id":"438319712874409","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Firefox 12 and 13 have been doing great stuff recently as well anyway, but you know, Chrome is the new IE5/6. A lot of sites are optimized for pre-approved Chrome standard \"proposals\".","can_remove":true,"created_time":"2012-07-15T10:55:21+0000","like_count":0,"user_likes":false},{"id":"438323472874033","from":{"id":"683805169","name":"Mohamed El Sayed"},"message":"I agree with you, except for the point of 100 MB.\nas you can see, it's not 100 MB, it's around 330mb+ with 10 tabs.\nand as you know, we (tech guys) surf usually with around 15 ~ 50 tabs opened, so expect a difference in GB scale, and this can't be acceptable from just a \"Browser\".","can_remove":true,"created_time":"2012-07-15T11:13:12+0000","like_count":0,"user_likes":false},{"id":"438324276207286","from":{"id":"683805169","name":"Mohamed El Sayed"},"message":"as I said, I love Chrome, but I can't live with this issue no more.\nmy machine has only 4 GB (Home & work), so this affects the overall performance of my machine too much.\nmoving to Firefox, I now have enough to play with, taking into consideration that I've only 4 GB to play with.\nbut when I was using Chrome, I convinced myself that I've only 3 GB or so, cause Chrome:The-king was reserving the rest for his majesty :)","can_remove":true,"created_time":"2012-07-15T11:16:30+0000","like_count":0,"user_likes":false},{"id":"438324409540606","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"I was more talking about the after-5-min result. I usually run my machine with a client VM taking up to 6 GB of my total 10 GB RAM, and have Chrome open all the time on the host machine with many tabs. Rarely a problem.\nAre you using the final release channels of both or some pre-final equivalents?","can_remove":true,"created_time":"2012-07-15T11:17:07+0000","like_count":0,"user_likes":false},{"id":"438333719539675","from":{"id":"683805169","name":"Mohamed El Sayed"},"message":"yes.","can_remove":true,"created_time":"2012-07-15T12:00:34+0000","like_count":0,"user_likes":false}],"paging":{"cursors":{"after":"WTI5dGJXVnVkRjlqZFhKemIzSTZORE00TXpNek56RTVOVE01TmpjMU9qRXpOREl6TlRNMk16UTZMVEU9","before":"WTI5dGJXVnVkRjlqZFhKemIzSTZORE0zTlRnNE1EWTVOakUwTWpRd09qRXpOREl4T0RZMk5URTZMVEU9"}}}}