{"id":"172338516139198_1373567376016300","from":{"name":"Mohamed Sayed","id":"752810281554018"},"story":"Mohamed Sayed shared Networks' Way's photo to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"752810281554018","name":"Mohamed Sayed","type":"user","offset":0,"length":13}],"21":[{"id":"855562407841172","name":"Networks' Way","type":"page","offset":21,"length":13}],"37":[{"id":"1384699221594152","name":"","offset":37,"length":5}],"57":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":57,"length":14}]},"picture":"https://fb-s-d-a.akamaihd.net/h-ak-xlf1/v/t1.0-0/s130x130/16298753_1384699221594152_1433413812673957693_n.jpg?oh=37d4108a6d8ad74c4bbfe49b24e336fe&oe=59268F69&__gda__=1499533730_16fae0776d033d6439be9689c3f908e3","link":"https://www.facebook.com/ITNetworksWay/photos/a.888486487882097.1073741828.855562407841172/1384699221594152/?type=3","name":"Networks' Way","description":"كنا في أخر بوست اتكلمنا عن الأشياء الجديدة اللي بيقدمها #سيرفر_2016\nالنهاردة هنبدأ نتكلم عن اول ميزة من الميزات الجديدة اللي بيقدمها واللي هتكون ان شاء الله مش اخر ميزة نتكلم عنها..\nالنهاردة هنتكلم عن الـ #Nano_Server\n\n#النانو_سيرفر هو ضمن احد خيارات تثبيت #الويندوز سيرفر 2016 وبيتم ادارته عن بعد remotely administered server\nودة لأنه مش بيقدم واجهة المستخدم الرسومية #GUI\nكمان مش بيدعم تسجيل الدخول محلياً No local logon capability\nودة خلاه مناسب جداً كنظام تشغيل للسحابة الخاصة ومراكز المعلومات private clouds and datacenters.\nبيشبه بشكل كبير ويندوز سيرفر وهي في الوضع #Core_mode بس مساحته أقل وبيدعم فقط التطبيقات 64 بت وعشان كدة هو محتاج لمساحة أصغر علي الديسك وبيتثبت أسرع وبيحتاج لتحديثات اقل وعدد مرات restart اقل ولما بيـrestart بيشتغل اسرع.\n\nخيار نانو سيرفر متاح فقط مع اصدارات ويندوز سيرفر 2016 Standard and Datacenter\n\n#النانو_سيرفر هو الخيار الأمثل في الحالات التالية علي سبيل المثال ..\n- As a host for Hyper-V virtual machines.\n- As a storage host for Scale-Out File Server.\n- As a DNS server.\n- As a web server running Internet Information Services (IIS)*\n- As a host for applications that are developed using cloud application patterns and run in a container or virtual machine guest operating system.*\n\n* ميزات جديدة.\n\n#الأختلافات_الهامة التي يتميز بها وضع نانو سيرفر\n=======================\n- Nano Server is \"headless;\" there is no local logon capability or graphical user interface.\n- Nano Server cannot serve as an Active Directory domain controller.\n- Group Policy is not supported.\n- Nano Server cannot be configured to use a proxy server to access the internet.\n- NIC Teaming (specifically, load balancing and failover, or LBFO) is not supported.\n- System Center Configuration Manager and System Center Data Protection Manager are not supported.\n- Best Practices Analyzer (BPA) cmdlets and BPA integration with Server Manager are not supported.\n- Provide a new version of Windows PowerShell.\n\nللأسف الشديد فترة الدعم الخاصة بالنانو سيرفر اقل بكتير من فترات الدعم الخاصة بالـCore server او خيار التثبيت الكامل Desktop Experience installation option اللي ممكن تمتد لحد 5 سنين.\n\nانا هتوقف لحد هنا. \nبس مش معني كدة ان دة هيكون اخر كلامنا عن النانو سيرفر او اخر كلامنا عن الميزات الجديدة اللي بتقدمها السيرفر 2016.\n\nتابعونا علي صفحتنا https://www.facebook.com/ITNetworksWay/\nللمزيد من المعلومات حول موضوع الويندوز سيرفر 2016\n#أستفاد_وشير_عشان_غيرك_يستفاد\n#NetworksWay\n#Microsoft_Server_2016\n#MCSA_2016\n#MCSE_2016\n\n*المصدر: موقع مايكروسوفت technet مقالات","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1373567376016300"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1373567376016300"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"photo","object_id":"1384699221594152","created_time":"2017-01-31T14:20:36+0000","updated_time":"2017-01-31T14:20:36+0000","is_hidden":false,"is_expired":false}