{"id":"172338516139198_1415793175127053","from":{"name":"Hassan Aly Selim","id":"10155071713202292"},"message":"I want to get a sense of the frontend dev ecosystem here.\nI know that we have few frontend devs in Egypt (significantly less than the demand), but I want to know, of these devs how many are using Angular (1 or 2)? What about other SPA frameworks? Are the majority still stuck in jQuery world?\nOver the past year I've noticed more people asking about Angular and React, but still most of the answers are from the same few people (eg: Meligy and Alfy, you guys rock BTW :D). So I feel like a lot more people are learning SPA frameworks but still not enough have passed the beginner phase.\nWhat do you guys think?","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1415793175127053"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1415793175127053"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"status","created_time":"2017-03-09T23:26:01+0000","updated_time":"2017-03-11T15:34:43+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"1894957820747942","name":"Mohamed Adel"},{"id":"1285105998248677","name":"Ahmed Badawy"},{"id":"1630338916994429","name":"Mohamed Hafez"},{"id":"10210277573008432","name":"Eslam Hamouda"},{"id":"1305943819490269","name":"Ahmed Aziz"},{"id":"10155033719452629","name":"Mohammed ElSayed"},{"id":"10212318670431489","name":"Ahmed Adel Radwan"},{"id":"10155809008166808","name":"Ahmed Mahmoud Yosry"}],"paging":{"cursors":{"before":"MTg5NDk1NzgyMDc0Nzk0MgZDZD","after":"MTAxNTU4MDkwMDgxNjY4MDgZD"}}},"comments":{"data":[{"created_time":"2017-03-10T02:27:28+0000","from":{"name":"Ahmed Badawy","id":"1285105998248677"},"message":"Totally agree. As for the level of developers doesn't improve because The work environment doesn't encourage using these frameworks because not every one on your team can work with them. \nAlso the frontend world can be very frustrating for begginers because of its fast growing & improvements. \n its extremely hard to keep up with it...","can_remove":false,"like_count":1,"user_likes":false,"id":"1415977625108608"},{"created_time":"2017-03-10T05:04:28+0000","from":{"name":"Eslam Hamouda","id":"10210277573008432"},"message":"عندك حق، انا اغلب اصحابي اللي شغالين فرونت اند بس اتجهوا ل AngularJS عشان يبقوا Cool وجامدين وكلام من ده لكن للأسف مستواهم لم يتعدى ال basic tutorials اللي منتشرة في كل حته، حتى وقت الزنقة بيقوم ضايف JQuery ويتشقلب عشان يحل مشاكله بيها لأنه ماعندوش دراية كافية بكل الإمكانيات المتاحة اللي معاه من خلال الفريم ورك اللي شغال عليها، ودي حقيقية ان اغلب الناس مبتدأين بس دول معذورين لأنهم ما اتحطوش في بروجكت محتاج حاجات كتير متقدمة، او هو شاف كام مثال علي كام كورس واستسهل الدنيا و اتغر باللي عارفه فوقف على كده وبيحاول يقيف كل حاجه على قد معلوماته، وده لاحظته كتير لما Component API نزلت مؤخراً، اللي فاهم كويس كان فرحان جداً وقلب شغله عليها واللي مش فاهم كان بالنسبه له إصدار عادي زي اللي قبله. بالنسبة ل Angular 2 ما شوفتش ناس كتير واللي بسألهم من بتوع AngularJS مش ناوي تنقل ل 2؟ اغلب ردهم هو انا لسه خلصت 1 الاول عشان انقل ل 2 !!! \nبالنسبة ل React اغلب اللي كنت بتكلم معاهم فيها حابينها جداً ونفسهم يدوسوا فيها اكتر لكن ما قابلتش حد قالي انا عملت كذا ب React .\nانا طبعاً بتكلم علي خبرة شخصية في المحيط بتاعي، بس اعتقد ان ده امر شائع مع ناس كتير. \nنقطة اخيرة؛ الفرونت اند حالياً فعلاً جحيم على الناس الجديدة بسبب التطوير الهائل اللي حصل في الفترة الأخيرة، فعشان كده اللي بيبدأ وياخد السلم من اوله بياخد وقت شوية علي ما يوصل ويدرك موضوع ال SPA ده كويس، واغلب الناس دي هما اللي لسه متخرجين ودول هما اللي في السوق او بيدوروا علي شغل، الكويسين اللي عارفين أغلبهم أكيد سافر بره مصر.","can_remove":false,"like_count":8,"user_likes":false,"id":"1416099025096468"},{"created_time":"2017-03-10T16:30:19+0000","from":{"name":"أحمد محمود محمد عبدالوهاب","id":"10154319137941186"},"message":"It's really difficult for juniors to progress in different technology without the existence of a senior who can guide them through. Also the type of projects that can be done using angular  or SPAs frameworks in general are not that common in our company for example (until recently). Hence, the need to learn it or to practice it is not really there,\nPersonally, I don't believe that there's a good & mature SPA framework out there yet compared to the backend. Specially when you have things like rxjs or typescript around heavily used <_<","can_remove":false,"like_count":2,"user_likes":false,"id":"1416634505042920"},{"created_time":"2017-03-10T17:58:38+0000","from":{"name":"Ahmed Mansour","id":"10154384274361659"},"message":"متفق معاك ومش متفق معاك .... متفق معاك لان تقريبا اغلب الناس اللي حواليا مش بيفكر يعرف angular  واللي بيعرف مش ناوي ينقل ل angular2 او مكسل ... انا بتكلم عن الأقل التيم اللي انا فيه مثلا واللي المشروع بتاعنا داخل فيه angular ... مش متفق معاك ف جزءية ان لازم اللي اشتغل يالاتنين او مهتم يالاتنين لازم يكون بيسأل هنا ... جايز يكون بيعرف search كويس ... او موصلش لدرجة انه وقف في حاجة عشان يسال عشانها","can_remove":false,"like_count":2,"user_likes":false,"id":"1416700731702964"},{"created_time":"2017-03-10T20:01:48+0000","from":{"name":"Momen Al Zalabany","id":"10158646474145144"},"message":"انا مشتغلتش في شركات بؤمجه فاخبرتي تجربه شخصيه. بدء بangular \nThen moved to angular2, frustrated by bootlenecks of angular and a littel bit mad that all my angular1 projects now need 80% rewrite to be angular2 i moved to react world.. After 1 year of failed trials i finals launched my first production ready webapp and reatnative apps..\nThe key to success and my turning point i think was the day i decided to remove jquery from my project.. And learn polymer1 it was amazing i started learning vanilla js and digest the concepts of components. So went i turned back to my production apps which was all in angular1 i could eaisly migrate em to react and improved alot.","can_remove":false,"like_count":1,"user_likes":false,"id":"1416776931695344"},{"created_time":"2017-03-11T10:14:59+0000","from":{"name":"Ahmed Eid","id":"608966259314618"},"message":"I'm using AngularJS in my full time job  ,,, we are not even thinking of migrating our app to Angular2 :D :D, we already did good effort(I mean time :D) in migrating from ASP.NET MVC and AngularJS mixture to a full SPA\nBut for me I'm using Angular2 in another side project","can_remove":false,"like_count":2,"user_likes":false,"id":"1417371431635894"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVFF4TlRrM056WXlOVEV3T0RZAd09Eb3hORGc1TVRFeU9EUTUZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVFF4TnpNM01UUXpNVFl6TlRnNU5Eb3hORGc1TWpJM016QXcZD"}}}}