{"id":"172338516139198_728910657148645","from":{"id":"652024918","name":"Amr Eldib"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"I need some advice from Virtualization experts:\n\nI did my fair share of research and can't find some solid solution that matches what I'm looking for.\n\nHere's some background: \n- We have a test center where every analyst works on resolving number of test cases.\n- We work with a big number of software stacks. A stack is a combination of different software versions that makes for a unique environment. Sometimes, installing a Service Pack can be a big change, so it has to have its own stack.\n- Each person, of course, can have only one stack on their own machine.\n- We do have a vCenter/vSphere solution in place and it's pretty good but we're looking to improve.\n\nHere's what we're trying do:\n- I'd like to have one VM per stack. That VM would be installed by IT (or someone assigned to that task).\n- When a support case comes in, the analyst would choose the VM that best machines their case and then creates a separate instance of that VM and give it a name related to their case number.\n- This is, of course, possible in a number of ways. Templates and Clones do this.\n- My idea was to use Linked Clones, they can save on disk space and they're very quick to create. However, I have number of problems with how linked clones are created in vSphere:\n1- They require the user to know a lot of technical details about the VM infrastructure (similar to creating new machines). It would be safer and easier to have a specialist do the cloning (which is not convenient given the big number of VM that has to be created).\n2- I'm not clear on permissions in vSphere but how can I control giving users permission to create these clones while not giving them full permissions.\n- I'd like to be able to do something like: right click -> create new instance -> Enter machine name -> Done. Basically, \"give me an instance of this machine\", like how Vagrant works.\n\nAny suggestions on vSphere (or VMware products) or any other vendor are welcomed.\nLet me know if you have any questions\n\nThanks in advance!","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/728910657148645"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/728910657148645"}],"privacy":{"value":""},"type":"status","created_time":"2014-04-11T18:47:49+0000","updated_time":"2014-04-23T06:20:03+0000","likes":{"data":[{"id":"891040383","name":"Ramy Mahrous"}],"paging":{"cursors":{"after":"ODkxMDQwMzgz","before":"ODkxMDQwMzgz"}}},"comments":{"data":[{"id":"728912857148425","from":{"id":"661261340","name":"Mohammad Tayseer"},"message":"I'm not an expert in virtualization. I think docker may help you on Linux (https://www.docker.io)","can_remove":true,"created_time":"2014-04-11T18:53:52+0000","like_count":1,"user_likes":true},{"id":"728913253815052","from":{"id":"100000116116716","name":"Mohamed Sameeh Sharaf"},"message":"Mahmoud Magdy","message_tags":[{"id":"558270644","name":"Mahmoud Magdy","type":"user","offset":0,"length":13}],"can_remove":true,"created_time":"2014-04-11T18:55:43+0000","like_count":0,"user_likes":false},{"id":"728913760481668","from":{"id":"652024918","name":"Amr Eldib"},"message":"Thanks Mohammad Tayseer but we mainly use Windows VMs :(","message_tags":[{"id":"661261340","name":"Mohammad Tayseer","type":"user","offset":7,"length":16}],"can_remove":true,"created_time":"2014-04-11T18:57:15+0000","like_count":0,"user_likes":false},{"id":"728914420481602","from":{"id":"601801267","name":"Hosam Kamel"},"message":"From a development perspective this can be done through lab management (component of Team Foundation Server) it allows you to define the environment and moreover allows you to link test cases and bug to a specific environment at specific state.... But this is based on System Center Virtual Machine Manager","can_remove":true,"created_time":"2014-04-11T18:59:41+0000","like_count":1,"user_likes":true},{"id":"728918683814509","from":{"id":"652024918","name":"Amr Eldib"},"message":"Thanks Hosam Kamel but it's not an exclusive development shop. There are a lot of other non-developers with no Visual Studio or code.","message_tags":[{"id":"601801267","name":"Hosam Kamel","type":"user","offset":7,"length":11}],"can_remove":true,"created_time":"2014-04-11T19:10:16+0000","like_count":0,"user_likes":false},{"id":"728919453814432","from":{"id":"601801267","name":"Hosam Kamel"},"message":"Lab Management depending on System Center Virtual Machine Manager( part of System Center family) to implement the virtual machines environments ... If this not for development or testing purposes you may take a look into system center first.","can_remove":true,"created_time":"2014-04-11T19:12:50+0000","like_count":1,"user_likes":true},{"id":"728933553813022","from":{"id":"652024918","name":"Amr Eldib"},"message":"Looks interesting, I'm gonna try that. Thanks","can_remove":true,"created_time":"2014-04-11T19:44:49+0000","like_count":0,"user_likes":false},{"id":"729035103802867","from":{"id":"558270644","name":"Mahmoud Magdy"},"message":"Amr\nCheck my blog i have created a series of blog entries speaking about automating virtual machine creation based on csv\nYou can customize it to use whatever ticketing system, the blog uses vcenter orchestrator which comes for free with your esxi\n\nThe problem with your solution is linked clones, linked clones r used only with vdi implementation using vmware horizon so it wont work oob\n\nIf you want to do vdi that will be a separate case and i would go with xendesktop with streamed os that will be epic storage saving\n\nThings to consider is how networking will be done\nDedue at storage level","can_remove":true,"created_time":"2014-04-11T23:05:29+0000","like_count":1,"user_likes":true},{"id":"729129143793463","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"how about images in azure?","can_remove":true,"created_time":"2014-04-12T02:33:02+0000","like_count":1,"user_likes":true},{"id":"729180050455039","from":{"id":"719470447","name":"Sameh Samir"},"message":"Actualy Meligy raised a good point, are you open to cloud based solution or tied to on-premises (cost / regulations etc)?\n\nWe have a similar situation, maybe a little complex. Each customer has multiple servers, each of it's own role, stack of SW,  and connectivity options (mainly VPN solutions). We usually need to simulate their setup for testing/analysis and Amazon Web Services (AWS) has been more than enough for the job. \n\nWhat I like about this solution:\n- Simple, even moderate team members can get into it w/o training.\n- Accessible almost from everywhere. Even you can send someone an image/instance link w/ a user account and s/he will be ok whatever platform s/he uses\n- You can create as many images (SW stack of a VM, not linked to a specific H/W) and instances (full VM) and you won't be charged for it unless used.\n- Unless you are analyzing performance related cases or running really heavy SW, you'll find really cheap AWS instances that costs less than 7 cents / hr. Extra small instances running Linux are free!\n- Rich set of APIs that facilitate automated testing/analysis (a small script can start a machine, launch a specific SW, run tests, send results, then shut it down)","message_tags":[{"id":"544815169","name":"Meligy","type":"user","offset":8,"length":6}],"can_remove":true,"created_time":"2014-04-12T05:02:42+0000","like_count":1,"user_likes":true},{"id":"729181170454927","from":{"id":"652024918","name":"Amr Eldib"},"message":"Thanks Mahmoud Magdy can you add the link to your blog?","message_tags":[{"id":"558270644","name":"Mahmoud Magdy","type":"user","offset":7,"length":13}],"can_remove":true,"created_time":"2014-04-12T05:07:29+0000","like_count":0,"user_likes":false},{"id":"729181660454878","from":{"id":"652024918","name":"Amr Eldib"},"message":"Mohamed Meligy Sameh Samir Thanks guys, but I'm looking for an on-premise solution.\nBut I'm interested in knowing about cloud based solutions. Maybe it will make more sense than I think.","message_tags":[{"id":"544815169","name":"Mohamed Meligy","type":"user","offset":0,"length":14},{"id":"719470447","name":"Sameh Samir","type":"user","offset":15,"length":11}],"can_remove":true,"created_time":"2014-04-12T05:09:51+0000","like_count":0,"user_likes":false},{"id":"729199707119740","from":{"id":"558270644","name":"Mahmoud Magdy"},"message":"http://autodiscover.wordpress.com/2013/11/05/vcloud-orchestrator-automating-orgvdcvapp-provisioning-via-csv-part1/","can_remove":true,"created_time":"2014-04-12T06:32:16+0000","like_count":1,"user_likes":true},{"id":"729211710451873","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"the nice thing about cloud you can have images stored, fire vm when needed, and kill it later when not, very eadily. can even use APIs to do thay with relative ease to build ui on top.  running VM for few hpurs or days will be cheap still","can_remove":true,"created_time":"2014-04-12T07:17:36+0000","like_count":0,"user_likes":false},{"id":"729212587118452","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Works for Netflix. Should work for you\nhttp://m.slashdot.org/story/189365","can_remove":true,"created_time":"2014-04-12T07:21:47+0000","like_count":0,"user_likes":false},{"id":"729220380451006","from":{"id":"558270644","name":"Mahmoud Magdy"},"message":"Interesting how the solutions and suggestions are leaning toward ignoring the current infrastructure investment sone with esxi\n\nNot saying cloid is bad but do you guys realise the investments done in such envionment unless i am missing the case and he is looking to through it in the bin","can_remove":true,"created_time":"2014-04-12T07:51:53+0000","like_count":0,"user_likes":false},{"id":"729284993777878","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"#kidding Don't be silly ;). You are on facebook, that's even worth than Hacker News. Set realistic expectations.\n\nMy first comment was a throwaway to see the response. It felt he didn't stress the infrastructure bit so much. His reply didn't completely omit the alternative (he said he is interested in learning about it), hence the other detailed reply.","can_remove":true,"created_time":"2014-04-12T09:51:42+0000","like_count":0,"user_likes":false},{"id":"729344057105305","from":{"id":"558270644","name":"Mahmoud Magdy"},"message":"Maybeeeeeee","can_remove":true,"created_time":"2014-04-12T12:50:43+0000","like_count":0,"user_likes":false},{"id":"729367170436327","from":{"id":"719470447","name":"Sameh Samir"},"message":"Mahmoud Magdy you've a point actually that we hit every now and then when customers can't give up their infrastructure investment, hence the hybrid clouds. If you decided the clouds works for you both from functionality and cost effectiveness, then why not stop investing in infrastructure and start moving to the cloud gradually?","message_tags":[{"id":"558270644","name":"Mahmoud Magdy","type":"user","offset":0,"length":13}],"can_remove":true,"created_time":"2014-04-12T13:56:59+0000","like_count":0,"user_likes":false},{"id":"729380937101617","from":{"id":"558270644","name":"Mahmoud Magdy"},"message":"Sameh\nI work @ the cloud and i am not here saying one is bad and the other is good, i sell cloud everyday and i operate one of the largest in the region. \n\nBut i can't expect that cloud is the magic answer and the silver bullet to solve every problem also speaking aboit hyprid cloud in my opinion not mature and clear yet\n\nI hope we r not starting a war here ;-)","can_remove":true,"created_time":"2014-04-12T14:27:34+0000","like_count":1,"user_likes":false},{"id":"729431813763196","from":{"id":"719470447","name":"Sameh Samir"},"message":"Mahmoud Magdy إنهم يسبون ألهتنا, إنها الحرب إذا :D","message_tags":[{"id":"558270644","name":"Mahmoud Magdy","type":"user","offset":0,"length":13}],"can_remove":true,"created_time":"2014-04-12T16:56:14+0000","like_count":1,"user_likes":false},{"id":"729432303763147","from":{"id":"719470447","name":"Sameh Samir"},"message":"Never, have been already over those advocacy days (u should catch me back then :)\n\nI myself have been part of the team who set the exam objectives and wrote and reviewed the questions for MCTS - WCF and MCPD - Azure yet buried head to toe in AWS as it's my company choice now. Not advocate for any of them either\n\nBack to main topic, I wanted to stress a fact you - and many - already know that cloud != throwing exiting infrastructure. \n\nCloud is the silver bullet for every problem > so superficial, so totally agree. Yet in this case (analysis / testing) I can see the cloud as a perfect fit, at least in my experience. Some of our customers are hospitals sparse  30+ locations across US, each of it's own local server(s). Asking for even 1/3 this # of servers to replicate their environment would get me fired on the spot :) On the other side, 30 servers on AWS for an hour would cost just a few bucks\n\nI can't argue if hybrid clouds are mature or not, it depends on your definition of maturity. Yet in my daily job, I can see some interesting situations where hybrid clouds is a life saver.\n\nFor example, in medical field, you need your gateway servers connected directly to modalities (i.e ultra sound machines). Cloud is so cumbersome and unreliable for this job. On the other side, we process a homogeneous amount of images/videos that would cost a small clinic a fortune to do on-premises. Here comes hybrid clouds.\n\nFinally, I wasn't contributing enough here and it seems I've been missing a lot of fun actually :)","can_remove":true,"created_time":"2014-04-12T16:57:45+0000","like_count":1,"user_likes":false},{"id":"729525387087172","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Sameh Samir yes, you are missing a lot of fun. The par here for most members is very high, in a way that I haven't seen in any Egyptian mail/social group before.","message_tags":[{"id":"719470447","name":"Sameh Samir","type":"user","offset":0,"length":11}],"can_remove":true,"created_time":"2014-04-12T20:45:09+0000","like_count":4,"user_likes":false},{"id":"729557913750586","from":{"id":"100008182590560","name":"Moutaz Hodhod"},"message":"Hi Amr \nI working in Building Distributors By LFS Or Gentoo \nAnd I Have One Solution For U\nmake Vmware , Virtualbox VM-manager AS your Desktop\nIt's Take 70MB RAM When run with virtualbox","can_remove":true,"created_time":"2014-04-12T22:09:08+0000","like_count":0,"user_likes":false},{"id":"729596603746717","from":{"id":"558270644","name":"Mahmoud Magdy"},"message":"Hi Sameh,\nIf you checked the above comments, and from my point of view they don't fit as answers to the original question (what could be used based on VMware).\n\nI totally agree with you, cloud has a huge benefit specially in DR/Testing..etc, but as I said, I live inside it and from this god view (if I may say ;)) it always depends.\n\nwhat I wanted to say after all, when throwing answers on public forums, we should be extremely careful, we as thought leader (again If I may say) drive people toward certain directions and we should pay attention to the original request with where we are driving the discussion","can_remove":true,"created_time":"2014-04-13T00:23:55+0000","like_count":0,"user_likes":false}],"paging":{"cursors":{"after":"WTI5dGJXVnVkRjlqZFhKemIzSTZOekk1TlRrMk5qQXpOelEyTnpFM09qRXpPVGN6TkRnMk16VTZMVEU9","before":"WTI5dGJXVnVkRjlqZFhKemIzSTZOekk0T1RFeU9EVTNNVFE0TkRJMU9qRXpPVGN5TkRJME16STZMVEU9"},"next":"https://graph.facebook.com/v1.0/172338516139198_728910657148645/comments?access_token=CAAEFxxeGv2oBALYqSQqceRGHePLeRp50uBcNa7mG5ZBbfQlfxgkcaCDLo464nDSSP5uCgzzJ92SU2dn8ZBZCQ4i2RzTqtGWQXGixhtTb4DHvrAKyH5Noyj4mW845ENnkoHoK4LVSe3VnwLfVTmRT22sxgp1JXzplXGgG7kxwirNDZCUq1CUb&limit=25&after=WTI5dGJXVnVkRjlqZFhKemIzSTZOekk1TlRrMk5qQXpOelEyTnpFM09qRXpPVGN6TkRnMk16VTZMVEU9"}}}