{"id":"172338516139198_739899116049799","from":{"id":"548509156","name":"Ahmed Gaber"},"to":{"data":[{"id":"100000152886101","name":"Mohamed A. Baset"},{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"السلام عليكم\nفي موضوع كده انتشر اليومين دول بتاع بوستات ازاي تشوف كاميرا صاحبك و ازي تعمل معرفش ايه منين علي الفيس, الموضوع مزعج الصراحه\nالنهارده قلت اقلب كده في الكود اللي بيتنسخ ده وطلعت بشويه حاجات انا شايفها كارثيه في السيكيورتي بتاعه الفيسبوك قلت اشيرها معاكم و محتاج رأي جيكس الفيسبوك اللي معانا\nاولا الكود بيشتغل علي مرحلتين, الكود اللي بيتنسخ ده يعتبر ثابت بتغيرات بسيطه لكن في اساسه ثابت\nاول ملحوظه يمكن شدت انتباهي ان الكود مكتوب بالتركي, نسبه كبيرة اللي كتب الكود تركي او بيعرف تركي و حابب يشفر الكود يمكن الله اعلم, الامر ده غريب لاني عايش في تركيا و اللي شايفه ان الاتراك ابعد ما يمكن عن البرمجه او الهاك علي العموم دي ملحوظه جانبيه حبيت اسجلها مش اكتر\nالملحوظه التانيه و يمكن دي اللي انا مش فاهمها الصراحه ان الكود بيطلب بيرمشن و بيشتغل علي ابليكشن فيسبوك رقمه 121876164619130 \nهو ده الابليكشن اللي السكربت بياخد منه الاكسس توكن علشان يعمل اي اكشن سواء فولو او بوست او لايك لصفحه, لو جيت تشوف ايه الابليكشن ده هتلاقيه ابليكشن البيج مانجر من الاندرويد, ممكن تلاقي تفاصيل اكتر من هنا Graph Explorer\nدي بقي الصدمه, الابليكشن ده ناس كتير جدا بيستخدموه, ده معناه انك لوعامل له اكسبت و ده احتمال كبير, السكربت بتاع الهاكر هايدخل ياخد اكسس توكن و يعمل اللي هو عايزة, و اللي شفته ان الاكسس توكن بتتخزن علي الاوفلاين ستورج ده معناه ان هو بالاكسس توكن ممكن يشتغل بعدين , انا مش فاهم الحته دي اوي انا بتكلم من معلومات سطحيه جدا و قراءة عابرة للاسكبرت\n\nالسكربت بعد ما بيعمل الاكسس توكن بيبعتها لصفحه ويب الهاكر بيبقي عاملها و بيبقي كاتب فيها الكود الحقيق بتاع الفولو او ايا كان النشاط اللي هو عايز يعملها\nامثله للصفحات الخارجيه دي \nhttp://www.weebly.com/weebly/apps/readDraft.php?draftId=839295953963304781&userId=27236607\n\nhttp://bqzet01.blogspot.com\n\nملحوظه : الصفحه لو فتحتها دلوقتي مش هاتعمل حاجه لانها مش ماسكه توكن, ممكن تشوف الحاجات اللي بتتعمل لو بصيت في السورس بتاع البيدج\n\nده تحليل سريع جدا من بصتي علي الكود و دلوقتي بقي \nالسكربت ده بيستغل جشع, او سذاجه الضحيه في انه يوقعه في الغلطه,\nفس ناس بتشتكي انه بيعمل ديسلايك لصفحه و يلاقي نفسه لايك تاني, او يعمل انفولو و يلاقي الفولو رجه, انا اعتقد ان المشكله سكربت من النوع ده, خاصه ان الابليكشن بيبقي واخد بيرمشن publish_stream يعني الستريم بتاعه الضحيه معاه يعمل اللي هو عايزة من غير حتي اكشن من اليوزر\n\nالموضوع مزعج الي ابعد حد لانه بيشتغل علي ابليكشن حتي انا عامل له اكسبت, \n\nايه بقي\nMohamed A. Baset","message_tags":{"2245":[{"id":"100000152886101","name":"Mohamed A. Baset","type":"user","offset":2245,"length":16}]},"actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/739899116049799"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/739899116049799"}],"privacy":{"value":""},"type":"status","created_time":"2014-05-02T00:45:54+0000","updated_time":"2014-05-02T22:07:32+0000","likes":{"data":[{"id":"652024918","name":"Amr Eldib"},{"id":"1163869892","name":"Maĥaṃḍ ṢaĿẳĥ"},{"id":"100003274923049","name":"Magda Zoheir"},{"id":"1614120164","name":"Eslam Hamouda"},{"id":"100000224559713","name":"Mohammed Yassin"},{"id":"658521185","name":"أحمد محمود محمد عبدالوهاب"},{"id":"1737594458","name":"Hend Sha'ban"}],"paging":{"cursors":{"after":"MTczNzU5NDQ1OA==","before":"NjUyMDI0OTE4"}}},"comments":{"data":[{"id":"739900702716307","from":{"id":"548509156","name":"Ahmed Gaber"},"message":"انا ممكن اكون غلطان او تحليلي سطحي بس اعتقد انه فيه جزء من الصحه, يا ريت الجيكس بتوعنا ينورونا","can_remove":false,"created_time":"2014-05-02T00:48:32+0000","like_count":0,"user_likes":false},{"id":"739904916049219","from":{"id":"665359179","name":"Ahmed T. Al-Amir"},"message":"موضوع معرفة الباسورد ده مجرد فخ لاجتذاب الضحايا، مش كدة؟ مفيش حاجة في الفيسبوك بتكشف الباسورد بتاعتك حتى لو معاك access token. ايه هي الpermissions اللي بيوافق عليها الناس اللي بتقع في المطب ده؟ ده اولا، ثانيا، السايت اللي بياخد الaccess token، بيعمل ايه بعد كدة؟ مش هنعرف من غير الكود بتاعه. او حد يعمل account تجريبي و يشوف بنفسه هيحصله ايه.","can_remove":false,"created_time":"2014-05-02T01:01:35+0000","like_count":0,"user_likes":false},{"id":"739927416046969","from":{"id":"548509156","name":"Ahmed Gaber"},"message":"هو فخ, مفيش اي حاجه تخليه يجيب لك باسورد حد, الاكسس توكن دي لما انت بتدي برمشن للابليكشن فالابليكشن بيستخدمها علشان يعرف الفيسبوك انك مدي برميشن ليه انه يشتغل\nلما السايت بياخد الاكسس توكن بيقدر يعمل اي حاجه في حدود البيرمشن اللي انت مديها له\nهتلاقي الكود في اللينكين اللي انا باعتهم بيعمل فولو لناس و لايك لصفحات و بيبعت علي الجروبس بتاعتك و علي بروفايلات صحابك\nالمشكله انه بياخد اكسس توكن من ابليكشن انا عندي 513 فريند من 604 هما كل الفريندز بتوعي بيستخدموه ابليكشن رسمي من فيسبوك\n\nكارثه","can_remove":false,"created_time":"2014-05-02T02:10:00+0000","like_count":0,"user_likes":false},{"id":"739961859376858","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"HAHAHAHA I did the same as well! one thing they do is to add you to a 3-4 profiles. take a copy of your cookies and send them open notifications and hide them and then they approve them alone!","can_remove":false,"created_time":"2014-05-02T04:19:54+0000","like_count":3,"user_likes":false},{"id":"739962112710166","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"that's why facebook released today their Anonymous login! http://mashable.com/2014/05/01/facebooks-anonymous-login-is-evil-genius/","can_remove":false,"created_time":"2014-05-02T04:20:53+0000","like_count":1,"user_likes":false},{"id":"740148029358241","from":{"id":"627907956","name":"Emad Elsaid"},"message":"ياراجل ؟ sub7 ده كان عامله واحد تركى ؟ ده كان برنامج اسطورة اللى ليه و اللى مالاهوش كان بيستخدمه","can_remove":false,"created_time":"2014-05-02T15:05:17+0000","like_count":1,"user_likes":false},{"id":"740149922691385","from":{"id":"627907956","name":"Emad Elsaid"},"message":"لوووووول","can_remove":false,"created_time":"2014-05-02T15:10:58+0000","like_count":1,"user_likes":false},{"id":"740169152689462","from":{"id":"548509156","name":"Ahmed Gaber"},"message":"كويس ان في حاجه تركي و كويسه, انا كنت اقصد ان صعب هنا تلاقي مجتمع جيكس بسهوله عكس مصر مثلا في المدينه اللي انا عايش فيها في جامعتين و كل جامعه في كليه تعادل كليه حاسبات عندنا, و انا عايش في وسط طلابي, بالرغم من ده صعب تلاقي تجمع جيكس او ايفنتس او حتي شغف من حد انه يطور او يشتغل, بيتعاملوا مع شغلنا علي انه ماده للدراسه و بعدها خلاص","can_remove":false,"created_time":"2014-05-02T16:03:04+0000","like_count":0,"user_likes":false},{"id":"740176969355347","from":{"id":"652024918","name":"Amr Eldib"},"message":"علي مدار الإسبوعين اللي فاتوا بيجي لي إيميل من عنوان علي \nfacebookmail.com\nبيسألني إني أكد العنوان البريدي بتاعي علي الفيس بووك\nكنت ممكن أدوس لكني إستغربت إنه فيس بووك عمره ما بعت رسالة زي ديه\nوبعدين لاقيت شوية حاجات صغيرة غريبة\nالعنوان البريدي غلط غلطة صغير جدا\nالإسم المكتوب علي العنوان بدلا من \nAmr Eldib\nمكتوب إسم\nWaldo\nشكيت إنه خدعة .. لكن لما حاولت أدوس إنه سبام .. لاقيت جي ميل بيقولي \"إنت عايز تسيب فيس بووك\" يعني جي ميل بيشككني في نفسي\nمش فاهم إزاي فيه ناس قادرة إنها تبعت إيميلات من عنوان علي\nfacebookmail.com\nرغم إن فهمي إنه ده العنوان بتاع إيميلات الفيس بووك بس\nلكني لاقيت المقال ديه بتشرح إنها فعلا خدعة\nhttp://www.maketecheasier.com/differentiate-phishing-facebook-mail/","message_tags":[{"id":"652024918","name":"Amr Eldib","type":"user","offset":298,"length":9}],"can_remove":false,"created_time":"2014-05-02T16:28:46+0000","like_count":2,"user_likes":false},{"id":"740309626008748","from":{"id":"652024918","name":"Amr Eldib"},"message":"ده مش نفس اللي بيحصل لي .. أنا بيحصل العكس .. لكن ده يفسر سبب ظهور الإيميلات الغلط","can_remove":false,"created_time":"2014-05-02T22:07:32+0000","like_count":1,"user_likes":false}],"paging":{"cursors":{"after":"NzQwMzA5NjI2MDA4NzQ4","before":"NzM5OTAwNzAyNzE2MzA3"}}}}