{"id":"172338516139198_869744603065249","from":{"name":"Bahy Maghrabia","id":"1424611524279210"},"message":"Mozilla Egypt Tour #1 event is live now\n#share #attend #MozillaEgyptTour1","story":"Bahy Maghrabia shared MozillaEgypt's event to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"1424611524279210","name":"Bahy Maghrabia","type":"user","offset":0,"length":14}],"22":[{"id":"437972616224927","name":"MozillaEgypt","type":"page","offset":22,"length":12}],"37":[{"id":"1586870528210532","name":"Mozilla Egypt Tour #1","type":"event","offset":37,"length":5}],"57":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":57,"length":14}]},"picture":"https://fb-s-c-a.akamaihd.net/h-ak-xat1/v/t1.0-0/c107.0.130.130/p130x130/10422945_862437330445118_5299396000789259087_n.jpg?oh=533f48bf1c0ced452b0c3dc3b11626b1&oe=5970B689&__gda__=1500314399_cb8c7f35886bd84014174f2bb42d496f","link":"https://www.facebook.com/events/1586870528210532/","name":"Mozilla Egypt Tour #1","caption":"Mozilla Egypt Tour #1","description":"Mozilla Egypt Tour 2015\nJoin the open web community. Be part of one of the largest internet/web communities in the global.\n\nJoin us .. as a representative, a student ambassador, or just volunteer as you can in the community: http://is.gd/ybuMgF\n\nEither a student or a developer, come and join the first Mozilla Tour in Egypt, where you will be introduced to the latest updates and technologies of Mozilla.\n\nWherever you are, we will come to your city to help and guide you with what you need to learn and know.\n\nUPDATE:\nConsidering your recommendations and opinions, the event will be a one day for each city, the day will be divided into 2 main sections:\n\nFirst part : \nAbout Mozilla\n  Will give you a chance to look at the big picture of Mozilla and Mozilla Egypt community in particular, who we are, what we believe in, we'll talk about new mozilla technologies, insights into the Mozilla Egypt community, and how to get involved . Lots of fun and challenges will be there .\n\nSecond part : \nFirefox OS and WebMaker Circles\nJoin us to learn and celebrate the Firefox OS (Mozilla's open source operating system for the mobile web) and Mozilla Webmaker.\nPrepare yourself for the great Mozilla Egypt Camp, as you can compete with many others in creating, developing and testing a FirefoxOs mobile application, you may be one of the beat 5 to earn valuable rewards from Mozilla.\n\nThen prepare yourself for the great Mozilla Egypt Camp, as you can compete with many others in creating, developing and testing a FirefoxOs mobile application, you may be one of the beat 5 to earn valuable rewards from Mozilla.\n\nTell us who you are, where you live/study .. fill the form \nhttp://is.gd/ybuMgF  and we’ll be there.\n\n\nشارك مجتمع الويب المفتوح! كن جزءً من أكبر مجتمعات الانترنت والويب في العالم!\n\nشاركنا، كممثل لمجتمع موزيلا، أو كسفير للطلاب في بلدك/مدينتك .. أو متطوعا معنا في مجتمع موزيلا مصر:\nhttp://is.gd/ybuMgF\n\nاستعد للمشاركة في جولة موزيلا مصر للمحافظات، سواءً كنت طالباً أو مطوراً، شاركنا الجولة في مدينتك وتعرف على آخر تطورات موزيلا. جولة  في العديد من محافظات مصر، سنساعدك ونرشدك لكل ماتحتاج إلى معرفته فيما يخص موزيلا.\n\n تحديث:\nبعد جمع الآراء والمقترحات تقرر جعل الحدث مقتصراً على يوم واحد فقط لكل محافظة، في محاولة منا لتوفير أفضل الحلول لكم. وسيكون اليوم مقسماً إلى قسمين كالتالي:\n\nالجزء الأول:\nهو تعريف عام بمؤسسة موزيلا، آخر الأخبار والنشاطات، تعريف خاص بمجتمع موزيلا مصر وما نقوم به لخدمة مجتمع موزيلا.\n\nالجزء الثاني:\nوفيه الحدث الأكبر وهو تقديم نظام Firefox OS والتعرف عليه وعلى كيفية تطوير تطبيق باستخدامه عن طريق عمل Circles لمشاركة الأفكار ومعرفة كل ماهو متعلق بالنظام. أيضاً سنقوم بتغطية لـ Firefox Webmaker فكونوا مستعدين لهذا اليوم الحافل بالمعلومات والإفادة.\n\nاستعد فيما بعد للحدث الأكبر \"Mozilla Egypt Camp\" حيث ستتاح لك فرصة المنافسة في تطوير وابتكار تطبيقات لنظام التشغيل فيرفُكس Firefox OS، اسع لتكن الرابح ضمن أفضل خمسة تطبيقات سيحصلون على جوائز قيمة من موزيلا.\n\nأياً كان مكانك، فقط راسلنا، وسنقوم بزيارة محافظتك في جولتنا Mozilla Egypt Tour 2015.\nسجل هنا :http://mozillaegypttour1.mozilla-eg.org/Alexandria.html\n\n#MozillaEgyptTour1","icon":"https://www.facebook.com/images/icons/event.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/869744603065249"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/869744603065249"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"event","object_id":"1586870528210532","created_time":"2014-12-28T20:37:03+0000","updated_time":"2014-12-28T20:37:03+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"10155198585921579","name":"Mohammed Elbadry"},{"id":"1276644172417060","name":"Mohamed Maghrabia"},{"id":"1382568911803858","name":"Mohamed Gazr"},{"id":"10211135002706823","name":"Ahmad Abubakr"},{"id":"1496732523694038","name":"Ahmed Yousef"},{"id":"1292157770864948","name":"Mohammed Elnady"}],"paging":{"cursors":{"before":"MTAxNTUxOTg1ODU5MjE1NzkZD","after":"MTI5MjE1Nzc3MDg2NDk0OAZDZD"}}}}