{"id":"172338516139198_1294397183933320","from":{"name":"Ahmed Ghozia","id":"10154402183178575"},"message":"سلام عليكم و رحمة الله\nانا مدرس مساعد بقسم هندسة و علوم الحاسب - كلية الهندسه الإلكترونيه - جامعة المنوفيه.\nعندنا الكليه بتتخصص آخر سنتين: هندسة و علوم حاسب - هندسة إتصالات - هندسة التحكم.\nالطلاب بتتسائل دايما عن فرص العمل بعد التخرج - و انا إجابتي بتكون إتعلم صح و أسس نفسك كويس نظري و عملي و هتلاقي شغل إن شاء الله - و ده بناء علي تجربتي مع زملاء و خريجين لكليتنا.\n\nانا حابب الناس هنا - كمبرمجين شغالين في السوق - يجيبوا علي سؤال فرص العمل بعد التخرج - متاحه لمين ؟ و هل السوق فيه فرص و بينمو ؟ من هو الخريج المطلوب ؟ ما هي انواع الفرص المتاحه ؟ \nلأن الإجابه من حضراتكم هيكون ليها وقع تاني علي الطلاب و يا ريت لو يبقي فيه هاشتاج نسجل بيه ال posts في الموضوع ده  و شكرا جزيلا مقدما.","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1294397183933320"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1294397183933320"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"status","created_time":"2016-11-15T20:05:07+0000","updated_time":"2016-11-17T17:59:14+0000","shares":{"count":8},"is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"1231245263656767","name":"Sherif Abdel-Naby"},{"id":"1914347052131478","name":"Mostafa Megria"},{"id":"10211716273040701","name":"Ramy Zeineldin"},{"id":"1243598269049362","name":"Mahmoud Adas"},{"id":"1553656584649318","name":"Muhammad Abbas"},{"id":"1541667619232441","name":"Moh Dem"},{"id":"1890081151224359","name":"Adham Elsabbagh"},{"id":"1873036762957490","name":"سامح دعبس"},{"id":"797654013715692","name":"Mahmoud Jaber"},{"id":"1147249548730274","name":"Sara Esam"},{"id":"1286645891420269","name":"Ahmed Sawan"},{"id":"1682905402007879","name":"Medo Gamey"},{"id":"964888610313605","name":"قلم رصاص"},{"id":"428856594116187","name":"Saher Abdelaziz"},{"id":"803406523156737","name":"Omnia Salah"},{"id":"1334472319965425","name":"Mohamed Khattab"},{"id":"1486691128017222","name":"Ahmed AlAmir"},{"id":"1464384106945077","name":"Mohamed Essaam"},{"id":"667372510134551","name":"Mahmoud Esam"},{"id":"1833165443600780","name":"Ahmed Magdy"},{"id":"1253681964729491","name":"Eslam Esmaeal"},{"id":"1427741260609927","name":"Omar Shawky Hindi"},{"id":"1413613592030867","name":"Yousef Shahin"},{"id":"420911841578139","name":"Hamada Mahmoud"},{"id":"1303401749738780","name":"Mohamed Abdallah"}],"paging":{"cursors":{"before":"MTIzMTI0NTI2MzY1Njc2NwZDZD","after":"MTMwMzQwMTc0OTczODc4MAZDZD"},"next":"https://graph.facebook.com/v2.2/172338516139198_1294397183933320/likes?access_token=EAAEFxxeGv2oBALll8soOElB2cX7dFL0l0vgAi6oICOanjJYU1kOAKh0Lqcu5UyA7nIx0dgge89V567pmclXuGCsRw9lWX8BKEKyxKSa7LZBvla48KEPsZB4m7KKivz2epuuJ7F20w0bJL6tTCeLu9TBax3SFgZD&limit=25&after=MTMwMzQwMTc0OTczODc4MAZDZD"}},"comments":{"data":[{"created_time":"2016-11-15T20:13:01+0000","from":{"name":"Hazem Mahmoud","id":"648163712051676"},"message":"اللي انا ملاحظه ان الشباب الجديد مش متعلمين كويس للاسف \nمش عارف انا بس اللي حاسس كده ولا الناس كلها ملاحظه ده\nالشباب الجديدة اللي هما خريجين اخر 3 سنين مثلا كده","can_remove":false,"like_count":8,"user_likes":false,"id":"1294401247266247"},{"created_time":"2016-11-15T20:16:22+0000","from":{"name":"Rafael Adel","id":"10155242150027122"},"message":"هو السوق فى مصر حاله مايسرش .. بس هو فرص العمل متاحة للي بيأسس نفسه اكتر و بيتعب (مع ان الموضوع مفيهوش عدل برضو .. انا واحد مش خريج هندسة حاسبات ولا حاسبات و معلومات.. بس مأسس نفسي كويس مذاكر العلم نفسه و كنت بساعد ناس حاسبات و هندسة فى مشروعاتهم برضو .. لكن ما اتقبلتش فى شركات ال embedded لمجرد اني مش خريج احد الكليات دى بس ما علينا .. ) اللي مأسس نفسه صح و بيتعب و متابع ال trend الحاصل فى المجال يعني مش عارف technology من سنين و مكتفي بيها .. مجالنا مفيهوش مجرد ما تتخرج خلاص يبقي انت خلصت تعليم .. انت بتتعلم لحد ما تغير المجال :D\n\nالفرص المتاحة اعتقد بتكون محدودة المجالات بين web و موبايل .. فرص قليلة فى ال embedded .. في فرص ابتدت تظهر فى ال big data مثلا و هكذا مش ملم بكل الفرص طبعا","can_remove":false,"like_count":5,"user_likes":false,"id":"1294402850599420"},{"created_time":"2016-11-15T20:20:26+0000","from":{"name":"Muhammad Samir Hassan","id":"10156069071980200"},"message":"فى اجابة بقولها للناس اللى لسة بتدرس ... دايما بقولهم شوف انت نفسك تشتغل اية .. و ادخل على مواقع التوظيف و شوف ال job description و ال tasks اللى مطلوبة اية بالظبط... مثلا انت عايز تشتغل web developer دور على الفرص المتاحة و شوف اية اكتر تكنولوجى مطلوبة و اشتغل عليها و ذاكرها ..","can_remove":false,"like_count":12,"user_likes":false,"id":"1294404743932564"},{"created_time":"2016-11-15T20:30:11+0000","from":{"name":"Sabr Bry","id":"10202565635620285"},"message":"هندسه وعلوم حاسبات .. اكتر مجال فيهم الواحد ممكن يتعلم مع نفسه .. تقريبا مافيش الـفجوه الكبيره اللي ممكن تكون في التخصصات الاخري","can_remove":false,"like_count":2,"user_likes":false,"id":"1294410847265287"},{"created_time":"2016-11-15T20:39:25+0000","from":{"name":"Amir Abou Eesa","id":"1353018234756623"},"message":"الاتنيم زي بعض لان تلشركه اخر خاجه بتبص عليها هيا الشهاده/ ما بالك بالتخصص !!!","can_remove":false,"like_count":0,"user_likes":false,"id":"1294415900598115"},{"created_time":"2016-11-15T20:41:08+0000","from":{"name":"Ahmed Mansour","id":"10154384274361659"},"message":"اسمح لي اجاوب بصفتي خريج نفس الكلية سنة ٢٠١١ .... انا شايف ان الكلية عندنا بتضيع من عمرنا سنتين ع الفاضي ف اللاشىء وبعدين نرجع نتخصص سنتين .... سنتين تخصص للاسف ميكفوش عشان حد يتخرج بشكل مرتاح ويبقى الجاب بينه وبين السوق مش كبير .... في حين خريج مثلا حاسبات ومعلومات و خريج هندسة حاسبات تخصص اربع سنين داس فيها حاجات كتييييير عن الكمبيوتر والتخصص  ومنهم اللي بيتجدعن بيشتغل قبل ما يتخرج ...  للعلم. انا خريج قسم اتصالات ... واكتفيت بسنة وحدة بتعلم برمجة عشان اشتغل .... ولما بقابل ناس فريش خريجة نفس الكلية  بلاقيهم ع نفس وضعي زمان وأبدا أُوصِّف لهم الطريق ... نفسي يشيلو سنتين بتوع الإلكترونيات العامة لان  اصلا في شغلانة لوحدها اسمها مهندس إلكترونيات ودي محتاجة برضو تفرغ لوحدها .... للاسف ده تبديد مجهود وتركيز ع الفاضي استفدت انا ايه دلوقتي من دوائر الamplifier ورسم الخرائط الالكترونية .... \n\nلكن نصيحتي اللي حابب توجهها للطلبة اللي عايز يعرف السوق عايز ايه زي ما قال الأخ اللي قبل كده ... يشوف job description  ولو عايز يعلي ع نفسه شوية يدخل مواقع الفريلانسر ويشوف السوق العالمي طالب مؤهلات شكلها ازاي .... وإزاي بيتم توظيف العلم اللي اتعلمته في شكل مشاريع مطلوبة ع ارض الواقع ... بتبقى شكلها ازاي يعني","can_remove":false,"like_count":9,"user_likes":false,"id":"1294416810598024"},{"created_time":"2016-11-15T20:41:14+0000","from":{"name":"Ahmed Eid","id":"950025591798320"},"message":"لو حد قدامه ترابيزة مليانة اصناف اكل وانطلب منه يختار اكلة يكمل فيها علطول .. هيختار حاجه عشوائيا بسبب شكلها او سمعه عنها ولا يجرب يدوق من كل حاجه ويشوف استطعم ايه ويكمل فيه ومفيش ليمت للشفت كارير دلوقتى .. يعنى الطالب ف بدايته بفضل يتعرف على التكنولوجيز الموجودة باختلافها يعنى يعرف عن كلاود واوبن سورس وداتا بيز وحاجه زى برمجه و اسس حل مشاكل لازم يتعلمها لانها هتبنيه ف اى حاجه تانيه ويشوف انهى حاجه شداه ويروحلها .. الشغل مش صح يفكروا فيه بدرى لان فيه عوامل زى الجيش بتحكمه .. كان جالى شغل ف رايا وقت منا داخل جيش واعتذرت .. خلصت جيش ودخلت المنحه وروحت رايا فمحدش يستعجل رزقه ويبنى نفسه كويس وفيه منح زى الاى تى اى تحديدا بغض النظر لو مستوى التعليم مش بياخد كل حاجه صح لضيق الوقت الا انها بتلمعه وبتعلى فرصه اوى وبيدخل اماكن كان يبرق لو سمع اسمها وعن تجربه وشجعهم يهندسه ف حاجات زى acm وواثق انك بتعمل دا واكتر وربنا يعلم امتنانى لتاثيرك فينا  وتعليمك لينا وربنا يجعله ف ميزان حسناتك","can_remove":false,"like_count":5,"user_likes":false,"id":"1294416977264674"},{"created_time":"2016-11-15T20:53:23+0000","from":{"name":"Ahmed Sadek Mohamed Tawfik","id":"10154215525191922"},"message":"قد يكون السوق المصرى محدود بعض الشئ  .. لكن من المؤكد ان زمن العولمة .. عماده الأساسى و مش بعيد يكون الوحيد .. تكنولوجيا إيصال المعلومات .. بصفتى من جيل المودم ابو 56 بت فى الثانية .. و من قبل كده كمان .. يخلينى لزاما عليا اقول ان سوق البرمجيات سوق عالمى .. و لا يكفى أبدا ان اللى بيشتغل فيه يقيس نفسه على زمايله اللى معاه فى نفس الجامعة او فى نفس البلد .. الفرص موجودة و تتجدد يوميا .. و التكنولوجيا تتطور بطريقة سريعة .. و فى بعض الأحيان بطريقة فجَّة و غير إنسانية .. \nالخبر المفرح للخريجين .. ان التكنولوجيا دلوقتى أصبحت ناضجة جدا عن زمان .. و مصادر المعلومات متنوعة .. و بالتالى مش هيدخل فى متاهات من أين تأتى بالمعلومة .\nالخبر الأكثر فرحا: ان الشركات تفضل الخريجين الجداد عشان معرفتهم بالتكنولوجيا الجديدة.\nالخبر السئ .. ان على الرغم من النضج ده .. إلا ان التقنيات الخاصة بالبرمجة .. كتيرة جدا بطريقة يصعب الإلمام بيها فى وقت معقول.\nالخبر الأكثر سوءا: قدرتك على التكيف لما تيجى لحظة التغيير فى وقت ما كنت خلاص اتعودت على انك تشتغل بشئ محدد.\nلو حاولت ألخص .. الفرص موجودة .. لكن المنافسة شرسة .. خلى مراجعة الأساسيات عملية مستمرة بقدر الإمكان .. و اجبر نفسك على اكتساب المهارات العملية بدون كسل\nأخيرا .. العالم يحتاج إلى التجديد .. كن أحد مصادر هذا التجديد   ( و عذرا على الإطالة) :D","can_remove":false,"like_count":8,"user_likes":false,"id":"1294423517264020"},{"created_time":"2016-11-15T21:19:00+0000","from":{"name":"Mohamed Aboshady","id":"10155256519324642"},"message":"انا أولا عايز اشكرك لان اللي انت بتعمله ده هو دور ستاف الجامعة الحقيقي .. البحث عن وتوصيل اي معلومات تفيد الطالب انه يبقي مؤهل اكتر لسوق العمل .. ودوره ان المعلومات اللي بيوصلها دي تفضل up-to-date\n\nثانيا : المشكلة دايما في البداية .. الشغل عايز خبرة والخبرة عايزة شغل .. والحل هو انك تدور علي العملاء اللي ممكن يستحملوك وانت بتجرب فيهم علي ما تتعلم وتجيب العملاء التانيين .. وانسب نوع من دول هما الجمعيات والمؤسسات والانشطة التطوعية .. دور عليهم واعرفهم كويس وأعرف احتياجاتهم واقنعهم انك تعملهم مشاريع صغيرة بدون تكلفة .. اتعلم فيهم وساعدهم في نفس الوقت :-)","can_remove":false,"like_count":4,"user_likes":false,"id":"1294437460595959"},{"created_time":"2016-11-15T21:33:16+0000","from":{"name":"Muhammed Atif","id":"1885436341732284"},"message":"Khalid Ahmed","can_remove":false,"like_count":0,"message_tags":[{"id":"1247679838601295","length":12,"name":"Khalid Ahmed","offset":0,"type":"user"}],"user_likes":false,"id":"1294460913926947"},{"created_time":"2016-11-15T21:47:21+0000","from":{"name":"Mustafa Dagher","id":"10212394020589663"},"message":"هي نقط سريعة كدة،\n-هندسة حاسبات ال ٤ سنين تخصص، او حاسبات و معلومات مبيتعلموش احسن منك ولا حاجة عشان انت سنتين، مستوى و محتوى التعليم الأكاديمي كله واحد.. حتى هم بيدرسوا نفس المواد اللي كنت بتدرسها وانت مضموم على بقية شعبتك.. الفرق انهم بيبقوا في قاعة المحاضرات لوحدهم\n\n- قد يبدوا ان الجيل الجديد اكثر كسلا و ده حقيقي بس مش بالقدر اللي بيبان عليه.. الناس متحاملة عليهم بردو\n\n-العلوم النظرية و الدراسة الأكاديمية مهمة جدا، بس مبتفرقش بين خريح حاسبات/هندسة و خريج تجارة اللي ذاكر لوحده ولا حاجة لأن معظم الطلبة المصريين ميبقوش مهتمين و بيذاكروا على قد الامتحان..\nبعد فترة لما بيضطر يتحط في اختبار يختبر دراسته للعلوم النظرية بيضطر يذاكر من الأول زيك بالظبط لأنه فعلا بطيخ\n\n-لو انت مش خريج هندسة/حاسبات سهل جدا تحصل كل اللي فاتك و مدرستوش في كليتك.. الأونلاين كورسز اكتر من شعر الراس، و بتبسط و بتفهم احسن من الكليات\n\n-كمية ال frameworks و ال technologies اللي موجوده و مطلوبة في السوق ابعد بكتير من اللي تقدر تقدمه أي دراسة اكاديمية و ابعد حتى عن علم/احاطة الأساتذة و المعيدين اللي في الكليات بيها و كتير بتبقى نصايحهم مضللة\n\n-النقطة اللي فاتت تعتبر احد العوامل اللي بتخلينا متحاملين على الأجيال/الخريجين الجداد\n\n- النقطتين اللي فاتوا مش معناهم بردو ان الأجيال الأجدد مش متكاسلة.. معظم الخريجين اللي أعرفهم عايزين يشتغلوا من غير اي تعب إضافي و كأن نجاحهم في الكلية جميلة في رقبة الشركات، و حتى بعض اللي بيلاقي شغل منهم مبيبقاش عايز يتعب ولا يدور ولا يتعلم و عايز حد يساعده او يعمله شغله دايما و يقبض مرتب و هو مرتاح..\n\n-فرص العمل في مجالنا كتيرة جدا، بس الناس ال qualified قليلة فعلا، و حسب بردو انت بتدور على ايه!\n\n-كطالب او كخريج جديد المفروض تبقى متابع السوق و الدنيا, مشترك في المواقع و المجلات الأونلاين اللي بتكتب في اخر ما وصلت ليه التكنولوجيا من جديد، و يقرا و ميتصعبش حتى لو مش فاهم اوي، يشوف اعلانات الوظائف على LinkedIn و stackoverflow من و هو طالب و يشوف بيبقوا طالبين ايه و يحط لستة بالحاجات الأكثر تكرارا و يبدأ يقرا فيهم و ياخد قرار يتعب و يستخدم بعضهم في مشاريعه في الكلية و ياحبذا لو في مشروع تخرجه..","can_remove":false,"like_count":12,"user_likes":false,"id":"1294493150590390"},{"created_time":"2016-11-15T22:29:02+0000","from":{"name":"Mohamed Elsherif","id":"10158483817400314"},"message":"لو حيستنى لما يتخرج علشان يدور على شغل، يبقى Too Late النصيحة الأهم للطلبة ما تضيعوش الصيف","can_remove":false,"like_count":17,"user_likes":false,"id":"1294514017254970"},{"created_time":"2016-11-16T07:33:36+0000","from":{"name":"AbduLatif Ahmed","id":"2034275576800025"},"message":"كان عندنا دكتور في الكلية بقوله يا دكتور هي المناهج هتنفعنا لما نتخرج قالبي ببساطة لا !\nدي مناهج مفروضة علينا ! وكان دايما بينصحني بكتب حديثة جدا طبعا انا قصدي على كتب it خصوصا البرمجة \nكان دايما يقول الكتب دي هي اللي هتنفعك قدام مش منهج الكلية !\nالله يرحكمك يا دكتور هشام","can_remove":false,"like_count":0,"user_likes":false,"id":"1294930467213325"},{"created_time":"2016-11-16T09:24:20+0000","from":{"name":"Fikry Samy Yussef","id":"10155779263593906"},"message":"هندسة و علوم حاسب","can_remove":false,"like_count":0,"user_likes":false,"id":"1294973723875666"},{"created_time":"2016-11-16T22:41:07+0000","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"انا شايف ان الفرص الأكتر خلال الكام سنة اللى فاتوا كانت الweb development والmobile development، الويب تكنولوجيز دلوقتى بقى ليها bridges علشان الناس تعمل desktop apps او mobile apps ، وفيه شغل الsupport للديفلوبرز زى الdeveloper productivity و software reliability engineer و automation engineer وكده، \nلكن ده مايمنعش ان فيه وظايف تانية الشركات بتطلبها وفيها نقص كبير زى الembded systems والsystem development.\nمن رأيى ان الطلبة المفروض تكون شايفة الصورة كاملة وان مش معنى ان السوق طالب ويب ديفلوبرز ان كل الناس تتجه لده خوفا منهم انهم مايلاقوش شغل فى مجال تانى لأن ده يقلل قيمة البوزيشن لأن العرض هيكون اكتر من الطلب، حابب ان الناس تكون عارفة ان المهم فى الموضوع ان يكونوا بيعرفوا يعملوا حاجة كويس وان ده المهم علشان يلاقوا مكانهم فى شركة، اه ممكن يكون عارف موبايل ديف او ويب ديف علشان يلاقى شغل بسرعة بس لو مش حاببهم ممكن يعمل اللى حابه ويركز فيه وهيلاقى المكان اللى طالب اللى بيعرف يعمله، وفيه معلومة مش عارف ليه ناس كتير مش واخدين بالهم منها ان ده سوق بتحكمه ابسط قاعدة فى الإقتصاد (العرض والطلب) فلما تكون مهارة مطلوبة والمهارة دى نادرة فى السوق ده بيخلى قيمة الcandidate اكبر.\nوزى ماحضرتك بتقول كده ان السانيس مهم كأساس لكل وظيفة والمفروض يركزوا فيه مع التولز او لغات البرمجة اللى هيتخصصوا فيها.\nهل السوق فيه فرص اه فيه فرص وبتزيد علشان ناس كتير من الموجودين بتسيب البلد لما بيجيلها فرصة برة، لكن هل السوق بينمو؟ دى حاجة مش متأكد منها، انا مش شايف شركات كتير بتبدا او funding نازل يساعد الستارت أبس.","can_remove":false,"like_count":9,"user_likes":false,"id":"1295518490487856"},{"created_time":"2016-11-17T06:33:51+0000","from":{"name":"Mohamed Selim","id":"10158416724500711"},"message":"علي حسب مكان الشغل فين ، مصر والدول العربيه اعتقد اي واحد بيبذل مجهود متوسط هيلاقي شغل بسهوله ، دول اوروبيه مثلا اعتقد المنافسه صعبه اوي ، الناس دي بيتعلموا صح في كلياتهم وفي مدارسهم صعب تنافس معاهم بلد منظومة التعليم عندها بايظه ، بس في الاخر اللي بيتعب وهيلاقي اللي يدله ع الطريق اكيد هيلاقي","can_remove":false,"like_count":0,"user_likes":false,"id":"1295809670458738"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEk1TkRRd01USTBOekkyTmpJME56b3hORGM1TWpRd056ZA3kZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEk1TlRnd09UWTNNRFExT0Rjek9Eb3hORGM1TXpZAME5ETXkZD"}}}}