{"id":"172338516139198_996510340388674","from":{"name":"Hussein Ghaly","id":"10158391110790193"},"message":"from \"Hello World\" to build your own Google ... this lecture will walk you through the basics of Python programming especially for natural language processing applications, up to the most sophisticated search engine applications ... the next Google built by YOU :)\nI am happy to have a chance to give this lecture next Saturday, it is a free event, please come and share with your friends :)","story":"Hussein Ghaly shared Hasoubawayh Academy's event to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"10158391110790193","name":"Hussein Ghaly","type":"user","offset":0,"length":13}],"21":[{"id":"153907431424315","name":"Hasoubawayh Academy","type":"page","offset":21,"length":19}],"43":[{"id":"1485534495100504","name":"Lecture | Python NLP & Web","type":"event","offset":43,"length":5}],"63":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":63,"length":14}]},"picture":"https://fb-s-d-a.akamaihd.net/h-ak-xpa1/v/t1.0-0/c16.0.130.130/p130x130/11934954_530223197126068_3512634091439186754_n.png?oh=cec8584d3c4031f3542e4e038877ef15&oe=59706723&__gda__=1499125669_67cb1a50d60c9d1ec64b1a2300038cef","link":"https://www.facebook.com/events/1485534495100504/","name":"Lecture | Python NLP & Web","caption":"Lecture | Python NLP & Web","description":"نبذة عن المحاضرة \n===========\n\nتصادفنا طوال الوقت الكثير من التكنولوجيات والتطبيقات والمواقع والخدمات الحاسوبية التي نكاد لا نلاحق متابعة أخبارها وما تضيفه للعالم ولأوساط الأبحاث وأيضا للمجالات التجارية والمالية، فضلا عن تعلمها ومحاكاتها.\n\nفي هذه المحاضرة سنستكشف بعضا من هذه الأمور من منطلق كيف تفهمها جيدا كي تنفذها بنفسك أو تبدأ أبحاثك أو مشروعك التجاري من خلالها، بدءا من أبسط التطبيقات البرمجية إلى أعقد المجالات من قبيل محركات البحث على الإنترنت.\n\nوسنحاول من خلال المحاضرة عرض مبادئ البرمجة بلغة بايثون ونماذج من البرامج المكتوبة بهذه اللغة لأغراض معينة، متدرجين في نفس الوقت في عرض مبادئ معالجة اللغات الطبيعية التي تقوم عليها تلك التطبيقات وبعضا من مبادئ تطوير تطبيقات الويب حتى نصل إلى شرح كيفية بناء محرك البحث.\n\nسيتاح للمشاركين في المحاضرة الحصول على حساب مجاني FTP لاختبار وتنفيذ تطبيقاتهم على الإنترنت.\n\n\nWe keep hearing about many technologies, applications, web sites and services, which we can hardly keep up with, and with their contributions to the world and to research and business, let alone learn and emulate. In this seminar, we will explore some of these from the perspective of how to understand them in order to implement them yourself, and/or do your research/business through them, starting from the most basic applications to the most sophisticated fields such as search engines. No significant programming experience is necessary, though it may be helpful. During the seminar we will attempt to present the basics of programming with Python language, together with some python code for certain purposes, simultaneously and gradually presenting the basics of Natural Language Processing for such applications together with Web Technologies, up until we explain how to build a search engine. Participants will get a free FTP account to test and implement their applications online.\n\nالمحاضر\n======\n\nحسين غالي باحث لغوي ومترجم ومهندس، عمل على مدى السنوات الست السابقة مترجما في إحدى المنظمات الدولية في نيويورك ويعمل هناك حاليا خبيرا في اللسانيات الحاسوبية Computational Linguist. أتم مؤخرا درجة الماجستير في اللسانيات الحاسوبية من جامعة مدينة نيويورك CUNY وحاليا في مرحلة الدكتوراه. قام بتنفيذ العديد من المشاريع الحاسوبية القائمة على تقنيات اللغة مستخدما في ذلك لغتي بايثون وجافاسكريبت والعديد من تقنيات معالجة اللغات الطبيعية وتقنيات الويب.\n\nمكان المحاضرة\n=========\n\nبرج الأورمان، أمام مجلس الدولة، الدور الأول، داخل سنتر حياة، ، الدقي\n\nللحجز (المحاضرة مجانية)\n===============\n\nبرجاء إرسال الاسم والمؤهل والوظيفة ورقم الموبايل في رسالة خاصة إلى الصفحة أو الرقم 01011457000 أو الواتس آب على نفس الرقم\n\nللاستعلام\n=======\n\n01011457000\n\nالمحاضرة مجانية","icon":"https://www.facebook.com/images/icons/event.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/996510340388674"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/996510340388674"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"event","object_id":"1485534495100504","created_time":"2015-08-26T11:27:19+0000","updated_time":"2015-08-26T11:27:19+0000","is_hidden":false,"is_expired":false}