{"id":"172338516139198_838170369556006","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"فى حاجة حابب اسأل عليها، كنت دايمآ بلاقى اننى وانا بشتغل بقعد ادور على جوجل كتير، بدور فى الreference كتير.\nلاحظت ان معظم الناس بتعمل كده بنسب مختلفة على حسب تمكنهم من لغة البرمجة اللى شغالين بيها و خبرتهم.\nهل ان الواحد يدور كتير على مشكلة واقعة قدامه دى حاجة مظبوطة ولا المفروض يدور على حل بنفسه؟، ولا الموضوع ليه مميزات و عيوب زى انه لو دور على الحل و طبقه هايوفر وقت (وفلوس) لكن مش هايكتسب نفس الخبرة لو درب دماغه على حلها، ولو عمل العكس هايكتسب خبرة اكبر و يحرق وقت اكبر. \nهل الواحد المفروض يمنع نفسه من انه يروح على جوجل اول ماتقابله مشكلة؟، ولا المفروض يكون اسرع فى التدوير و تطبيق حلول باقى الناس؟\nبما ان كمان احنا شغالين فى مجال علمى زى اى مجال كلنا بنبنى فوق اللى الباقيين مننا بيعملوه و ناس تانية بتيجى تبنى على اللى احنا عملناه، فهل اننا ندور على حل حد تانى عمله دى مش حاجة عادية طبيعية فى اى مجال ؟","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/838170369556006"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/838170369556006"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"status","created_time":"2014-10-29T23:03:04+0000","updated_time":"2014-10-30T12:50:32+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"1077277359040207","name":"Ahmed El-Makawy"},{"id":"10208017111216745","name":"Ahmed Elsharkawy"},{"id":"1051388154965675","name":"Khaled Fares"},{"id":"10155634469686002","name":"Muhammad Saleh"},{"id":"1340434959359755","name":"Ahmed Kh'aled"},{"id":"10211847388241825","name":"Ahmed Shawky"},{"id":"10154264552927478","name":"Anas Emad"},{"id":"1595090087175411","name":"Osama Khaled"},{"id":"10210432517001560","name":"Muhammad El-Hennawy"},{"id":"1468423219844248","name":"Mohamed Amin"},{"id":"10211887209872216","name":"Islam AbdelMohaimen Hassan"},{"id":"1490284664349500","name":"Ahmed Fathi"},{"id":"10211928046461151","name":"Hazem Abdelraheem"},{"id":"10210755800843782","name":"Ahmed Omran"},{"id":"1387228811341413","name":"Mohamed Hashem"},{"id":"10209738059582902","name":"Mohammed Ezzat"},{"id":"1833165443600780","name":"Ahmed Magdy"},{"id":"615998291927934","name":"Ahmed Elwerdany"},{"id":"10210940122889329","name":"Askao Ahmed Saad"}],"paging":{"cursors":{"before":"MTA3NzI3NzM1OTA0MDIwNwZDZD","after":"MTAyMTA5NDAxMjI4ODkzMjkZD"}}},"comments":{"data":[{"created_time":"2014-10-29T23:11:32+0000","from":{"name":"Aboubakr Gamal","id":"10212365276868126"},"message":"انت problem solver \nمهمتك حل المشكلات و شئ اساسي لما تحل اي مشكلة في الحياة ترجع للخبرات السابقة سواء خبرتك انت او خبرة حد تاني له سابق تعامل مع المشكلة و بناءا عليه تزداد خبرتك","can_remove":false,"like_count":2,"user_likes":false,"id":"838173262889050"},{"created_time":"2014-10-29T23:13:06+0000","from":{"name":"Aboubakr Gamal","id":"10212365276868126"},"message":"مش كل الحلول تتناسب مع مشكلتك تحتاج ان انت تعدل الحل ليتناسب معك","can_remove":false,"like_count":1,"user_likes":false,"id":"838173999555643"},{"created_time":"2014-10-29T23:13:46+0000","from":{"name":"Mohamed Hashem","id":"1387228811341413"},"message":"this is somehow related to this essay here \nhttp://www.hanselman.com/blog/AmIReallyADeveloperOrJustAGoodGoogler.aspx\nand i'm totally agree with scott hanselman in his answer \nwishing someday could do in his advice :D","can_remove":false,"like_count":2,"user_likes":false,"id":"838174576222252"},{"created_time":"2014-10-29T23:13:52+0000","from":{"name":"Aboubakr Gamal","id":"10212365276868126"},"message":"تقريبا كل المبرمجين يستخدمون جوجل او الdocumentation","can_remove":false,"like_count":0,"user_likes":false,"id":"838174629555580"},{"created_time":"2014-10-29T23:14:33+0000","from":{"name":"Mostafa Hussein","id":"599781276899213"},"message":"و ساعات بيحصل معايا اني عندي فكرة للحل بس مش عارف ابدأها منين . فأوقات بلاقي حاجة قريبة من اللي بفكر فيها و اوقات تانية العكس اني بلاقي حلول بتخليني اكون فكرة عن اللي ممكن يحصل في الحالة بتاعتي او تنورلي بس هبدأ في الحل منين مثلا و برجع لشرح بقي و كدة لو في function او كدة انا مش فاهم معناها او مش عارف هي الفايدة منها ايه فبروح اشوف بقي دي معناها ايه في الdocumentation و كدة يعني و اوقات تانية تكون حاجة مش هعرف اجيبها من جوجل بس بيكون في مكتبة معينة عارف انها بتنفذ حاجة زي كدة من ضمن امكانياتها فبروح اشوف فين اول الكود بتاعها و اقرأ فيه شوية عشان اعرف هحتاج استخدم منه قد ايه لو هي حاجة مش هعرف اعملها بس بكون فاهم الفكرة نفسها مش بنقلها و بس يعني :D","can_remove":false,"like_count":0,"user_likes":false,"id":"838174932888883"},{"created_time":"2014-10-29T23:14:46+0000","from":{"name":"Aboubakr Gamal","id":"10212365276868126"},"message":"المجال ده متغير باستمرار من الصعب استيعاب كل هذه التكنولوجيا بدون وجود مرجع","can_remove":false,"like_count":0,"user_likes":false,"id":"838175046222205"},{"created_time":"2014-10-29T23:21:51+0000","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"المقال بتاع سكوت وضح ان مشكلة الإحساس ده منتشرة، بس ماوضحليش قوى هل ده معناه ان اللى بنعمله ده صح بالنسبة للlearning curve بتاعنا و هل دى اكفأ طريقة نكتسب بيها اكبر خبرة ممكنة فى الوقت المتبقى لينا ولا لأ.\nهو بيقول انه ممكن نخلى هدف للواحد انه يبرمج فى يوم كامل بدون مايدور فى جوجل و بعد كده يومين وبعد كده ٣ وهكذا، لكن لسة مش موصحلى هاعمل ده ليه؟ هل لأن ده احسن ليا ؟ ولا للشغل ؟ و ليه احسن ؟ مش جوجل بيخلينى اوصل لحل سريع ؟ .\nالموضوع برضه حاسه Opinionated اكتر منه حاجة صح و غلط. :\\","can_remove":false,"like_count":2,"user_likes":false,"id":"838177672888609"},{"created_time":"2014-10-29T23:38:33+0000","from":{"name":"Mohamed Hashem","id":"1387228811341413"},"message":"فعلا متفق معاك  بالنسبه للمقال بتاع سكوت الخاص فرده على استخدام جوجل ولا لا فى انى اللاقى كود معين او انى اكون حافظه \nهى تقريبا نفس الفكره فى انى استخدم editor with autocomplete option or not \nمن ناحيه التعلم وغيره بس انا شايف بمثال بسيط ان لو فاهم if condition كويس  هل هيفرق ان اعرف السنتكس واكتبه مباشره ولا ابحث عنه واكتبه فى حته انى ديفليبور كويس \nبس متفق معاه فى الجزء اللى اعتقد انه قاصده من الاجابه وهو تغيير النمط عموما وانك تحط نفسك تحت ضغط ولما قال انك لازم تمارس حل المشاكل البرمجيه بشكل اسبوعى على الاقل مش مجرد المشاكل الخاصه بالشغل\nبس ف كل الاحوال طالما بتقدر تحل مشكله فده اكيد مفيد وبيدى خبره بغض النظر عن التول اللى بتستخدمها وانك تتعرض لمشاكل وتحلها ده بيخلى عندك حته ان لو قابلتك مشكله ملهاش حل هتقدر تلاقيلها حل بشكل ما  او انك ممكن تعدل على مشكله حد غيرك لاقلها حل \nغير انى انا  مثلا  مبتدئ فلو ما استخدمتش جوجل مع المشاكل اللى بتقابلنى فايه البديل وهاخد وقت كتير لان غالبا ماعنديش الاساس اللى يساعدنى على حلها \nممكن لو انا فى  مرحله متقدمه مثلا افكر فى حل المشكله لمده ولتكن ساعه مش اكتر ملقتلهاش حل دور عليه نفس الطريقه المستخدمه فى التدريب على مسابقه acm مثلا وغيرها Emad Elsaid","can_remove":false,"like_count":0,"message_tags":[{"id":"10154379038212957","length":11,"name":"Emad Elsaid","offset":1092,"type":"user"}],"user_likes":false,"id":"838181492888227"},{"created_time":"2014-10-29T23:38:39+0000","from":{"name":"Ahmed Ezz","id":"10154919378101955"},"message":"ركز علي سينس حل المشكلة لوحدك. دور علي السيتاكس علي جوجل عشان ببساطة مستحيل حد هيحفظ السينتاكس بتاع كل اللغات والفريمووركس وال functions اللي بيشتغل بيها. لما تركز علي حل المشكلة لوحدك الاول ده هينمي اسلوب تفكيرك للأحسن ويخليك problem solver اشطر انما لو هتحفظ الكود مش هتستفيد حاجه الا لو في يوم من الايام ازنقت وحبيت تبرمج في الصحراء  ;)","can_remove":false,"like_count":2,"user_likes":false,"id":"838181529554890"},{"created_time":"2014-10-29T23:41:17+0000","from":{"name":"Moutaz Shams","id":"1647326241951498"},"message":"على حسب هدفك، أنا رأيي إن هدف الانتهاء وتنفيذ المنتج المفروض دايما يسبق في الأولوية هدف تعلم اللغة أو الفريموورك أو الأداة إلا لو كنت بتعمل المنتج بهدف التعلم\n\nوبشكل عام.. بما إن في وقتنا الحالي إتغير حاجتين مهمين جدا وهم إن 1-الأدوات بقت بتتغير وتتطور وتموت بشكل سريع جدا. 2- عدد الأدوات المختلفة اللي بيتكون منها المنتج بقى كتييير جدا وكل أداة فيهم بتتطور وتتغير وتموت بسرعة.. فأصبح من غير المجدي أصلا تعلم الأدوات بالطريقة القديمة ومعرفة تفاصيل عمل كل أداة والخ، لأنها هتتغير أو هتموت على مايدوب تلحق تعرفها، ده حتى فيه أدوات بتتغير أو تموت قبل مايلحقوا يكتبوا الـ documentation بتاعتها.\n\nزي ما مفهوم الذكاء والثقافة إتغيروا عن زمان بعد الانترنت وأصبح \"العلم بالمعلومات\" مش معيار ذكاء ولا ثقافة ولا مهارة - أو مهارة عبيطه - أصبحت المهارة الأجدى والأهم هي مهارة البحث والوصول إلى المعلومات عند الحاجه، فالآن أيضا بيتغير مفهوم مهارة واتقان صنع السوفتوير وكتابة الكود والخ، وماحدش هيقدر يقف قدام التطور الطبيعي ده، ولا ينبغي لأحد أن يخجل إنه بيدور على جوجل على كل مشكلة، دلوقتي \"بيخجل\" بعد كدا هيبقى \"حمار\" وغبي جدا لو ماعملش كدا، كأن واحد مصمم يضرب ويقسم ويجمع بدماغه وخجول من استخدام الآلة الحاسبة","can_remove":false,"like_count":2,"user_likes":false,"id":"838182282888148"},{"created_time":"2014-10-29T23:48:31+0000","from":{"name":"Ahmed Ezz","id":"10154919378101955"},"message":"احنا بنبني فوق خبرات ومشاكل الناس اللي فوقنا، مسيرك في يوم هتقع في مشكلة وتدور عليها في جوجل متلقيش حل ليها، تضظر تتعب فيها وبعد كده تكتبها للناس. اكيد هدفك انهم ميتعبوش زي ما انت تعبت ويوفروا تعبهم في حاجه مش موجوده فعلا. يعني مشكلة بدون حل فعلي ساعتها الحاجه الوحيدة اللي هتفيدهم هو سينس حل المشكلة اللي بيفرق الديف الشاطر عن الديف العادي","can_remove":false,"like_count":2,"user_likes":false,"id":"838184229554620"},{"created_time":"2014-10-30T06:53:03+0000","from":{"name":"Hussein Osman","id":"10212632761719282"},"message":"علي حسب المشكلة لو هتاخد وقت كبير يفضل تدور عليها لو وقت بسيط حلها بنفسك\nكمان مش كل حاجة هتدور عليها هتلاقية فهتضطر تعمل حاجات كتير بنفسك\nوكمان البحث هيديلك اكتر من حل لنفس المشكلة وهيعلمك حلول مكنتش متوقعها وهتعلمك اساليب جديد.  :)","can_remove":false,"like_count":0,"user_likes":false,"id":"838338856205824"},{"created_time":"2014-10-30T07:21:35+0000","from":{"name":"Ahmed Mostafa","id":"10154201769110303"},"message":"انا بحب ادور اكتر عشان ابتدی من حيث انتهی الاخرين .. و طبعا فی الغالب اللی هاتلاقيه مش هايحل المشكله مباشرة بدون تطوير منك و ده بيخليك تتعلم اسرع و اسهل","can_remove":false,"like_count":0,"user_likes":false,"id":"838346142871762"},{"created_time":"2014-10-30T11:54:23+0000","from":{"name":"Mostafa Kasem","id":"1822709031088736"},"message":"انا نفس موضوعك ،، جوجل والدوكس اساسية وانا شغال .. بس اعتقد عادي لاننا بنوصل للمعلومة بسرعة يعني الموضوع ده مش بيعطلنا","can_remove":false,"like_count":0,"user_likes":false,"id":"838441802862196"},{"created_time":"2014-10-30T12:30:04+0000","from":{"name":"Ahmed El-Makawy","id":"1077277359040207"},"message":"ممكن يكون ده الفرق بين الناجح والمبدع يعني لو قبلتك مشكله في كود انت كاتبه وبحثت في جوجل لقيت الحل على طول ده كده احسنلك وفرت وقت وجهد انما لازم تفهم الكود ميبقاش كوبي وبيست علشان تبق استفدت وممكن تعدل عليه وتحسنه وكده انت تبق ابدعت حاجه جديده اللي الموضوع بيدره اللي بياخد كوبي بيست من غير ما يفهم اللي هو نقله فكل شويه هيحتاج ينقله وهو كده مبيتقدمش انما اللي ساعات بيبق عارف الحاجه بس ينقلها للسرعه وتوفير الوقت وتجنب الاخطاء مش هيتضرر انما اللي بينقل من غير ما يفهم حاجه ده هو اللي بيتضرر ومبينميش خبرته","can_remove":false,"like_count":0,"user_likes":false,"id":"838455129527530"},{"created_time":"2014-10-30T12:50:32+0000","from":{"name":"Ahmed El-Makawy","id":"1077277359040207"},"message":"بالنسبه للمقال اللي فهمته من كلامه اننا بنبحث في جوجل ده كده بيقلل منك كمبرمج لان انت مبتبقاش قادر تحل المشكله بنفسك فبيتعامل مع جوجل اكنه عاده سيئه بتبطلها مع الوقت وبتطور من مستواك علشان تقدر تستغنى عنها خالص","can_remove":false,"like_count":1,"user_likes":false,"id":"838462999526743"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZAPRE00TVRjek1qWXlPRGc1TURVd09qRTBNVFEyTWpReU9UST0ZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZAPRE00TkRZAeU9UazVOVEkyTnpRek9qRTBNVFEyTnpNME16ST0ZD"}}}}