{"id":"172338516139198_759831820723195","from":{"id":"682953732","name":"Mohamed Nady"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"picture":"https://scontent-b.xx.fbcdn.net/hphotos-xpf1/l/t1.0-9/s130x130/10341869_711600442237146_4774815823492376356_n.jpg","link":"https://www.facebook.com/photo.php?fbid=711600442237146&set=a.702934269770430.1073741828.702930849770772&type=1","name":"Timeline Photos","caption":"الى موجود معايا فى الصورة ده اسمه Mick Ebeling ده مؤسس مشروع eye writer او eye can الى هوا الاسم الحالى .\nانا ومايك متفقين فى نفس المشكلة ونفس الفكرة ونفس تصميم النضارة بس الفرق ان انا خدت اتجاه وهوا اتجاه هوا بدأ قبلى بفترة على فكرة بس انا كنت متابع كويس هوا وصل لايه . انا هوا بسنتخدم مكتبات معالجة رسومية مختلفة \nالنظام والادوات الى انا كنت بستخدمها \nWindows + OpenCV + EmguCV + Afroge.Net + Pinvoke + VisualStudio by C# \nهوا بقى كان بيشتغل على انظمة ماك بوك وبيتسخدم \nMacOSX + OpenFrameWorks \nاحنا الاتنين دلوقت فى نفس المرحلة من التطوير وواقفين فى نقطة معينه تخص نقطة الــ Calibration \nاحنا الاتنين اعتمدنا على الابحاث الى اتعملت قبل كده فى الموضوع الخاصة بالاجهزة الغالية فى التكلفة \nالملخص انا كنت بستهدف انظمة ويندوز عشان التكلفة وان اجهزة ماك غير متاحة لاغلب الناس وسعرها غالى جدا اما هوا كان شايف ان اجهزة ماك متاحة فى امريكا بشكل كبير \n\nودى الــ Methods الخاصة بالمشروع بتاعى \n1. Input camera \n• AForge.NET framework will be used to access the access USB cameras and send captured video to the system.\n2. Image Processing \n• The captured frame (color images ) will be converted to its greyscale equivalent on the fly. \n• The greyscale image shows the effective brightness or luminance of the color image. \n• Red, green and blue values will be multiplied by 0.3, 0.59 and 0.11 respectively. The sum of the product will be calculated to give the single pixel value, which is greyscale.\n• Haar-cascades will be used to achieve high detection accuracy.\n• Haar-cascades will be used to determine the eye location\n• After having the eye location will be set ROI over the pupil \n• The pixels of that image is stored\n• use a calibration sequence to map the tracked eye pupil coordinates to certain positions onto a computer screen\n• determine which direction the user is looking at\n\n3. Move Pointer \n• SendInput API will be used for synthesizing and sending input leading to mouse motions and clicks.","properties":[{"name":"By","text":"المخترع الصغير","href":"https://www.facebook.com/elm5tr3?ref=stream"}],"icon":"https://fbstatic-a.akamaihd.net/rsrc.php/v2/yD/r/aS8ecmYRys0.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/759831820723195"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/759831820723195"}],"privacy":{"value":""},"type":"photo","object_id":"711600442237146","created_time":"2014-06-05T22:59:35+0000","updated_time":"2014-06-05T22:59:35+0000","likes":{"data":[{"id":"100000599797264","name":"Abdelrhman Saleh"},{"id":"100001019385386","name":"Mohamed S Hamza"}],"paging":{"cursors":{"after":"MTAwMDAxMDE5Mzg1Mzg2","before":"MTAwMDAwNTk5Nzk3MjY0"}}}}