{"id":"172338516139198_1409063649133339","from":{"name":"Ahmed Mansour","id":"10154384274361659"},"message":"ازاي احدد مستوايا اتحسن ولا لا (خلال سنة)في ظل شغل  full time  وبزاكر حاجات تانية  بس خارج الشغل  او مش مستخدمة في الشغل ؟   \nهل بقيسه ع  كمية الtasks اللي بخلصها الهايف منها والمتوسط. والقوي .... ولا نوعية التاسكات نفسها ؟. ولا  كوني ماسك مشروع لوحدي ؟؟ ولا   ايه بالضبط ؟؟ \nولا عدد المشاريع. اللي بقدر أدوس فيها. للعلم ان تقريبا كل واحد فينا. ملهي في مشروع او فيتشر لوحده ..... هل بquality code","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1409063649133339"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1409063649133339"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"status","created_time":"2017-03-04T17:52:39+0000","updated_time":"2017-03-04T20:21:32+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"10212180977704261","name":"Samar Abdelhamid"},{"id":"813211805513341","name":"Mohamed Redaa"},{"id":"2260771094147072","name":"BaHaa Jr."},{"id":"236433770151417","name":"Mohammed Halim"},{"id":"10155255932759736","name":"Ahmed Fathy"},{"id":"1786709881592928","name":"Ahmed Hashem"},{"id":"10155634469686002","name":"Muhammad Saleh"},{"id":"708136489358578","name":"Mohamed Huzien"},{"id":"1689786854371842","name":"Mohammed S. Naoum"},{"id":"10154899131416136","name":"Mera Tag Eldin"}],"paging":{"cursors":{"before":"MTAyMTIxODA5Nzc3MDQyNjEZD","after":"MTAxNTQ4OTkxMzE0MTYxMzYZD"}}},"comments":{"data":[{"created_time":"2017-03-04T18:01:18+0000","from":{"name":"Mera Tag Eldin","id":"10154899131416136"},"message":"F","can_remove":false,"like_count":0,"user_likes":false,"id":"1409068779132826"},{"created_time":"2017-03-04T18:02:50+0000","from":{"name":"Bassam Abd Elhamid","id":"1811475205784288"},"message":"مستواك اتحسن اكيد, بس بنسبة اد ايه معرفش, جرب تعمل انترفيو فى مكان تانى, او جرب تدخل امتحان او شوف مستوى زميل فى نفس الظروف او ..","can_remove":false,"like_count":3,"user_likes":false,"id":"1409069582466079"},{"created_time":"2017-03-04T18:09:35+0000","from":{"name":"سامح دعبس","id":"1873036762957490"},"message":"لو فيه تحديات كل يوم بتقابلها و تتجاوزها يبقى مستواك بيتحسن\nلو كل تاسكاتك بقت سهلة يبقى خد بالك كده بتموت\nلو كل يوم بتتعلم حاجة جديدة يبقى مستواك اتحسن\nاتحسن قد ايه؟ مش عارف.\nبس فكرة إنك تعمل انترفيوهات كتير ظريفة عشان تعرف أنت فين و تكمل اللي ناقصك\nممكن برضو نبص على إعلانات الوظائف اللي طالبة ناس في نفس عدد سنين خبرتك و شوف طالبين ايه و انت تعرف منه أد إيه ممكن تديك مؤشر","can_remove":false,"like_count":6,"user_likes":false,"id":"1409073269132377"},{"created_time":"2017-03-04T18:18:38+0000","from":{"name":"Muhammad Saleh","id":"10155634469686002"},"message":"سؤال كويس جدا\nافتكر ان كان في حد في شركة كبيره مش فاكر اسمه قال ان الواحد خبرته مش بعدد السنين خبرته بجودة السنين اللي قضاها\nيعني من الاخر كده لو انت ف شركة شغلها ممل او شغلها متكرر دايما او حاسس انك مبتتعلمش يبقي نصيحتي افكسلها وشوف غيرها\nودايما نقي الفريق اللي هتشتغل معاه قبل الشركة والمرتب وكل حاجه\n\nيعني ردا علي سؤالك شوف المشاريع اللي انت شغال عليها كبيره وبتعلمك ولا لا\nهل الفريق اللي معاك ناس شاطره وبيضيفولك ولا انت اشطر واحد\n\nلو الحاجات دي تمام يبقي انت اتحسنت\n\nفي بقي مستوي اعلي ف التحسن وهي انك تبقي بتشوف كود ناس من بره كتير وتبقي فاهم هما بيعملوا ايه وليه\nوطريقة الكود والarchitecture وكل حاجه\nبس دي محتاجه وقت طبعا جامد وتركيز ومجهود","can_remove":false,"like_count":11,"user_likes":false,"id":"1409079905798380"},{"created_time":"2017-03-04T18:28:26+0000","from":{"name":"Mohamed Abdelghani","id":"1507583739252185"},"message":"الطبيعي انه مستوي اي ديفلوبر مع الزمن بيتحسن علي الأقل في سرعة الكتابة. مع مرور الوقت وزيادة خبرتك محتاج تغيير نظرتك للكود عن زمان, دلوقتي مع frameworks الجاهزة تقدر تعمل موقع في ساعات مثلا أو برنامج بينفذ الوظيفة ال طالبها منه لكن كخبير محتاج تعرف how your code will behave at low levels مثلا سطر الكود هيكون شكله ازاي في ال memory. مثال تاني معظمنا بيستخدم data structures في اللغة (لغات) ال بيستخدمها بس هل بتستخدمهم عشوائي ولا بتعرف امتي تستخدم كل structure. احنا كديفلوبرز بنستخدم abstractionsلازم نفهم ال details كويس وده بيتطلب منك تعرف data structures & algorithms. علي الأقل الأساسيات. وبصفة عامة الأساسيات ال لازم تكون حاضرة في ذهنك انت وبتكتب code. ده ما يمنعش طبعا تدور علي ال technologies & frameworks ال المفروض أي ديفلوبر في خبرتك يكون عارفها. وأعتقد انك لو بتكتب Readable, Testable, Scalable and Maintainable code. يبقي انت في مرحلة متقدمة.","can_remove":false,"like_count":4,"user_likes":false,"id":"1409086075797763"},{"created_time":"2017-03-04T18:45:36+0000","from":{"name":"Ahmed Mansour","id":"10154384274361659"},"message":"اولا انا بشكر كل الناس اللي ردت واهتمت .... انا مضطر أعلق دلوقتي عشان حتى اللي حيهتم ويرد بعد كده يرد ع نور اكتر ..... اولا بالنسبة للتيم والشركة اللي انا شغال فيها او المفروض معاها .... فاحنا كلنا فريلانسر  بس انا أقلهم خبرة ......   معايا في التيم واحد ماسك مثلا elastic search بعد ما كان السيرش معتمد ع aws بس غيرناه عشان التكلفة  وواحد تاني شغال في machine learning   وواحد شغال في scraping وواحد رابع بيمسك احيانا feature جديدة او تحسين Performance  وعندنا مشروع معمول بال orchard  بس لما حاولت ازاكر ال orchard لقيته حاجة متعبة ومهلكة وأحسن لي اني ازاكر حاجة تانية تنفعني احسن وفعلا زاكرت angular2  .... انا دلوقتي يعتبر ماسك مشروع كامل لوحدي او بخلص 90% من تاسكاته وأحيانا بمسك feature لوحدي تبع ال spirint ..... ده بالنسبة لآخر وضع اما بالنسبة للمقارنة مع شركات اخرى كنت رحت انترفيو .... الinterview technical  شاف ان انا كاتب angular/knockout  وبعض الحاجات الجديدة اللي اتعلمتها من الشركة قام قاللي انا بصراحة قريت حاجات عمري ماسمعت عنها قبل كده وكان بيسالني نفس اسءلة اللي كنت بتسالها لما كنت مفيش خبرة او خبرة سنة مثلا وانا دلوقتي قربت اقفل ٣ سنين خبرة وبصراحة انا لسه مبعتبرش نفسي سنيور بعد ما شفت يعني ايه مستوى سنيور في الفريلانس .... يعني ملخص الكلام انا اتعلمت كتير من الشركة الهولندية والتيم اللي انا معاه سواء تولز بدأت استخدمها او technology  عرفتها او او ...... بس هو التيم ليدر لسه شايف ان مستوايا متحسنش لسه بالدرجة الكافية ..... هل مثلا اذاكر elastic search وادخل مع زميلي او scraping  ولا اكمل مع نفسي وادوس ف angular2 , node ..... ولا ابدا ازاكر TDD  ...... مسارات التحسين كتير ومتشعبة جدا ..... وعايز ع الأقل اكون لما يبقى اسمي سنيور يبقى سنيور ع حق ع الأقل لما يكون داخل ع ٤ سنين خبرة .....","can_remove":false,"like_count":3,"user_likes":false,"id":"1409099592463078"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVFF3T1RBMk9EYzNPVEV6TWpneU5qb3hORGc0TmpVd05EYzUZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVFF3T1RBNU9UVTVNalEyTXpBM09Eb3hORGc0TmpVek1UTTIZD"}}}}