{"id":"172338516139198_832240470148996","from":{"id":"652024918","name":"Amr Eldib"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"I've never setup a Virtual Private Server out in the open on the Internet, and I was wondering how safe it would be?\nI prefer Windows, because it's what I know.\nIt's intended to run all kinds of applications, blog, CMS, Wiki, file sync, photo storage, etc.\nFrom your experience, what safety/security steps I need to pay attention to?\nDoes the security of the server depend on the applications or the OS, or both?","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/832240470148996"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/832240470148996"}],"privacy":{"value":""},"type":"status","created_time":"2014-10-18T03:55:44+0000","updated_time":"2014-10-19T05:53:07+0000","comments":{"data":[{"id":"832241650148878","from":{"id":"1335906613","name":"Muhammad Negm"},"message":"Security depends on both\n\nBut don't buy windows vpns, they're costly with much less options and not to mention security.\nAlternatively check linux boxes on digitalocean","can_remove":true,"created_time":"2014-10-18T04:00:11+0000","like_count":0,"user_likes":false},{"id":"832289046810805","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"If you are looking for affordable host, I've always recommended http://bit.ly/SoftSys\nFrom most hosts, the server is locked down by default. Any OS will be subject to vulnerabilities though, so, make sure you have latest Windows updates (it's OK to have Windows 2008 R2 instead of 2012 R2, might be better actually due to less resources it uses, any OS that's not out of support should be OK).\nYour problem is usually random attacks. Things you can do are removing/disabling accounts with default names like Administrator, etc., changing default port numbers for things like SQL DBMS and FTP / SSH if you use any, making sure things like SQL DBMS do NOT allow remote connections in the first place.\nAlso the application can be a thread. For example, hMailServer uses OpenSSL, so you need the latest version to make sure you don't have OpenSSL hole. WordPress now installs minor/security updates automatically but you always want to check, and maybe even be careful what plugins you use. Apply same rule to similar software packages.","can_remove":true,"created_time":"2014-10-18T06:57:20+0000","like_count":2,"user_likes":true},{"id":"832289066810803","from":{"id":"100003473671632","name":"مروان عبد المنعم"},"message":"if you gonna use digitalocean\nuse this link https://www.digitalocean.com/?refcode=82fa418fbbd6\nthis will give me 25$\nthen i will send you 10$ so you can try it for one month","can_remove":true,"created_time":"2014-10-18T06:57:31+0000","like_count":1,"user_likes":false},{"id":"832320830140960","from":{"id":"658521185","name":"أحمد محمود محمد عبدالوهاب"},"message":"^ lol :D","can_remove":true,"created_time":"2014-10-18T08:49:20+0000","like_count":3,"user_likes":false},{"id":"832725986767111","from":{"id":"100002045429029","name":"Mohamed Alaa El Din"},"message":"Alright, So first why you need a Virtual Private Server? if you are looking to host a blog or something go for: http://hostgator.com otherwise I recommend Linode.com instead of Digital Ocean.","can_remove":true,"created_time":"2014-10-19T02:05:00+0000","like_count":1,"user_likes":false},{"id":"832798310093212","from":{"id":"652024918","name":"Amr Eldib"},"message":"I'm not looking to host just a blog, or any single application. I'm looking to replace a number of online services (that I use every day) with the alternative open source software. The alternatives offer a lot more control and privacy. Plus, if I'm clever enough, I can write some software to integrate these different pieces.\nSome people recommended that I use Linux. That was my original plan. However, I found it very difficult and frustrating to setup Linux.\nI know that this is not everyone's experience. But it was my experience with Linux. It just won't work if I setup a server and move my data there then I run into a problem I can't fix, that would be a big problem.\nSo, Windows it is. I'm a Windows and .NET guy, and despite my reservations on Windows, closed-source software, and the state of Windows right now, it's still a better alternative because I can fix problems when they happen.\nSome future version of me, hopefully, will be clever enough to build this server on Linux.\n\nBack to the original question, I wanna run software like ownCloud, BTSync, Ghost Blog, RSS Reader, social network apps, and more.\nownCloud seem like one application but it can do a lot. Contants, Calender, Notes, ToDo, Pictures, File Sync (like Dropbox), and a lot more.\n\nIs it a lot of effort to do this? Yes.\nHowever, I'm becoming more and more concerned about the ownership of my data online. I'm starting to avoid using services because the benefit of using that service is not worth giving up my data.\nOn the other hand, I'd like very much to have my data available anywhere at anytime. That's where a personal server would help.\nI'm not aware of any complete solution that can address this kind of problem, but I think that there's a need for such a solution. For few dollars a month, you can host your own server. However, there's a lot of technical details to be addressed, and I'm hoping that I'm a good enough sys admin to do this.\nI wrote about this problem before, but no solution became available since. Maybe there's something out there I don't know about.\nHere's the blog post I wrote. Let me know if there's a solution you know of.\nhttp://www.amreldib.com/2012/09/personal-clouds.html","can_remove":true,"created_time":"2014-10-19T04:40:25+0000","like_count":0,"user_likes":false},{"id":"832819726757737","from":{"id":"652024918","name":"Amr Eldib"},"message":"Over this past year (or maybe more), I've collected a list of alternatives to online services. I published that list on GitHub. Here it is:\nhttps://github.com/AmrEldib/AlternativesToOnlineServices","can_remove":true,"created_time":"2014-10-19T05:53:07+0000","like_count":0,"user_likes":false}],"paging":{"cursors":{"after":"WTI5dGJXVnVkRjlqZFhKemIzSTZPRE15T0RFNU56STJOelUzTnpNM09qRTBNVE0yT1RjNU9EYzZMVEU9","before":"WTI5dGJXVnVkRjlqZFhKemIzSTZPRE15TWpReE5qVXdNVFE0T0RjNE9qRTBNVE0yTURRNE1URTZMVEU9"}}}}