{"id":"172338516139198_1207524692620570","from":{"name":"Ahmed Mozaly","id":"10154444669171313"},"message":"عن الفرق بين الاثنين","story":"Ahmed Mozaly shared a link to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"10154444669171313","name":"Ahmed Mozaly","type":"user","offset":0,"length":12}],"41":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":41,"length":14}]},"picture":"https://fbexternal-a.akamaihd.net/safe_image.php?d=AQBnLLfMfLvixZCU&w=130&h=130&url=http%3A%2F%2Fscs-architecture.org%2Fimg%2Fsystem-of-systems-scs.png&cfs=1&_nc_hash=AQAYRWjs1J1jQ-JA","link":"http://scs-architecture.org/vs-ms.html","name":"SCS - Self-Contained Systems - SCS vs. Microservices","caption":"scs-architecture.org","description":"Comparison of microservices and Self-contained Systems (SCS)","icon":"https://www.facebook.com/images/icons/post.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1207524692620570"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1207524692620570"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"link","status_type":"shared_story","created_time":"2016-08-18T12:16:24+0000","updated_time":"2016-08-18T22:35:45+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"1285105998248677","name":"Ahmed Badawy"},{"id":"10155089803254116","name":"Mustafa Gamal"},{"id":"1914753818761647","name":"Ahmed Hosny"},{"id":"10154166371772102","name":"Amr Salah El-din"}],"paging":{"cursors":{"before":"MTI4NTEwNTk5ODI0ODY3NwZDZD","after":"MTAxNTQxNjYzNzE3NzIxMDIZD"}}},"comments":{"data":[{"created_time":"2016-08-18T12:18:01+0000","from":{"name":"Ahmed Mozaly","id":"10154444669171313"},"message":"وديه تجربة عملية بدأت من ال Self Contained Systesm ثم وصلت إلي ال Microservices\n\nhttps://dev.otto.de/2016/03/20/why-microservices/","can_remove":false,"like_count":0,"user_likes":false,"id":"1207525415953831"},{"created_time":"2016-08-18T13:07:38+0000","from":{"name":"Ahmed Hosny","id":"1914753818761647"},"message":"Is it possible to have framework that implement SCS ? I feel like building the system using single framework is against SCS somehow ?","can_remove":false,"like_count":0,"user_likes":false,"id":"1207549855951387"},{"created_time":"2016-08-18T13:12:55+0000","from":{"name":"Ahmed Mozaly","id":"10154444669171313"},"message":"SCS is not about the internal implementation of any system (technics, frameworks or tools) it is about breaking big giant monolith system into multiple self-contained ones\n\nthis is a very good story which can clarify the difference \nhttps://www.innoq.com/en/blog/lvm-roca-vs-spa/","can_remove":false,"like_count":1,"user_likes":false,"id":"1207552289284477"},{"created_time":"2016-08-18T13:15:54+0000","from":{"name":"Ahmed Hosny","id":"1914753818761647"},"message":"Thanks for clarifications","can_remove":false,"like_count":1,"user_likes":false,"id":"1207553802617659"},{"created_time":"2016-08-18T14:23:12+0000","from":{"name":"Muhammad Al Rabbani","id":"436443206686932"},"message":"The problem with throwing these concepts around in my experience has been that there needs to be a lot of background knowledge as well as business knowledge to have even a glimmer of hope of success and it needs an Architecture organization to manage the governance in an enterprise. IN places like Egypt where most enterprises just need an ERP and a web site, this will be over-engineering and will lead to a risk. If you work for a software house and they are developing a system for an Enterprise, then they must have on board Architects with a vision, a transitional architecture and a governance model, and moreover a deep understanding of the business vertical and the concepts of DDD, Enterprise Integration patterns and Solution Architecture. This is non-existant in the vast majority of mid east companies and especially in Egypt,","can_remove":false,"like_count":1,"user_likes":false,"id":"1207593895946983"},{"created_time":"2016-08-18T14:38:07+0000","from":{"name":"Ahmed Mozaly","id":"10154444669171313"},"message":"Anyone in Egypt today, doesn't mean he will be in Egypt tomorrow\n\nWe should not limit our self from knowledge gaining /sharing due to our current context, \n\nWe gain knowledge to change it","can_remove":false,"like_count":3,"user_likes":false,"id":"1207600755946297"},{"created_time":"2016-08-18T17:32:24+0000","from":{"name":"Muhammad Al Rabbani","id":"436443206686932"},"message":"Not against gaining knowledge and I totally hope that IN EGYPT this stuff can be done, the issue is the management of the enterprise has to be mature enough for this. They need to be mature in creating visions, transitions and governance, all of which the vast majority are not, Then come the techies who wonder why the latest group of articles, although they seem totally logical cannot be implemented in their \"applications\", the point I am making is that SOA, Microservices, Reactive Architecture are at the Enterprise Architecture scope and unless that level of oversight and knowledge exists, which in 99.9% of cases (the 0.1% being the ones that might exist) does not exist, then hoping to implement microservices is just a dream or a shot in the dark. You need a strong mature business enterprise, strong mature management, strong mature technical leadership and competent Enterprise Architects, which would have to have at least one leader with real Enterprise Architecture experience. We are also talking about implementations in the millions of dollars, so that rules out all but the very largest Enterprises which might be your cell phone providers and I am sure their Architects come from the mother company.","can_remove":false,"like_count":0,"user_likes":false,"id":"1207728939266812"},{"created_time":"2016-08-18T17:51:13+0000","from":{"name":"Muhammad Al Rabbani","id":"436443206686932"},"message":"I am just clarifying so that when we have dreams and run into this lack of ability to implement what is in the book due to push back from management or an ignorant PM like I have run into multiple times, we understand why. One PM fought my SOA architecture for a system and supported by management thought she could do the work the \"simple way\", a month later she walks in crying to the team saying she failed because she was rejected by the techies at the customer side and 6 months later the project failed, as a repetitive story it helps to understand why that was and why the managers seem so blind, and the real answer to that is lack of experience and knowledge or ignorance in one word, from the techie side, it is lack of business understanding and lack of ability to sell the merits of the Architecture when he is not being taken seriously as just a techie, because in Egypt either you are a techie or a business guy and you can't be both, we get to the point that people display their ignorance or technology to prove they are business people, one of our major misconceptions that has led to paralysis of the IT industry, the hope is for enlightened techies who understand business.","can_remove":false,"like_count":0,"user_likes":false,"id":"1207739552599084"},{"created_time":"2016-08-18T22:35:40+0000","from":{"name":"Abd El Rhman Ahmed","id":"10212005556672538"},"message":"Microservices = Agile Arctechture ,is it  ?","can_remove":false,"like_count":0,"user_likes":false,"id":"1207889669250739"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEl3TnpVeU5UUXhOVGsxTXpnek1Ub3hORGN4TlRJeU5qZA3oZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEl3TnpnNE9UWTJPVEkxTURjek9Ub3hORGN4TlRVNU56UXgZD"}}}}