{"id":"172338516139198_1217646521608387","from":{"name":"Abdel-Rahman Aref","id":"10154635214496713"},"message":"السلام عليكم.. انا لسه داخل مجال البرمجه جديد الاندرويد تحديدا اتعلمت جافا ديسكتوب وداتا بيز وويب جافا  واتعلمت اندرويد وعايز اشتغل فيه بس عايز منكم استشارة لتوضيح الطريق\n\nالاولي هي: -------- انا حاسس اني لو بقيت مبرمج اندرويد فانا هكون حد عادي في مني كتير - وانا عايز اكون متميز فالمجال اللي انا فيه وفي الماشين ليرننج علي سببيل المثال - حفزتني وخلتني ارجع افكر في فكرة كانت في بالي: هو انا ممكن اكون مبرمج اندرويد بس مش كل اللي بيعمله هو تطبيقات تقليدية علي البلاي ستور ولكن بيعمل حاجه ليها قيمه ومتميزة معرفش شكلها ممكن يكون ايه هل مثلا IOT or Augmented Reality, Virtual Reality or NLP applications... ولا في حجات ممكن اتعلمها تخليني حد متميز ينافس الناس اللي بره مصر استخدام الماشين ليرننج في الاندرويد ممكن يبقه شكله ازاي وهيوديني فين في مصر او بره مصر...\n--------------------------\n\n سؤالي التاني: ----------- لو حابب اتعلم ماشين ليرننج.. اسمع  ان عالاقل يكون معاك ماجستير فهل لو روحت قدمت في مكان زي مركز البحوث - بما انه في اسكندرية وانا من اسكندرية - علي الدبلومة هناك وبعدها اخدت ماجستير فالماشين ليرننج هل ده هيكون طريق صح ولا حد ممكن ينصحني بحاجه تانيه بما اني لسه في اول الطريق؟ \nشكرا ليكم مقدماً","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1217646521608387"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1217646521608387"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"status","created_time":"2016-08-29T16:41:16+0000","updated_time":"2016-08-30T09:49:35+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"1411246588948204","name":"Hazem Ahmed"},{"id":"10207971913847864","name":"Mohamed Hagras"},{"id":"1354598764604606","name":"Mohammed Barbary"},{"id":"717287525097404","name":"Nourhan Hamada"}],"paging":{"cursors":{"before":"MTQxMTI0NjU4ODk0ODIwNAZDZD","after":"NzE3Mjg3NTI1MDk3NDA0"}}},"comments":{"data":[{"created_time":"2016-08-29T16:49:14+0000","from":{"name":"Mohammad Fouad","id":"10154777096910845"},"message":"نصيحتى انك تشتغل فى اى شركه بتعمل حاجه من الحاجات اللى بتتكلم عنها (الشركات موجوده فى مصر ومش قليلين) و بعدين بعد ما تفهم الشغل، سنه ولا حاجه و هتبقى عارف تحدد طريقك بنفسك بعد ما تشوف المشاكل اللى بيقابلوها و هم محتاجين ايه و مش محتاجين ايه","can_remove":false,"like_count":6,"user_likes":false,"id":"1217651441607895"},{"created_time":"2016-08-29T20:02:47+0000","from":{"name":"Bassam Abd Elhamid","id":"1811475205784288"},"message":"هو الابلكيشن فكرة , محدش -فى الغالب- بيكون عاوز يعمل فكرة تقليدية, الكل بيبحث عن فكرة جديدة, فكرة حاجه تكون مهمة للناس, لشريحة كبيرة من الناس \n\nلتعلم المشين لايرننج يمكنك مشاهدة احد الكورسات المتوافرة بكثرة على النت, وهذا اظن يكفى لتبداء العمل بها, لفهم اعمق عليك دراسة الاحصاء والجبر الخطى ثم دراسة احد الكورسات او قراءة بعض الكتب عن الماشين لايرننج\n\nتقوم فكرة المشين لايرننج باختصار على اكتشاف المعادلة اوالطريقة التى يمكن بها الوصول لنتيجة ما من معطيات ما من خلال تحليل بيانات سبق جمعها والتى تحتوى على المدخلات والمخرجات\n\nمرحلة الحصول على المعادلة او الطريقة (المودل) تسمى التدريب او التريننج\n\nعملية التريننج تحتاج للكثير من البيانات وكذلك الكثير من المعالجة الامر الشاق على الموبيلات, لهذا ربما تجرى هذه العملية على حاسب شخصى او  ربما سرفرات ذات قدرات اعلى\n\n-على الرغم من وجود مشاريع تقوم بعملية التدريب على الموبيل-\n\nناتج عملية التدريب (الموديل) هو ما يمكن تشغيله على الموبيل فى اغلب الاحيان\n\nمن امثلة تطبيقات المشين لايرننج التى ربما تعمل على الهاتف : التعرف على الصوت او التعرف على الكتابة والوجوه بالصور.\n\nالافكار ليس لها حدود","can_remove":false,"like_count":2,"user_likes":false,"id":"1217774881595551"},{"created_time":"2016-08-29T20:08:42+0000","from":{"name":"Wahed Mn El-Nas","id":"1250163695062116"},"message":"حلو انك تفكر بالشكل ده. بس الماجيستير مش هيديلك المعلومات العملية الكفيلة انك تقدر تشتغل ماشين ليرنينج. \nحاول تشتغل في شركة موبيل أبليكاشنز، من العينة اللي بتتكلم فيها مش تقليدية، وحاول تكتسب الخبرة اللي تخليك تقدر تقوم أبليكاشن محترم، تكون درست شوية نظري وشوية ألجوريثمات عن الماشين ليرنينج - ده رأيي","can_remove":false,"like_count":1,"user_likes":false,"id":"1217778261595213"},{"created_time":"2016-08-29T20:20:58+0000","from":{"name":"Mohammed Barbary","id":"1354598764604606"},"message":"وجهة  نظري يا عبد الرحمن انك تبدأ الاول وتحط رجلك في المجال والسوق الموضوع هيكون مختلف تماما لما تلغوص ايدك بالشغل في حاجات هتوضحلك اكتر وحاجات هتعرف انك كنت بتفكر فيها بطريقة مش مناسبة ابدأ وخليك عادي في الاول وطول مانت بعيد عن ال comfort zone مش هتبقي شخص عادي وبالنسبة لل machine learning وال data science ده تراك طويل وبيحتاج سلسلة كورسات طويلة  موجودين كلهم علي cloudera ممكن تبدأ فيهم in parallel مع شغلك العادي بس اول ما تقف علي رجليك وتبقي واقف علي ارض صلبة في الكارير بتاعك","can_remove":false,"like_count":2,"user_likes":false,"id":"1217784424927930"},{"created_time":"2016-08-29T20:31:26+0000","from":{"name":"Abdel-Rahman Aref","id":"10154635214496713"},"message":"حبيبي يا هندسه... ياريت نشوف معاليك فالعيد عشان نحط حد لسحابة الافكار المتلخبطه دي.. اكيد نازل بقه من غير متقعد تشتم فالمواصلات والصحراوي ...","can_remove":false,"like_count":0,"user_likes":false,"id":"1217792228260483"},{"created_time":"2016-08-29T21:39:32+0000","from":{"name":"Meligy","id":"10154884040385170"},"message":"المجالات اللي فيها ناس كتير، فده يا إما علشان الاحتياج ليهم كتير أو المجال مجدي بأي شكل من الأشكال. المجالات اللي مافيهاش ناس كتير وكمان صعب دخولها في الأغلب هتلاقي الطلب عليها قليل نسيبا (حتى لو فيه طلب وقلة عدد الناس عن حجم الطلب). أنت ممكن تكون في مجال فيه ناس كتير وتكون متميز فيه برده. أغلب اللي في الجروب ده كده.","can_remove":false,"like_count":3,"user_likes":false,"id":"1217834431589596"},{"created_time":"2016-08-30T09:49:32+0000","from":{"name":"Abdel-Rahman Aref","id":"10154635214496713"},"message":"Rami Alamir","can_remove":false,"like_count":1,"message_tags":[{"id":"1416977948367168","length":11,"name":"Rami Alamir","offset":0,"type":"user"}],"user_likes":false,"id":"1218225621550477"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEl4TnpZAMU1UUTBNVFl3TnpnNU5Ub3hORGN5TkRnNU16VTAZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVEl4T0RJeU5UWXlNVFUxTURRM056b3hORGN5TlRVd05UY3oZD"}}}}