{"id":"172338516139198_739811616058549","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"to":{"data":[{"name":"Egyptian Geeks","id":"172338516139198"}]},"message":"the UK government just spent 5.5m GBP on getting extended support for XP :S","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/739811616058549"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/739811616058549"}],"privacy":{"value":""},"type":"status","created_time":"2014-05-01T21:16:56+0000","updated_time":"2014-05-04T11:05:22+0000","comments":{"data":[{"id":"739812262725151","from":{"id":"100006020376039","name":"Mostafa Hussein"},"message":"انا لسة مقرأتش المقال بس مش يمكن دا في حاجة معينة مش المفروض ان الحكومة البريطانية اتجهت للاوبن سورس اصلا ؟","can_remove":false,"created_time":"2014-05-01T21:19:08+0000","like_count":0,"user_likes":false},{"id":"739812292725148","from":{"id":"794574128","name":"Ahmed Adel"},"message":"Not every one on the planet is a geek, and XP is the heaven for normal & underNormal users","can_remove":false,"created_time":"2014-05-01T21:19:11+0000","like_count":0,"user_likes":false},{"id":"741012545938456","from":{"id":"1055914266","name":"Hady Ahmad"},"message":"Has little to do with being a geek or not. XP is not a heaven for an average joe, windows as a platform is generally considered user friendly albeit that's debatable but it has nothing to do with XP being easier to use.\nIt's a policy and a culture commonly attributed to the notion of \"if it works, don't break it\". Last thing a government wants is \n\na) Requesting a budget for a technology infrastructure reinvestment, which involves a senate hearing and a financial committee that must approve this for the next fiscal year. \n\nAny government contract that included XP saw this coming, Microsoft didn't just pull the plug like that. Everyone was aware of the date and time XP would be retiring.\n\nb) Migrating to a new infrastructure usually means tripling your costs, they already have an array of services, databases, terminal clients and softwares known to operate well enough on XP and have been for the past decade or so.\n\nIt also means new contracts, so if the UK companies house bought a database administration tool from a vendor that has it within their contract to offer support for their tool on XP. This calls for a new contract, governments dislike new contracts if it means more costs.\n\nc) In a large organization, employee efficiency is inversely proportional with infrastructure updates. An upgrade almost always means cutting efficiency to half.\n\nLastly, it's just how the world works. The big and old don't jumps ship when a new cool technology hits the block, if your pockets are deep enough, then you likely have a team of risk averse decision makers.","can_remove":false,"created_time":"2014-05-04T10:25:58+0000","like_count":0,"user_likes":false},{"id":"741020585937652","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"My bet is on the existence of some critical software app that doesn't work well with Windows 7 (and most likely IE in particular) and would cost seversl magnitudes of this nimber to rewrite (not to mention time to develop,  and risk of new bugs etc).","can_remove":false,"created_time":"2014-05-04T11:02:33+0000","like_count":0,"user_likes":false},{"id":"741021369270907","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Having looked at the post, seeing the contract gives only one year, I'm starting to think maybr the upgrade is actually planned and they just need some safe time until it takes place. If this is anything more the contract would hsve last much longer","can_remove":false,"created_time":"2014-05-04T11:05:22+0000","like_count":0,"user_likes":false}],"paging":{"cursors":{"after":"NzQxMDIxMzY5MjcwOTA3","before":"NzM5ODEyMjYyNzI1MTUx"}}}}