{"id":"172338516139198_504512476255132","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"عايزين يقطعوا عيشنا\n\nلو هتبتدوا وقفات صدقونى انتم اللى هتخسروا","story":"Mohamed Sameeh Sharaf shared ‎احمد رأفت‎'s event to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"1704851202862067","name":"Mohamed Sameeh Sharaf","type":"user","offset":0,"length":21}],"30":[{"id":"738833149617517","name":"احمد رأفت","type":"user","offset":30,"length":9}],"43":[{"id":"368019856627453","name":"بيان صحفى - ممثلو مجتمع البرمجيات الحرة يطالبون وزير الاتصالات بتنفيذ وعوده","type":"event","offset":43,"length":5}],"63":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":63,"length":14}]},"link":"https://www.facebook.com/events/368019856627453/","name":"بيان صحفى - ممثلو مجتمع البرمجيات الحرة يطالبون وزير الاتصالات بتنفيذ وعوده","caption":"بيان صحفى - ممثلو مجتمع البرمجيات الحرة يطالبون وزير الاتصالات بتنفيذ وعوده","description":"ممثلي مجتمع البرمجيات الحرة يطالبون وزير الاتصالات بإستكمال وعوده بتطبيق سياسات للإنتقال التدريجي الى الاعتماد على البرمجيات الحرة في الحكومة\n \nفي شأن تعاقد الحكومة مع ميكروسوفت\n \nتسببت السياسات الخاطئة للحكومات السابقة في توغل شركة ميكروسوفت وشركات أخرى ذات طابع احتكاري في القطاع الحكومي بحيث أصبحت حلولها التقنية هي البنية التحتية الوحيدة التي تقوم عليها مشاريع قومية استراتيجية هامة مثل مشروع خدمات الحكومة الإلكترونية، مما أدى إلى احتياج الحكومة الدائم لهذه الشركات، واضطرار الحكومة إلى تجديد عقود تراخيص باهظة الثمن لضمان استمرار الخدمات و عمل المرافق الرقمية.\n \nكذلك سمحت الحكومات السابقة لهذه الشركات بالتدخل في مناهج تعليم المعلوماتية في المدارس والجامعات بذريعة تقديم منتجات رخيصة للطلبة، مما أدى إلى أن تصبح العملية التعليمية في مجال التقنية تدريبا على استخدام منتجات تلك الشركات مما يؤدي إلى تخريج أجيال لا تعرف سوى منتجاتها مرادفا لتكنولوجيا المعلومات في حين تتوافر مقابلات حرّة مجانية لا تقل جودة.\n \nبسبب ذلك كلّه وجدت الحكومة الحالية نفسها في مأزق عندما انتهى التعاقد المبرم مع شركة ميكروسوفت بإيجار تراخيص البرمجيات فأصبح من غير الممكن استمرار الحكومة في استخدام البرمجيات في اكثر من 200 ألف حاسوب في هيئات الحكومة المصرية على نحو قانوني.\n \nبتقييم الموقف استنتجت الحكومة الحالية أفضلية المضي قدما في شراء الرُّخص التي كانت تؤجرها خلال المدة السابقة بمبرر أنه أفضل الحلول المطروحة وأقلها تكلفة، حسب تفسير وزير الاتصالات وتكنولوجيا المعلومات المهندس هاني محمود خلال الاجتماع مع ممثلي مجتمع البرمجيات الحرة يوم ٣٠ ديسمبر عقب الوقفة التي تم تنظيمها احتجاجا على موافقة وزارة الاتصالات ورئاسة الوزراء على شروع الحكومة في دفع مبلغ ٢٧٠ مليون جنيه مصري مقابل تراخيص تلك البرمجيات، فيما يراه مجتمع البرمجيات الحرة في مصر إهدارا للمال العام و تضييعا لفرص تحفيز قطاع إنتاجي مصري و عمل اختيارات تقنية غير مناسبة استراتيجيا. حضرت الاجتماع هدى بركة مساعد أول وزير الاتصالات ورئيسة اللجنة الاستشارية لوضع استراتيجية البرمجيات الحرة كما حضره أحمد الحفناوي عضو اللجنة وهيثم نبيل عضو اللجنة ومدير وحدة البرمجيات في وزارة التنمية الادارية ودينا حامد مقررة اللجنة.\n \nحسب الوزير، كان التعاقد الأصلي مع ميكروسوفت من سنة ٢٠٠٩ الى ٢٠١٢ على إيجار تراخيص البرمجيات لا شرائها، مع إمكانية دفع قيمة إيجار سنة ونصف عند نهاية العقد مقابل تملك الرخص. وبناء عليه دفعت الحكومة ٩٠ مليون دولار تقريبا سعر إيجار البرمجيات في السنوات الثلاثة الماضية.\n \nعلى الدوام تسعى ميكروسوفت وشركات أخرى ذات ممارسات احتكارية ألا تفقد المكاسب التي تدرها عليها تعاقداتها القائمة، لذا فإنها تحاول التدخل الآن لتخفيض القيمة و تقديم محفّزات أخرى تضمن استمرار تعاقدها مع الحكومة.\n \nيأتي تحرك ناشطي البرمجيات الحرة لتوضيح أن ما تفعله ميكروسوفت وشركات ذات ممارسة احتكارية منذ زمن بعيد قد ساهم  في الاقتطاع من قوتهم اليومي مقابل برمجيات أقل جودة في حين أن البرمجيات الحرة التي لم يُبحث فيها كبديل لا يتعين دفع مقابل لاستخدامها  و عليه فإن الإنفاق الحكومي فيها يعود على الاستثمار في القدرات البشرية و تحفيز قطاع إنتاجي مصري.\n \nكما يرى النشطاء أن دعم الابتكار و التطوير - بدل الاقتصار على البيع لحساب شركات أجنبية - يؤدي إلى زيادة حصة و وزن مصر في الإنتاج الفكري و المعرفي بدل اقتصار دور الحكومة على كونها حارسة على الملكية الفكرية لصالح شركات أجنبية بموجب اتفاقيات غير عادلة و استمرار نزيف العقول المصرية و تكريس بيئة غير ملائمة للإبداع محليا.\n \nوترى المجموعة أن الحكومة بتصرفها هذا تدفع ثمنا كان قد سبق لها أن دفعته من قبل مقابل استخدام تلك البرمجيات، و هي في مجملها برمجيات قديمة تجاوزتها التقنية، و مع هذا لا تكفل الرُّخصة للحكومة إلا ترقية محدودة من منتجات ذات الشركة مع إغبان حق تحسينها  و تطويرها لملائمة احتياجات الحكومة التي اشترتها، وعليه:\n \n\n    يجب على الوزارة الكشف عن التفاصيل المالية و الفنية للتعاقدات المبرمة مع ميكروسوفت ما شابهها من الشركات المنتجة للبرمجيات ونظم التشغيل غير الحرة (البرمجيات الاحتكارية)، على الأقل بدءا من 2009 الى الآن لتقييمها اقتصاديا و فنيا\n    على الحكومة الإفصاح عن التقرير والتوصيات الخاصة بتقييم بدائل تقنين وضع رخص منتجات ميكروسوفت، التي بني عليها قرار الحكومة في ديسمبر 2012 بشراء الرخص بشكل نهائي\n    ستتخذ المجموعة إجراءات قانونية لوقف التعاقد إلى حين البت في إمكانية تخفيض الاحتياج الى هذا العدد الضخم من رخص الاستخدام، و استبداله كلّه أو بعض منه ببرمجيات حرّة لا يتطلب استخدامها دفع مقابل لتراخيص.\n\n \nبخصوص سياسة الحكومة تجاه البرمجيات الحرة\nتطالب المجموعة وزارة الاتصالات بتفعيل ما سبق لها أن أعلنته من سياسات بشأن مشروعات نظم المعلومات  الحكومية:\n \n\n    الالتزام بإعطاء تطبيقات البرمجيات حرة وضعا تفضيليا فيما لا يقل عن 50% من المشروعات الحكومية\n    الاعلان والالتزام بما وعدت به وزارة الاتصالات من جدول زمني لخطة تدريب للكوادر الحكومية اللازمة للانتقال التدريجي الى الاعتماد على برمجيات حرة تستبدل البرمجيات المغلقة في مختلف تطبيقات القطاعات الحكومية\n    وضع خطة زمنية  للانتقال الكامل إلى الاعتماد على البرمجيات الحرة في مشروعات الحكومة لما في ذلك من ميزات استراتيجية فنية و اقتصادية\n    أن تقوم وزارة الاتصالات فورا - بناء على ما أبدته من استعداد - باعتماد أنظمة تشغيل وبرمجيات حرة  في كل ما يتعلق بتطبيقات سطح المكتب بحيث لا تتطلب إعادة بناء تطبيقات الخواديم فورا، و أن تبدأ وزارة الاتصالات بنفسها كنموذج تنطلق منه التجربة إلى بقية مؤسسات الدولة كما كانت هي الرائدة في مجال تقنية المعلومات الحكومية من قبل.\n    إدارة الممارسة التقنية الحكومية بشفافية لفتح المجال أمام الشركات المصرية ومجموعات المجتمع المدني المهتمة بالبرمجيات الحرة للقيام بدور أساسي في التدريب والتخطيط اللازمين للتحول الى العمل ببرمجيات ذات رخص حرة ومفتوحة المصدر بما يحقق نموا جذريا في قطاع صناعة البرمجيات وحلول تقنية المعلوماتية في مصر بالتحوّل إلى الابتكار و التطوير بدل الاقتصار على البيع لحساب شركات أجنبية\n    إعادة تصميم مناهج المراحل الدراسية المختلفة بحيث يتعلّم الطلبة الأساسيات و المفاهيم بالتطبيق على برمجيات حرة يمكنهم الحصول عليها مجانا بغير الاعتداء على الملكية الفكرية لشركات\n\n \nالمجموعة الناشطة تجمع ممارسين و خبراء في صناعة البرمجيات و أصحاب شركات مصرية و مجموعات مستقلة و منظمات مجتمع مدني و هواة و طلبة يطالبون بالبدء فورا بتطبيق هذه الاجراءات حتى لا نجد نفسنا بعد برهة في نفس المأزق مضطرين لشراء رخص جديدة و إهدار المزيد من الأموال و تضييع فرص النمو.\n \nعلما بأن مجتمع البرمجيات الحرة في مصر مجتمع مزدهر يجمع ما بين القدرات الفنية و الخبرات العملية و الرغبة في تطوير و تقدّم المجتمع كلّه لا القطاع الصناعي فقط، و يظهر ذلك في الأنشطة المتنوعة التي يمارسها المنخرطون في حركة البرمجيات الحُرَّة، ما بين تطوير النظم تجاريا و تصميم الحلول، و الانخراط في مجتمع البرمجيات الحُرَّة العالمي و أنشطته، و تنظيم الأنشطة التعريفية و التوعوية الجماهرية محليا، و زيادة المحتوى التقني باللغة العربية و التدريب، و تطوير المناهج المفتوحة تشاركيا.\n \nالمجموعة التي شاركت في اللقاء مع الوزير عن مجتمع البرمجيات الحرة:\n \nأحمد العزبي - متخصص أمن معلومات وعضو مؤسس في الجمعية المصرية للمصادر الحرة (أوبن ايجبت)  \nعلي شعث - عضو مؤسس في الجمعية المصرية للمصادر الحرة ومؤسسة التعبير الرقمي العربي (أضف)\nشادي سمير - استشاري تقنيات الويب وعضو في مؤسسة التعبير الرقمي العربي (أضف)\nعبدالرحمن غريب - مبرمج حر\nأحمد مكاوي - شركة سبيرولا للأنظمة المتخصصة فى دعم البرمجيات الحرة مفتوحة المصدر\nأحمد طولان - أحد مؤسسى فريق اوبونتو مصر\nافرونيا عازر - التقنيين العرب\nمحمود درويش - تقني\nنادين نعمان - فريق تروس فى الاسماعيلية\nسارة بدوي - فريق تروس فى الاسماعيلية\nاحمد رأفت - عضو فريق أوبونتو مصر الداعي للوقفة امام مجلس الوزراء\n\n\nhttp://www.openegypt.org/%D8%A8%D9%8A%D8%A7%D9%86-%D8%B5%D8%AD%D9%81%D9%89-2\n \n* تجدر الاشارة ان ممثلي مجتمع البرمجيات الحرة كانوا قد نشروا يوم ٢٩ ديسمبر ٢٠١٢ بيان رفضهم قرار مجلس الوزراء بالتعاقد مجددا مع ميكروسوفت، و الإعراب عن دعمهم لتحرك ناشطي البرمجيات الحرة الذين دعوا الى الوقفة أمام مجلس الوزراء. ويعد ذلك القرار أول قرار مع الشركة الاحتكارية منذ اندلاع ثورة ٢٥ يناير. وقد اهتمت وسائل إعلام بهذا التحرك الذي يُظهر قوة مجتمع البرمجيات الحرة في مصر.","icon":"https://www.facebook.com/images/icons/event.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/504512476255132"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/504512476255132"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"event","object_id":"368019856627453","created_time":"2012-12-27T17:43:13+0000","updated_time":"2012-12-28T04:29:30+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"10155924142787586","name":"Ramy Said"},{"id":"1449770371700869","name":"Mohamed El Shorbagy"}],"paging":{"cursors":{"before":"MTAxNTU5MjQxNDI3ODc1ODYZD","after":"MTQ0OTc3MDM3MTcwMDg2OQZDZD"}}},"comments":{"data":[{"created_time":"2012-12-27T17:44:21+0000","from":{"name":"Moutaz Shams","id":"1647326241951498"},"message":"قلة من العيال الشيوعين مأجورين من جوجل وياهو","can_remove":false,"like_count":2,"user_likes":false,"id":"504512876255092"},{"created_time":"2012-12-27T17:45:04+0000","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"hhhhhhhhhhhhhhhhhhhhhhhhhhhh :D","can_remove":false,"like_count":0,"user_likes":false,"id":"504513119588401"},{"created_time":"2012-12-27T17:47:58+0000","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"ياريتهم شيوعين بس دول كمان ليهم علاقة بالشيطان \nاستغفر الله العظيم مش قادر اقولها \"عبدة شيطان\"  وبالدليل   \nhttp://upload.wikimedia.org/wikipedia/en/5/55/Bsd_daemon.jpg\nباعترافتهم باعترافتهم باعترافتهم #عمرو مصطفى ستايل","can_remove":false,"like_count":2,"user_likes":false,"id":"504514279588285"},{"created_time":"2012-12-27T17:49:13+0000","from":{"name":"Moutaz Shams","id":"1647326241951498"},"message":"أيوا طبعا، يعني إيه مصادر مفتوحه يا برادعي؟! يعني مافيش عذريه، يعني كل حاجه تبقى مفتوحه، حتى الغشاء الصيني رافضينه يا جماعه، ده كلامهم هم مش كلامنا إحنا","can_remove":false,"like_count":2,"user_likes":false,"id":"504514786254901"},{"created_time":"2012-12-27T18:02:11+0000","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"اخ معتز احنا ممكن نقول كلامك بشكل أخر \n\n\"انا غير موافق على المصادر المفتوحة لانها لا تعترف بالهولوكوست, الهولوكوست يا جيتس\" :P\n\n\"لا لانظمة تشغيل تفتقد للكراك , الكراك يا بالمر\" :P\n\n\"هل تغيير انظمة التشغيل فى ظل دستور تنعم به البلاد هو طريق للاستقرار ام عبث باقدار البلاد, الويندوز يا Sinosky\" :P\n\nتويتر مليان بلاش نتخانق مع بعض من دلوقتى خلينا لما نخلص منهم وبعد كدا نبقى نقطع بعض :)","can_remove":false,"like_count":1,"user_likes":false,"id":"504518496254530"},{"created_time":"2012-12-27T18:15:00+0000","from":{"name":"Moutaz Shams","id":"1647326241951498"},"message":"هااااتوووولي رااااابط أنا عايز رااابط :P","can_remove":false,"like_count":2,"user_likes":false,"id":"504522039587509"},{"created_time":"2012-12-27T18:41:48+0000","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":":D\nيا اخ معتز انت كدا هتدخلنا فى نفق مظلم \nبقولك هنقطع بعض بعدين \nلا تستهين بقوة هؤلاء فانهم ذئاب وثعالب :)","can_remove":false,"like_count":1,"user_likes":false,"id":"504531696253210"},{"created_time":"2012-12-27T18:42:40+0000","from":{"name":"Mahmoud Magdy","id":"10155021213155645"},"message":"ناس عايشة في البطيخ الموضوع ده اتهرس في ميت بلد قبل كده و لقوه فاشل","can_remove":false,"like_count":1,"user_likes":false,"id":"504531946253185"},{"created_time":"2012-12-27T18:44:33+0000","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"Mahmoud Magdy\nيا هندسة شهادتك مجروحة  انت MVP :D","can_remove":false,"like_count":0,"message_tags":[{"id":"10155021213155645","length":13,"name":"Mahmoud Magdy","offset":0,"type":"user"}],"user_likes":false,"id":"504532496253130"},{"created_time":"2012-12-27T18:45:49+0000","from":{"name":"Mahmoud Magdy","id":"10155021213155645"},"message":"ابدا و الله ، الموضوع ده فعلا اتدرس و فعلا المصادر المفتوحة اغلى ، ده غير انها مش مفتوحة بالمعنى المفتوح و برضوا حتدفع فلوس","can_remove":false,"like_count":0,"user_likes":false,"id":"504533076253072"},{"created_time":"2012-12-27T18:54:32+0000","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"انا بهزر :)\nبس انا عندى سؤال هيا ازاى اغلى ؟؟!!!","can_remove":false,"like_count":0,"user_likes":false,"id":"504535396252840"},{"created_time":"2012-12-27T19:03:10+0000","from":{"name":"Khaled Saleh","id":"10209947277413321"},"message":"Mahmoud Magdy\nطب ياريت بس لو فيه اى link او مصدر للدراسات دى !!؟","can_remove":false,"like_count":1,"message_tags":[{"id":"10155021213155645","length":13,"name":"Mahmoud Magdy","offset":0,"type":"user"}],"user_likes":false,"id":"504537886252591"},{"created_time":"2012-12-27T19:04:42+0000","from":{"name":"Moutaz Shams","id":"1647326241951498"},"message":"هاتلهم رابط يا محمود، وصله لأ، رابط أه، هي الروابط ماتت؟! :P","can_remove":false,"like_count":0,"user_likes":false,"id":"504538756252504"},{"created_time":"2012-12-27T19:06:50+0000","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"Moutaz Shams\nهههههههههههههه :D :D D:","can_remove":false,"like_count":0,"message_tags":[{"id":"1647326241951498","length":12,"name":"Moutaz Shams","offset":0,"type":"user"}],"user_likes":false,"id":"504539302919116"},{"created_time":"2012-12-27T20:06:47+0000","from":{"name":"Mahmoud Magdy","id":"10155021213155645"},"message":"momken tedawar 3ala case study about france gov. moving from open source to MS application to reduce cost, it was great analysis but this is  3-4 years old one. for the reply why it is more expensive, I will reply in details tomorrow.","can_remove":false,"like_count":0,"user_likes":false,"id":"504561922916854"},{"created_time":"2012-12-27T20:22:24+0000","from":{"name":"Khaled Saleh","id":"10209947277413321"},"message":"Mahmoud Magdy\n3-4 years ago !!\n\nانا دورت على حاجه زى كده بخصوص الحكومه الفرنسيه بس طلعلى ده\n\nFrench Prime Minister Jean-Marc Ayrault has issued a missive to French ministers, including a complete action plan urging government usage of LibreOffice and PostgreSQL. But the action plan calls for more. As noted on Slashdot: \"He also wants them to reinvest between 5 percent and 10 percent of the money they save through not paying for proprietary software licenses, spending it instead on contributing to the development of the free software. The administration already submits patches and bug fixes for the applications it uses, but Ayrault wants to go beyond that, contributing to or paying for the addition of new functionality to the software.\"\n\nوده كان فى شهر سبتمبر اللى فات !!","can_remove":false,"like_count":0,"message_tags":[{"id":"10155021213155645","length":13,"name":"Mahmoud Magdy","offset":0,"type":"user"}],"user_likes":false,"id":"504570009582712"},{"created_time":"2012-12-27T22:10:38+0000","from":{"name":"Mohamed Hosney","id":"1380484725323159"},"message":"mozhra 3shan al open source xD gdeeda xD","can_remove":false,"like_count":0,"user_likes":false,"id":"504605786245801"},{"created_time":"2012-12-28T03:34:10+0000","from":{"name":"Mahmoud Magdy","id":"10155021213155645"},"message":"Well, I know that my response might raise a fight, but there is a very important fact to highlight, there is no right or wrong, nor better or best, the good architect always say \"it depends\" , so what might fit for a company might not fit for the other, so the open source argument has been discussed for years, and through my consulting life I visited a lot of companies and enterprises (gov, financials, real estate..etc), and on every company that tried to adopt that open source there was 3 main areas that put the initiative to fail (1) lack of support, (2) lack of expertise, (3) assuming the open source is totally free which is not, I was in RedHat conference that was done earlier this year, RedHat tells you we are open source bla bla bla, but to get updates and to get support you have to pay, and this is where the catch lies beneath, you have to pay something to get another something, I have seen a hall project in a very and I mean it VERY large enterprise where we wanted  to do voice integration with astrisk (we were using Lync), we were able to finish in less than 5 days, for them to configure something in astrisk they didn't know how to do it and they spent 2 weeks trying to figure it out, so they are using opensource product, yes, free yes, but there is a fact that we never measure because the labor is cheap, we don't measure the operations cost, but it is huge in this case, in the mean time, i believe that some industries heavily rely on Linux like telco, factories and some banking areas, but in Egypt, el nas fakra eno kol 7aga b balash, but try to standardize your infrastructure and do proper operations...you will not as simple as it is.","can_remove":false,"like_count":1,"user_likes":false,"id":"504705179569195"},{"created_time":"2012-12-28T04:25:14+0000","from":{"name":"Meligy","id":"10154884040385170"},"message":"While you can upgrade to Windows 8 for less than $100 or sometimes less than $50, if you want to buy a \"reliable\" enterprise-ready edition of Ubuntu, you pay $105-165, as per http://www.ubuntu.com/business/desktop#professional-support-from-the-experts","can_remove":false,"like_count":1,"user_likes":false,"id":"504720669567646"},{"created_time":"2012-12-28T04:27:22+0000","from":{"name":"Mahmoud Magdy","id":"10155021213155645"},"message":"Wallahi mesh mas2alet di bas , let us see the effort that MS did in universities and how they work hard to develop the younger generation, what did red hat do","can_remove":false,"like_count":0,"user_likes":false,"id":"504721822900864"},{"created_time":"2012-12-28T04:27:37+0000","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"it's good that they buy commercial Operating System because if something happen they can demand Microsoft in court but if linux crashed who they will demand? this is the strategy of commercial softwares in General. for some reasons they are better than Open source in terms of Enterprise services.","can_remove":false,"like_count":1,"user_likes":false,"id":"504721916234188"},{"created_time":"2012-12-28T04:29:30+0000","from":{"name":"Mahmoud Magdy","id":"10155021213155645"},"message":"you can pay for what Red Hat Call it (subscription) auh so you don't buy the OS god forbid, you pay for the \"Subscription\" which is good thing","can_remove":false,"like_count":1,"user_likes":false,"id":"504722599567453"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZAOVEEwTlRFeU9EYzJNalUxTURreU9qRXpOVFkyTXpBeU5qRT0ZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZAOVEEwTnpJeU5UazVOVFkzTkRVek9qRXpOVFkyTmpnNU56QT0ZD"}}}}