{"id":"172338516139198_1226294117410294","from":{"name":"Amr Soliman-moustafa","id":"1767344510250418"},"message":"https://www.facebook.com/events/673446812808568/","message_tags":{"0":[{"id":"673446812808568","name":"The Next Evolution of Agile Leadership Roles","type":"event","offset":0,"length":48}]},"story":"Amr Soliman-moustafa shared Agile Egypt's event to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"1767344510250418","name":"Amr Soliman-moustafa","type":"user","offset":0,"length":20}],"28":[{"id":"974880842543439","name":"Agile Egypt","type":"page","offset":28,"length":11}],"42":[{"id":"673446812808568","name":"The Next Evolution of Agile Leadership Roles","type":"event","offset":42,"length":5}],"62":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":62,"length":14}]},"picture":"https://fb-s-d-a.akamaihd.net/h-ak-xpt1/v/t1.0-0/c109.0.130.130/p130x130/14233214_1276610042370516_4285573304898721033_n.png?oh=5273f29f70ee330e28d809f2b94f7673&oe=5927A818&__gda__=1496249823_fe9a7c68cb6a02b3ea743ddbcabba877","link":"https://www.facebook.com/events/673446812808568/","name":"The Next Evolution of Agile Leadership Roles","caption":"The Next Evolution of Agile Leadership Roles","description":"This month's meetup is different! We are hosting Dr. Ahmed Sidky, one of the International thought leaders in agile, who is visiting Egypt for two weeks. Ahmed will share with us his insights about Agile Leadership, and many other topics.  \n\nHere is the Agenda:\n\n• 6:30 - 7:00 Registration\n\n• 7:00 - 7:40 Presentation by Dr. Ahmed Sidky: \"Agile Project Manager, Product Owner and ScrumMaster are all broken - The Next Evolution of Agile Leadership Roles\"\n\n• 7:45 - 8:15 Break\n\n• 8:15 - 9:30 Panel Discussion featuring Agile Academy founders: Ahmed Sidky, Amr Noaman, and Mohamed Amr. \n\nTopic Description: Agile Project Manager, Product Owner and ScrumMaster are all broken - The Next Evolution of Agile Leadership Roles \n\nRiot Games has developed and published League of Legends; an online multiplayer real-time strategy game that has more than 67 million active players per month and 27 million per day. At Riot Games, we have created a framework of explicitly identifying and assigning roles and responsibilities, or “hats” each person might “wear” on a team. \n\nThis framework acknowledges and embraces the fact that everyone has different strengths and weaknesses, and therefore it doesn’t try to fit a person into a predefined role. Instead, it recognises the strength of the team as a whole, and crafts roles to cater to existing team composition. It works within any methodology - it doesn’t matter if you are using Scrum, Kanban or Waterfall. Teams tend to love the framework because it gamifies the discussions, clarifies responsibilities and empowers ownership for the team itself. It makes accountability clear, and also helps think through all aspects of being a high-performing team. \nIn this talk, Ahmed will share the framework and the exercises that attendees can immediately apply with their teams. \n\n\nAbout Ahmed Sidky (Dr. Agile): \n\nAhmed Sidky is a well-known global thought-leader in the Agile community. He combines over 20 years of software development experience with research from his Ph.D. in Agile transformation to help leaders and knowledge workers BE Agile (rather than just \"do\" agile). \nAhmed joined Riot Games in 2014 as Head of Development Management. Prior to Riot, Ahmed worked with a variety of Fortune 100 companies (Verizon, Caterpillar, Nationwide, Booz Allen Hamilton, and many more), guiding their enterprise agile transformations and educating their leaders on using the agile mindset to create lean, high-performing teams and learning organizations. \nAhmed joined Riot Games in 2014 as Head of Development Management. Prior to Riot, Ahmed worked with a variety of Fortune 100 companies (Verizon, Caterpillar, Nationwide, Booz Allen Hamilton, and many more), guiding their enterprise agile transformations and educating their leaders on using the agile mindset to create lean, high-performing teams and learning organizations. \n\nAbout Agile Academy\n\nAgile Academy is a leading organization is Agile training, coaching and consultation in Egypt and the Middle East. Agile Academy is the only accredited organization by the International Consortium of Agile (ICAgile) in the area, and offers over 10 different internationally recognized certifications, as well as coaching, consultation, and Enterprise transformation services in agile software development.\n\nAgile Academy was co-founded by two of the leading contributors to the agile community in Egypt since 2009: Amr Noaman and Mohamed Amr,  with Dr. Ahmed Sidky, as an advisory board member.\n\nFees & Registration\n\nThe meetup is sponsored by Agile Academy and is free of charge. However, the seats are very limited. So, please hurry up and RSVP in the event\n\nRegistration Page \nhttp://www.agileacademy.co/wpgforms/the-next-evolution-of-agile-leadership-roles/","icon":"https://www.facebook.com/images/icons/event.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1226294117410294"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1226294117410294"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"event","object_id":"673446812808568","created_time":"2016-09-08T07:12:14+0000","updated_time":"2016-09-08T07:12:15+0000","is_hidden":false,"is_expired":false}