{"posts":[{"id":"172338516139198_969990133040695","from":{"name":"Akram Mohamed","id":"10208074125083241"},"message":"Hello all, are there any tools out there that help me create a website prototype, like designing all the screens (ui ), make story boards, please share your experience and recommendations.I googled it and found some stuff, wonder if there is a free tool or a tool that you recommend, thanks in advance.","caption":null,"description":null,"created_time":"2015-07-09T09:36:11+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_969478556425186","from":{"name":"Osama Mohamed","id":"1932899953606580"},"message":"Javascript , OOP , Callback , Phonegap\nAny help ?\n\n","caption":"stackoverflow.com","description":"I'm trying to use Phonegap function executeSql to fetch a SQL Query with a select statement , i'm just want to return a query results from my OOP function i read this question Return executeSQL fu...","created_time":"2015-07-08T04:55:22+10:00","total_likes":0,"total_comments":21},{"id":"172338516139198_970144923025216","from":{"name":"Mohammad Tayseer","id":"10154965677956341"},"message":null,"caption":null,"description":"تخيّل ساعي بريد طائر! إنها التكنولوجيا الجديدة التي ستختبرها مؤسسة البريد السويسري هذا الصيف في منطقة سيلاند بكانتون برن. وسيجري تقييم أداء طائرات صغيرة بدون طيار لا تزيد حمولتها عن كيلوغرام واحد لعبور مسافة 10 كلم. وتركز عمليات الإختبار في مرحلة أولى على استخدام هذه الأجهزة في ظروف استثنائية، مثل نقل الأدوية بشكل طارئ، أو إيصال الإمدادات لمناطق أصبحت معزولة بسبب رداءة الأحوال الجوية.","created_time":"2015-07-09T20:13:02+10:00","total_likes":4,"total_comments":2},{"id":"172338516139198_970411109665264","from":{"name":"Mohamed Hashem","id":"1387228811341413"},"message":"HackHands is now part of the Pluralsight.\nHackHands (Instantly connect with a qualified expert and get hands-on help 24/7 ,Sessions start at $1 per minute, with the first five minutes risk free  . many Pluralsight authors will be there too )\n\nPluralsight now includes ( Pluralsight ,  Digital-Tutors, Code School ,HackHands and a cooperation with sqlskills.com )","caption":"blog.pluralsight.com","description":"Whether you’re learning something new or tackling a problem for the first time, it’s inevitable you’ll need some help along the way. That's why we've acquired HackHands, which connects people with qualified mentors in minutes.","created_time":"2015-07-10T12:03:43+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_970460112993697","from":{"name":"Mohamed Moshrif","id":"1235868066468537"},"message":"Hey guys,\n\nI have a question in web application. I dont really have much experience in web app development and I am having a vendor building a portal for me at work and we are facing an issue. I tried most of the solutions I was able to get from google but nothing is working.\n\nThe issue here is that the user would click on a button which would spawn a thread running a processing intensive function that could take up to 15 minutes to complete. At the same time, it would redirect to a different page.\n\nSo We always end up getting ThreadAbortException. We tried to specify \"false\" as the second parameter to the Redirect function and also calling HttpContext.ApplicationInstance.CompleteRequest() but still getting the same issue.\n\nAny suggestions?","caption":null,"description":null,"created_time":"2015-07-10T15:45:14+10:00","total_likes":0,"total_comments":4},{"id":"172338516139198_970559469650428","from":{"name":"Hady Ahmed","id":"10210684524123349"},"message":"Building a lisp while learning C. I mean, it doesn't get any better than that. The book is free to read online and it'll serve as pretty solid introduction to C programming, one that's actually useful.\n\n","caption":"buildyourownlisp.com","description":"If you're looking to learn C, or you've ever wondered how to build your own programming language, this is the book for you.","created_time":"2015-07-10T21:38:26+10:00","total_likes":18,"total_comments":1},{"id":"172338516139198_970675736305468","from":{"name":"Sameh Magdy","id":"1390728197650488"},"message":"Nice article.","caption":"thenextweb.com","description":"Despite its sudden popularity, flat design is not just some fly-by-night trend. It’s a substantial approach to web design that’s rooted in practicality, and necessity. The balance between aesthetics and usability reflected in flat design 2.0 demonstrates that the principles behind the philosophy hav…","created_time":"2015-07-11T04:31:56+10:00","total_likes":5,"total_comments":1},{"id":"172338516139198_969557826417259","from":{"name":"Muhammad Al Rabbani","id":"436443206686932"},"message":"After 4 attempts, the final being upgrading  Virtualbox to the most recent version, I guess things are not looking good for Windows 10, the OS that is supposed to run on many devices.\n\nOf course this is not just a Windows bashing post, so anyone who knows how to get this to work, please enlighten me with your abundant knowledge :)","caption":null,"description":null,"created_time":"2015-07-08T09:39:33+10:00","total_likes":0,"total_comments":25},{"id":"172338516139198_970909209615454","from":{"name":"Meligy","id":"10154884040385170"},"message":"كانت متشيرة عند Eslam Hamouda\nحتى كواحد أعرف testing و TDD و كده، الفيديو و الـ Kata كانوا ممتعين لحد كبير","caption":"youtube.com","description":null,"created_time":"2015-07-11T21:05:20+10:00","total_likes":18,"total_comments":0},{"id":"172338516139198_970921682947540","from":{"name":"Muhammad Saleh","id":"10154774862425379"},"message":"Good day people.\nim new to programming and i have a self study course to choose one programming language and study it apply what ever i can learn and study within 3 weeks.\nthe target is to code an effective Data protection and encrption software.\nseriously i dont have any idea what is this means.\ni have a little knowledge with C language but the one designed for the Embedded system Microcontrollers specially.\nso i would like to ask you \nwhat is available programming language and what is the criteria i use to choose one for my task and how to start with this language?\n\nthank you all for the support\nalso special thanks for Ahmad Alfy","caption":null,"description":null,"created_time":"2015-07-11T22:01:21+10:00","total_likes":1,"total_comments":10}]}