{"posts":[{"id":"172338516139198_805383326168044","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"Good Evening Geeks, i have an idea and i want to analysis it the best way from the tiny details to object oriented classes and modules and connect all together, i want also allow the system to be able to update from the server, to be clear i want some suggestions about analysis and design methodologies that help me to analysis my system from the idea to the implementation and release :)","caption":null,"description":null,"created_time":"2014-08-28T03:46:02+10:00","total_likes":0,"total_comments":9},{"id":"172338516139198_805444879495222","from":{"name":"Muhammad Negm","id":"10212131509466411"},"message":"So Mean.io\nnow are 2 projects one dumb which is the original project\nand the other is smart from the creator of meanjs.\n\nMean.io has plugins\nMeanjs has plugins\n\nThey're not compatible.\nAnyone figured out how to use mean.io plugins to meanjs ?","caption":null,"description":null,"created_time":"2014-08-28T07:03:22+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_805458916160485","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"A while ago, someone in the group asked me on the image optimization and if there is something that can gets integrated in the deploy process. \n\nWell here you go :) #ImageOptimization #performance #Deploy","caption":"addyosmani.com","description":"As we saw a few weeks ago, the weight of an average web page is now almost 1.5MB (median ~1MB), with > 50% of this being images. It's a harsh reminder that many","created_time":"2014-08-28T08:00:02+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_805457376160639","from":{"name":"Meligy","id":"10154884040385170"},"message":"شباب، عايز أضيف Widget لأحر كل post في WordPress. إيه أحسن Plugin أو طريقة للموضوع ده؟\n\n(لو فيه حاجة متجربة - personal recommendation يعني، مش تدوير في العموم) - شكرا جزيلا.","caption":null,"description":null,"created_time":"2014-08-28T07:53:43+10:00","total_likes":0,"total_comments":19},{"id":"172338516139198_805598756146501","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"A comprehensive article on applying the Material Design language to a concept NBA app. https://medium.com/@makeshowlearn/material-design-exploration-nba-scores-aab151d169da – written by @makeshowlearn","caption":"medium.com","description":"Applying the Material Design language to a concept NBA app.","created_time":"2014-08-28T16:27:02+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_805599222813121","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"“Wonderfully creative use of CSS gradients, borders, box-shadows, and generated content.” ","caption":"a.singlediv.com","description":"A CSS drawing experiment to see what's possible with a single div.","created_time":"2014-08-28T16:28:53+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_805605809479129","from":{"name":"Maged Eladawy","id":"1220459164735315"},"message":"Guys, This is just to remind you that today is the deadline for Brainstorming phase and your last chance to upload your idea into our repository.\n\nhttps://www.facebook.com/groups/egyptian.geeks/permalink/803553249684385/","caption":null,"description":"1- BrainStorming   (Deadline 28 of August)\n\nطيب معتقدش إن كان فيه أى اعتراض واضح على الطريقة اللى اقترحتها فى تجميع الأفكار و تنظيمها و إن احنا نبدأ نشتغل عليها\n\nhttps://www.facebook.com/groups/egyptian.geeks/permalink/803137863059257/\n\nعلشان كده أنا شايف إن انا ممكن أبدأ بأول خطوة وهى إن احنا نجمع أفكار و أقتراحات الناس الموجودة فى الجروب بخصوص المشاريع اللى ممكن نشتغل عليها\n\nمتهيألى أنسب حاجة إننا نجمع الأفكارفى Spreadsheet \nعلشان كده انا عملت فورم على السريع  كده\n\nممكن تحط أفكارك هنا \nhttp://bit.ly/1sj8ZbS\n\nتقدر تشوف الأفكار اللى اتحطت من هنا\nhttp://bit.ly/1p4h5S2\n\nأو تقدر تحط افكارك على جيت هب من هنا\nhttps://github.com/egyptian-geeks/Activities/issues\n\nانا شايف إن ٤ ايام مناسب لأى حد إنه يحط أفكارة...لو حد عنده اعتراض على الوقت أو طريقة جمع الأفكار عمتا ممكن يدينا اقترحاتة\n\nSpreadsheet إنشاء الله بعد ما نجمع الأفكار هحط الــ\n هنا فى الجروب و نبدأ نحط طريقة تانية نقيم بيها  الأفكار دى...","created_time":"2014-08-28T17:04:12+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_805607789478931","from":{"name":"Mohamed Nady","id":"10154387282503733"},"message":"The Problem: \nA huge SQL Server database for government sector get grows by huge amount of data every 2 months.\nSo they move the completed transactions to backups every 2 months to make the business solution working fine and faster.\nBut when they try to search or making some business upon old transactions they enforced to extract the old transactions from old backups and move it to production DB.\nThe Question: what is the best solution or way to automatically extend the current SQl Server database to multiple database automatically every period time and the custom business solution can deal with them all.","caption":null,"description":null,"created_time":"2014-08-28T17:13:52+10:00","total_likes":0,"total_comments":8},{"id":"172338516139198_805703156136061","from":{"name":"Amr Monjid","id":"10154967136370729"},"message":"10 Knockout Binding Handlers I Don't Want To Live Without","caption":"tech.pro","description":"Knockout.js is a very powerful library to build interactive web applications in. The creators of knockout tried really hard to keep it as light-weight as...","created_time":"2014-08-28T23:20:27+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_805808369458873","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"code.tutsplus.com","description":"Add a little automation to your life - let's set up a Jenkins instance to handle testing and deploying for us. | Difficulty: Beginner; Length: Medium; Tags: Web Development, Node.js, Web Server, Testing, SSH, Bash, Git, GitHub, DigitalOcean","created_time":"2014-08-29T02:39:42+10:00","total_likes":2,"total_comments":0}]}