{"posts":[{"id":"172338516139198_1039961059376935","from":{"name":"Mohammed Morsi","id":"10212986144227875"},"message":"rezManager - As a restaurant manager this iOS app will help you manage your restaurant reservations and customers with ease - check it out on dribbble ... ","caption":"dribbble.com","description":"As a restaurant manager this iOS app will help you manage your restaurant reservations and customers with ease PRESS L for some love & spread the joy :) Twitter · Instagram · Behance · Website","created_time":"2015-12-03T19:32:40+11:00","total_likes":1,"total_comments":2},{"id":"172338516139198_1039997129373328","from":{"name":"Mostafa Gaber","id":"10155061285088536"},"message":"اخي الكريم اختي العزيزة تحداني مصمم يهودي ان اجمع 200 الف مليون appreciate \nلاخر اعمالي فكن معي ولا تكن معه .... تكبيييير :D :D :D\n","caption":"behance.net","description":"Islamic Challenge BrieflyQuestions Islamic Religious Game for young and old, Summary: it’s very simillar to Who Wants To Be A Millionaire program, player should answer set of questions at a specific time, player when number of dirhams, he can use dirhams…","created_time":"2015-12-03T21:59:22+11:00","total_likes":5,"total_comments":2},{"id":"172338516139198_1039947156044992","from":{"name":"Anas Rabei","id":"621823724675667"},"message":"guys\nDo you use any private wiki app ? if yes, what is it?","caption":null,"description":null,"created_time":"2015-12-03T18:30:53+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1040712002635174","from":{"name":"Hosam Aly","id":"1348336588561390"},"message":"This is an eye-opening session. 45 minutes; strongly recommended.","caption":"skillsmatter.com","description":"Agile Testing & BDD eXchange 2015 conference cast. Kevlin Henney","created_time":"2015-12-05T09:33:02+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1039850366054671","from":{"name":"Ahmad Abdel-Halim","id":"1933903146842707"},"message":"https://devdocs.io/","caption":"devdocs.io","description":"DevDocs is an API documentation browser that combines 60+ docs in a single UI with offline mode, instant search, keyboard shortcuts, and more.","created_time":"2015-12-03T13:11:45+11:00","total_likes":5,"total_comments":1},{"id":"172338516139198_1039614176078290","from":{"name":"Essam A. Hassan","id":"1246324408754353"},"message":"I have a technical question\nsay I have a monthly subscription service that is using an RFID card\n\nwe all know RFID cards can be cloned\n\nnow if someone got a month description and cloned his RFID card to say 10 of his friends\nnow this card is abusing the system and used 10 times instead of one time\n\none solution I got is to limit the usage of the service by location i.e ( you cant use the service in Boston 5mins after using it in San Francisco. and this can be using location logging but it has a problems if the abusers use the service from the same hubs\n\ndo you guys have any other solution to this problem? or is there any best-practice solution to this problem?\nto make the domain slightly specific lets say the service is a Ferry Transportation Service\nFerries can take from 5 mins and upto 30 mins and even an hour in the sea crossing rivers and passing to islands\n\nsorry for the long post :D","caption":null,"description":null,"created_time":"2015-12-02T23:54:26+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1041146112591763","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"My first writing on building strong teams and mistakes often big companies does. Would be super happy if you give it a shot and read it.\n\ncomments and tweets are highly welcome.","caption":"medium.com","description":"Once up on a time in every project you are working on you find ALL the tickets in high priorities.","created_time":"2015-12-06T07:31:48+11:00","total_likes":8,"total_comments":3},{"id":"172338516139198_1041154075924300","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":"انا بحثت قبل كده عن اي برنامج او موقع يساعد المؤسسين في الشركات الناشئة على متابعة نسبة المشاركة بينهم بطريقة ال vesting\n\nطبعا الطريقة دي قانونية ومعتمدة في امريكا مثلا وليها حسابات خاصة... لكن مش موجودة رسميا في مصر واغلب دول العالم... لكن مازال كثير من الشركاء بيفضلوا تطبيق الطريقة دي في المشاركة حتى ولو بشكل ودي وحسابات ابسط بكتير ... وبتتنفذ رسمي بعد انتهاء فترة ال vesting\n\nايه رأيكم لو نعمل برنامج او موقع ينظم الموضوع ده بشكل ودي ومبسط؟\n\nانا كنت عملت اكسل شيت لمشروع من مشاريعي وكان معايا اتنين مؤسسين... واتفقنا ان اجمالي فترة ال vesting تبقى ٢٤ شهر\nوال cliff يبقى بعد ال public beta ب ٣ شهور وهيتحسب كأنه ٦ شهور (يعني كأننا اشتغلنا ٣ شهور تانيين قبل كده.. بغض النظر اشتغلنا اكتر او اقل من كده فعليا).\n\nواتفقنا ان ال sprint يبقى اسبوعين... وكلنا نقيم بعض حسب الالتزام في كل سبرينت من ١٠ نقط كأنها أسهم. (البداية بتكون ان الكل واخد اصفار وده بيخلي المؤسس الأول صاحب الفكرة تبقى نسبته ١٠٠٪)\n\nالمفروض بقى البرنامج او الموقع ده بيطلب عدد المؤسسين والنسبة النهائية لكل واحد فيهم ومدة كل مرحلة... وهو ينظم الموضوع ويطلب تقييم دوري لتحديث توزيع النسبة بين المؤسسين.\n\nطبعا في تفاصيل اخرى فرعية... بس المهم دلوقتي تقييمكم للفكرة عموما ؟\n\n(حاولت ارفق مع البوست ده صورة من شيت الاكسل.. بس ماعرفش ايه المشكلة!)\nهتلاقوا الصورة في اول تعليق وممكن ابعت الملف نفسه في الانبوكس لاي حد يطلبه :)","caption":null,"description":null,"created_time":"2015-12-06T08:03:52+11:00","total_likes":6,"total_comments":3},{"id":"172338516139198_1041107162595658","from":{"name":"Mohamed El-Sayed","id":"10154294518798309"},"message":"Interesting take on the topic..","caption":"lionfacelemonface.wordpress.com","description":"The story of one programmer's journey into, and vehement rejection of, this thing we call \"DevOps\" - lessons learned, sound advice and why you're probably doing it all wrong.","created_time":"2015-12-06T05:38:54+11:00","total_likes":6,"total_comments":4},{"id":"172338516139198_1041573112549063","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"php.net","description":"Despite the fact that PHP 7.0 is a new major version, efforts have been made to make migration as painless as possible. This release focusses mainly on removing functionality deprecated in previous versions and improving language consistency.","created_time":"2015-12-07T07:27:34+11:00","total_likes":3,"total_comments":0}]}