{"posts":[{"id":"172338516139198_717625501610494","from":{"id":"1055914266","name":"Hady Ahmad"},"message":"An unfortunate event happened to my girlfriend this week, they scammed her for DKK 400. Upon inspection, it turns out it was a dark pattern.\n\nThe service offered a 14 days trial for £1. No where on their website do they mention a monthly subscription fee and for how much. No where on their website do they link to a pricing page.\n\nBut get this, it's actually mentioned in their terms of service...  http://jukebux.com/terms.php?lang=uk clause 4\n\nIt's a rare occasion for an average joe computer user to read the terms of service and those who do, rarely understand it.\n\nSo they get your credit card on system, charge you £1. You agreed to the terms of service likely without reading it, TOS mention a EUR/GBP 50 charge upon the trial ending and next thing, you're wondering what happened to your money.\n\nAnyway, that's that. Jukebux, a dark patterns embracer. There's a much more deeper plot behind what actually happened, how they scammed her into getting an account (She didn't knowingly know she was signing up for a Jukebux account) I'm still investigating how this happened.\n\nLesson:\n**Read The Terms Of Service**","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-03-20T14:43:25+03:00","total_likes":0,"total_comments":3},{"id":"172338516139198_717627444943633","from":{"id":"100005533063912","name":"Ahmed Elwerdany"},"message":"أنا نزلت بايثون وكله تمام ,, وأشتغلت إمبارح بالNotepad و cmd عشان أشوف النتائج \nتمام !! \nلما كنت بحفظ الملف اللي انا كتبت فيه الكود كان بياخد شكل النوت باد وعليه بايثون وبيشتغل معايا تمام\nدلوقتي مش بياخد شكل بايثون خالص علي نوت باد ,, ومش بيشتغل علي cmd خالص .. \nإيه الحل !!","caption":null,"description":null,"created_time":"2014-03-20T14:52:07+03:00","total_likes":0,"total_comments":1},{"id":"172338516139198_717694308270280","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"https://www.gnu.org/philosophy/open-source-misses-the-point.html","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-03-20T18:23:32+03:00","total_likes":1,"total_comments":0},{"id":"172338516139198_717695681603476","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-03-20T18:27:27+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_717689821604062","from":{"id":"100003351667804","name":"Mohamed Nasser Amein"},"message":"لو سمجتوا انا محتاج كورس جرافيك سى ++ من البداية خالص عربى او انجلش","caption":null,"description":null,"created_time":"2014-03-20T18:12:38+03:00","total_likes":0,"total_comments":2},{"id":"172338516139198_717592541613790","from":{"id":"661261340","name":"Mohammad Tayseer"},"message":"Given a website URL, search all the links in this website & find dead or problematic links.\n\nUses nodejs","caption":"github.com","description":"dead_links_crawler - Given a website URL, search all the links in this website & find dead or problematic links.","created_time":"2014-03-20T12:39:08+03:00","total_likes":9,"total_comments":1},{"id":"172338516139198_717752368264474","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-03-20T21:03:21+03:00","total_likes":2,"total_comments":3},{"id":"172338516139198_717204088319302","from":{"id":"627907956","name":"Emad Elsaid"},"message":"Worm game in under 50 line of code in ruby\n\ni enjoyed doing this simple game, it is amazing that\nyou can create the games you were playing in your childhood.\n\nthe amazing worm game i were playing on the low-res hand gaming\ndevice, it is simple in design and logic.\n\nfirst you define window dimensions and for the sake of simplicity\ni choose to make it square, also define screen resolution (number\nof squared per vertical/Horizontal line).\n\nyou worm is simple, it consis of number of consecutive pixels,\nand a direction, the screen has a worm part (we call it food)\nworm will move till it hit the part and it joins it to its body\nand the game generates a new food in a random position.\n\nworm movement is restricted to some simple conditions\n* don't get out of the screen\n* don't hit your self\nif any one of these conditions occure then reset the game.\n\nscript was longer than this one i attached i had to compress\nsome lines to suite the image like joining some variables lines\nand join the lines of single line methods this saves 2 lines.\n\nit was a good challenge i hope to be useful as an overall idea\nfor whom of you want to start game development. :)\n\ntry to enhance the script, make it a more awesome game and happy coding :)\n\ngist: https://gist.github.com/9640436","caption":null,"description":null,"created_time":"2014-03-19T15:43:26+03:00","total_likes":3,"total_comments":4},{"id":"172338516139198_717636601609384","from":{"id":"627907956","name":"Emad Elsaid"},"message":"Facebook group hall of fame script\n\nif you're a facebook group admin, and you faced a tiny problem\nof \"who are the active members in my group?\" and want to make\nanalytics about it, here is the magical way.\n\nthis script will find the target group by its name and get the\nlatest posts pages till it reach a certain limit or exceed it\nthen will merge the posts in the form of (user -> count of posts)\nthen sort them descending and show you the group Hall of fame\n\ni usedkoala gem (it is very simple and i used it before alot), \npsych gem to to_yaml, if you prefer you can save it as json or\nany other format, have fun playing with it.\n\nPS: BTW, this song is a little inspiring when you're running the script :D\nhttps://www.youtube.com/watch?v=mk48xRzuNvA\n\nGist: https://gist.github.com/9662408","caption":null,"description":null,"created_time":"2014-03-20T15:25:40+03:00","total_likes":4,"total_comments":10},{"id":"172338516139198_718121821560862","from":{"id":"627907956","name":"Emad Elsaid"},"message":"Print all your facebok liked pages names, URLs and when did you like it\n\nthis is pretty easy, facebook provide us with all your likes\nand when did you like it, the simple problem is it provide it\nas pages so iterate till you get all pages.\n\nFacebook API docs says that each page object has a link attribute\ni thought that was the page link on facebook, then i found that it\nwas always empty, so i formed the URL using the page ID as :\nfacebook.com/:id\n\nthis script was done for a simple purpose, facebook had an issue yesterday\nlots of mages are created in 18th with likes over 700K so i suspected that\nthis is a copy/merge, so i had to write thsi script to get all my pages and\nanother friend pages to see which page is doing that thing.\n\nunforunatily we still didn't figure it out :D\n\nGist: https://gist.github.com/9686717","caption":null,"description":null,"created_time":"2014-03-21T17:03:27+03:00","total_likes":1,"total_comments":0}]}