{"posts":[{"id":"172338516139198_805864422786601","from":{"name":"Hesham Mohamed Eladawy","id":"10154309434427452"},"message":"مشاريع البرمجيات تثير جدلا كبيرا في تسعيرها وتقييمها، ولا يختلف هذا الأمر بين شركة كبيرة وشركة صغيرة ... هي -ان صح فيها الوصف- ملحمة.\nفي ثلاث تدوينات نتحدث تفصيلا عن هذه المحلمة.\n\nفي التدوينة الأولى: نتحدث عن كيفية الأعداد لهذه الملحمة، ما هي المعتقدات التي يجب عليك تبنيها قبل ان تخوض في هذه الملحمة.\nhttp://heshameladawy.blogspot.com/2014/07/softwarepricing1.html\n\nفي التدوينة الثانية: نتناول بعض وسائل وطرق التعامل مع هذه الملحمة، حيث نشرح اهم وانجح طرق التسعير لهذه النوعية من المشاريع.\nhttp://heshameladawy.blogspot.com/2014/08/softwarepricing2.html\n\nفي التدوينة الثالثة: نتناول بعض التكاليف التي يغفل عنها المسئولون عن عملية التقييم والمتعلقة بتفاصيل دقيقة في المنظومة الأدارية للشركة.\nhttp://heshameladawy.blogspot.com/2014/08/softwarePricing3.html\n\nثلاث تدوينات تعرض خلاصة وعصارة خبرة اكثر من 14 عاما في مجال المشاريع البرمجية.","caption":"heshameladawy.blogspot.com","description":"بعض هذه المخاطر يمكن تجنبه باستخدام ال agile contracting methods فهل لديكم خبرات يمكن مشاركتها في هذا المجال؟","created_time":"2014-08-29T04:46:32+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_805965602776483","from":{"name":"Khaled Ramadan","id":"10155975474214478"},"message":"It's amazing book if you would like to know more about Domain-Driven Design\nTackling Complexity in the Heart of Software\nby Eric Evans","caption":null,"description":null,"created_time":"2014-08-29T09:30:39+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_805491519490558","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"ما رأيكم: هل اتقان اللغة الإنجليزية مطلوب لكي تصبح مبرمج قوي؟ (عذراً فأنا أكره كلمة محترف!)\nأنا شخصياً مع هذا الرأي لعدة أسباب:\n1- معظم المصادر المحدثّة في هذا المجال هي بنسبة 99% باللغة الإنجليزية ... لا أقصد أنه لا يوجد مصادر عربية. هي قليلة وان وجدت لا تكون على نفس المستوى المطلوب ولا تكون محدثة.\n2- معظم الأخبار التي تنشرها المواقع التقنية عن تحديثات الأنظمة واللغات البرمجية وما الى ذلك تكون باللغة الإنجليزية\n3- للتواصل مع عتاة البرمجة من خلال منصات التواصل الإجتماعي كـ Twitter و LinkedIn الغير عرب (وهم الرائدون بالطبع) تحتاج إلى اللغة الإنجليزية.\n4- مجموعات النقاش ومواقع الأسئلة مثل Stackoverflow وغيرها تتطلب اتقانك للغلة الإنجليزية. لن أخوض في أمور مثل أننا كعرب قليلا ما نساعد بعضنا وصعوبة وجود مجتمع مثل Stackoverflow ناجح عربي ... هناك محاولة رائدة هي Arabia.io ولكن ينهال عليها كل يوم الاخوة المحبين للمنتديات بالأسئلة التي تعكس الكسل والشخصنة والردود من نوعية مشكوووووووور وتسلم وطلبات البعض حذف مشاركاتهم عندما يضايقهم أحد الأعضاء.\n5- اتقانك للغة الإنجليزية يساعدك على فهم الـ Code الذي تكتبه بشكل أبسط. فمعظم اللغات البرمجية تكتب بإنجليزية بسيطة حتى تكون مفهومة.\n6- 100% من وثائق استخدام المكتبات المختلفة (Documentation) هي باللغة الإنجليزية! كيف ستستخدم هذا المكتبات ولغتك ضعيفة؟\n\nعندما نصبح نحن من نصدر العلوم وقتها نستغنى عن اللغات الأخرى ... أما الأن فلا بديل عنها.","caption":null,"description":null,"created_time":"2014-08-28T10:07:48+10:00","total_likes":12,"total_comments":13},{"id":"172338516139198_805826939457016","from":{"name":"Muhammad Negm","id":"10212131509466411"},"message":"If anyone here is coding in nodejs, angular and any javascript.\n\nGive this a try \nhttp://www.jetbrains.com/webstorm/whatsnew/\n\nworth every penny","caption":"jetbrains.com","description":"The most intelligent Web IDE: JavaScript/CSS/HTML Editor with refactorings, code completion and on-the-fly code analysis","created_time":"2014-08-29T02:53:51+10:00","total_likes":0,"total_comments":9},{"id":"172338516139198_806057356100641","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Is your responsive design working? Google Analytics will tell you: ","caption":"smashingmagazine.com","description":"How WURFL.js and Google Analytics can work together to inform you whether your Responsive Design is working or not.","created_time":"2014-08-29T15:45:37+10:00","total_likes":4,"total_comments":0},{"id":"172338516139198_806154339424276","from":{"name":"Mohamed Nageh","id":"1446382098734984"},"message":"السلام عليكم كنت عايز برنامج يحول من Jar لـ .exe ياريت لو حد جرب قبل كده برنامج كويس يفدني","caption":null,"description":null,"created_time":"2014-08-29T21:53:53+10:00","total_likes":0,"total_comments":14},{"id":"172338516139198_806340999405610","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"إيه هايكون الجديد فى ECMAScript 6 ؟ \nالبريزنتيشن موضح فيتشرز جديد ةفى الsyntax و فى حاجات جاية منلغات مختلفة زى الmultiple assignment فى بايثون و روبى و الScope reservation فى كوفى سكريبت.","caption":"speakerdeck.com","description":"ECMAScript 6: what’s next for JavaScript? (August 2014)","created_time":"2014-08-30T02:34:40+10:00","total_likes":9,"total_comments":1},{"id":"172338516139198_805697296136647","from":{"name":"Omar Ehab","id":"1967017866919592"},"message":"Hi \ni am a beginner in html/css and i want some challenges for them either websites or forums or any challenges?\nThank you","caption":null,"description":null,"created_time":"2014-08-28T22:59:21+10:00","total_likes":0,"total_comments":9},{"id":"172338516139198_806697529369957","from":{"name":"Hadi Salem","id":"10155095516342389"},"message":"Anyone?\n\n","caption":"stackoverflow.com","description":"I'm trying to index a simple document using the elasticsearch gem, index is created successfully but I get a timeout error when I try to index a simple document (LogEntry) after changing the index name although connection to the search server is reachable through other commands, this happens on my p…","created_time":"2014-08-30T18:46:32+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_806821266024250","from":{"name":"Iheb Melki","id":"1025488910918173"},"message":"مواقع لتنسيق الألوان من أجل إنشاء قالب بلوجر إحترافي و تصاميم مميزة :)\n\n","caption":"modawin-blogger.blogspot.com","description":"مدون بلوجر مدونة عربية تقنية هدفها الأول إغناء المحتوى العربي و إيصال المعلومة و نشرها بين العرب لإحتراف التدوين في بلوجر في مقالات و فيديوهات مصورة","created_time":"2014-08-31T01:13:06+10:00","total_likes":0,"total_comments":5}]}