{"posts":[{"id":"172338516139198_900959263277116","from":{"name":"Ibra de Sabry","id":"10207386914465717"},"message":"يا شباب ... الناس اللي ليها في ال Hosting وخصوصا علي Godaddy\nكان عندي هوست ودومين علي IPage ونقلتهم علي Godaddy\nكان في ايميل في ال Host الاولي بس متسجل في Google App Account وبيفتح من ال Gmail عادي ... بعد ما نقلت محتاج اني اعمل ايميلات تانية علي الهوست اللي علي جودادي بس تكون مربوطة علي نفس الدومين\nيعني يكون :\nName1@Site.Com دا الاول اللي موجود علي Google App Account\nو Name2@Site.Com ويكون دا موجودعلي ال Host بتاع Godaddy\nلما بضيف ال MX Record بتاع جوجل وجودادي مع بعض في ال DNS Zone File\nواحد منهم بيشتغل والتاني لا ...\nياريت حد يجيببلي الطريقة او تعديل في الMX Record دا\n\n#Google_MX_Record\n2 @ ALT1.ASPMX.L.GOOGLE.COM \n3 @ ALT2.ASPMX.L.GOOGLE.COM \n4 @ ALT3.ASPMX.L.GOOGLE.COM \n5 @ ALT4.ASPMX.L.GOOGLE.COM \n1 @ ASPMX.L.GOOGLE.COM\n\n#Godaddy_MX_Record\n0 @ smtp.secureserver.net\n10 @ mailstore1.secureserver.net\n\nشكرا مقدما ...","caption":null,"description":null,"created_time":"2015-02-26T11:58:26+11:00","total_likes":0,"total_comments":16},{"id":"172338516139198_902555129784196","from":{"name":"Abanoub Milad Hanna","id":"10212366161653498"},"message":"Is this some kind of spam? I have never heard of any Amazon office in Alexandria!\n\nanother question, do recruiters send job offers arbitrarily on LinkedIn ??","caption":null,"description":null,"created_time":"2015-03-01T14:45:13+11:00","total_likes":6,"total_comments":11},{"id":"172338516139198_902605183112524","from":{"name":"Mohamed Samir","id":"1252844501489402"},"message":"البوست السابق اتمسح من غير تحذير وطبعا من غير اسباب فانا هعتبر انه اتمسح غلط وهكرره بالعربي :D\n\n(بناء على تجربه شخصيه) ياريت حد يرشحلي اي نظام او منصه تصميم مواقع (web design system or platform) تكون بتنجز وصديقه للوقت وبتشتغل على bootstarp وسهله في اضافه وتعديل العناصر (Elements) و اضافه وتعديل الانيميشن وفيها اضافات jQuery كويسه؟\n*مش مهم تكون مدفوعه او مجانيه","caption":null,"description":null,"created_time":"2015-03-01T17:10:56+11:00","total_likes":3,"total_comments":9},{"id":"172338516139198_902891039750605","from":{"name":"Hosam Saad","id":"10158259137365514"},"message":":)","caption":"cloud.google.com","description":"Google Cloud Platform lets you build and host applications and websites, store data, and analyze data on Google's scalable infrastructure.","created_time":"2015-03-02T06:46:30+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_895894427116933","from":{"name":"Ahmad Fatoum","id":"1068666063239339"},"message":"I am sorry, that my first post here is an advertisement, but I hope to contribute in other regards in the future. :)\nOn Stack Exchange's Area51 site, there is a proposal for an Arabic version of Stackoverflow:\nhttp://area51.stackexchange.com/proposals/75879/stackoverflow-in-arabic?referrer=gbXmSaAtgREukUcaptYG1w2\n\nThe proposal needs 33 more comitters for the beta to launch. If you got more than 200 points on a Stack Exchange site and are willing to commit to further this project, please do so!\n\nIf you got any questions or thoughts about the proposal, feel free to ask at the proposal site or here in the comments.\n\nThanks for reading.","caption":"area51.stackexchange.com","description":"Proposed Q&A site for professional and enthusiastic programmers in Arabic. - مقترح إنشاء موقع أسئلة/إجابات للعرب الهواة والمحترفين في البرمجة","created_time":"2015-02-16T20:12:58+11:00","total_likes":4,"total_comments":7},{"id":"172338516139198_902746029765106","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"Every developer should relate :D","caption":null,"description":"#ProgrammerJoke.. #CodeChef\nVia - http://bit.ly/1A03voj","created_time":"2015-03-02T01:24:40+11:00","total_likes":25,"total_comments":8},{"id":"172338516139198_902757636430612","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"ايه رأيكم فى الكلام ده؟ ، فيه حاجة نسيتها؟، حاجة تتحسن، اى مشكلة فى طريقة التفكير دى اصلآ؟ او اى فلسفة مختلفة لأزاى الواحد يبقى فعلآ مبرمج كويس.","caption":"tech-echo.com","description":"هل تريد تعلم البرمجة؟ هل تريد أن تصبح مبرمجا ناجحا لكنك لا تعرف الطريق الصحيح لذلك؟ هذا المقال ينير لك الطريق لتصبح مبرمجا ناجحا","created_time":"2015-03-02T01:53:36+11:00","total_likes":15,"total_comments":14},{"id":"172338516139198_902773036429072","from":{"name":"Bassam Abd Elhamid","id":"1811475205784288"},"message":"انا من الناس الى شايفة البرمجه فن\n\nاذاى , كام وحد عندو ورقة وقلم ويعرف يكتب ومكتبش شئ يستحق القراءة\nكام وحد سهل انه يشترى لوحة واللوان مرسمش حاجه تستحق المشاهدة\nكام واحد ممكن يحمل كومبيل للغة برمجة وكتاب يشرحها مجاناً ومشفناش منه حاجه\n\nالابداع فى انك تستغل او تستخدم الادوات المتاحة فى عمل شئ رائع وهى دى البرمجة بالنسبالى","caption":null,"description":null,"created_time":"2015-03-02T02:30:24+11:00","total_likes":13,"total_comments":3},{"id":"172338516139198_903129149726794","from":{"name":"Tamer Ahmed","id":"10153746998237614"},"message":null,"caption":null,"description":"كيف يكون المستهلك المصري رأيه ؟؟\nالثقافة المصرية وتأثيرها على الشركات الناشئة\n\nهذا البوست هو الثاني في سلسلة تدور حول تأثير ثقافة المجتمع على الشركات الناشئة طبقاً لمؤشرات هوفستيد\n\nالبوست الأول في اللينك التالية\n\nhttps://www.facebook.com/747640815319074/photos/a.764278666988622.1073741831.747640815319074/766303773452778/?type=1&theater\n\nمحسن بيه: ايه اخبار مبيعات الموبايلات الجديده يا رأفت\nرأفت: مش قد كده يا أفندم بعنا 3 أجهزة بس خلال ستة شهور\nمحسن: يااه بس ؟ دي الأجهزة حديثة جداً و بها مميزات و خواص احسن من كل اللي في السوق\nرأفت: حقيقي يا أفندم بس الناس مش مقبلة عليها\nمحسن: يمكن علشان اسعارها عالية ؟\nرأفت: يا أفندم احنا عملنا عليها تخفيضات وصلت 25٪ و بقت أقل من كل اللي في السوق و اقل من معظم الماركات العالمية\nمحسن : طيب عايز أشوف رأي الناس اللي أشترت، رتب لي ميعاد معاهم خلال أسبوع\nرأفت : مش محتاج يا أفندم هما الأثنين شغالين معانا هنا في الشركة\nمحسن: انت مش بتقول 3 أشتروا ؟ \nرأفت: ماهو الثالث يبقى انا يا أفندم علشان بصراحة كلام محروس البياع أقنعني ولقيت ناس معانا أشترت  فأشتريت واحد للمدام.\n\nكيف يقرر المستهلك المصري شراء سلعة استراتيجية مهمة ؟ بداية من تليفونه المحمول و حتى شراء شقة أو سيارة ؟\nالموشر الثاني ضمن مؤشرات جيرت هوفستيد يسمى موشر الأستقلالية او Individualism\nهذا المؤشر بيعبر عن مدى استقلالية الأفراد داخل المجتمع و قدرتهم على العناية بإنفسهم و أفراد عائلتهم في مقابل العناية الجماعية\nكلما زاد رقم البلد على الموشر كان ذلك معبراً علي مجتمع استقلالي يعتمد معظم ساكنيه علي أنفسهم في أمورهم الأساسية بينما الرقم المنخفض يعبر عن مجتمع جماعي التوجه   Collective يعتني فيه المجتمع بالأفراد في مقابل الولاء\n\nما يميز المجتمعات التي بها مؤشر الأستقلالية عالي هو ان افرادها يبحثون دائماً عن المعلومات بأنفسهم (يقرأون و يختارون برامج التلفاز ذات المحتوى الأصيل و الغير تقليدي) ولا يتأثرون كثيراً بأراء من يحيطون بهم بينما الدول ذات المؤشر المنخفض نجد ان رأي المجتمع و الأقارب و اصدقاء العمل يشكل جزءاً كبيراً من قرار أي فرد في المجتمع\nسنجد ايضا ان المؤشر المنخفض يعبر عن حالة كبيرة من الولاء للأسرة او المجتمع أو العمل ونجد ان العلاقة بين الموظف وشركته تشبه العلاقة العائلية حيث يعتبر الموظف نفسه جزء لا يتجزأ من الشركة وسنجد ان الحصول على ترقية  أو التوظيف يتم بقرار يشبه القرارات العائلية من رب الأسرة أو رب العمل في هذه الحالة !!\n\nستجد في المجتمعات  الجماعية ان الشباب تتم تنشئتهم كلهم بنفس الطريقة كي يكونوا متشابهين وستجد ان النغمة السائدة هي (عائلتي بتشكر في فلان و بيقولوا عليه طيب)\nستستمع كثيراً لكلمات من نوعية (الناس بتقول على المنتج الفلاني كويس)\n(الماركة دي حلوة علشان اصحابي في الشغل كلهم بيقولوا كده)\n(جارتي اشترت العربية دي و انا عايزة اجيبها علشان هي أروبة و بتفهم)\nالمجتماعات الجماعية تأخد قراراتها بناءاً على التوجه العام وليس بناءاً على قرارات مدروسة او مميزات حقيقية في أي منتج\nمن يحدد للمستهلك المصري ما يشتريه ؟\nالعائلة - الجيران - المدرسة - الشركة\nمصر تسجل 25 على المؤشر و هذا يعني انها تنتمي للمجتمعات الجماعية التوجه (Collective)\nلكي تبيع في مصر لابد ان ينتمي منتجك لمؤسسة أو كيان ضخم  وبالتالي كلما زاد انتماء المنتج لجهة ما كلما آقبل الناس أكثر على شراؤه\nنظرة على بعض الدول و قيمة الموشر بها تطلعنا على كثير من التمايز و الأختلاف فسنجد مثلاً ان الصين و كوريا الجنوبية هي دول تتميز بمؤشر منخفض يبلغ 20 و 18 على الترتيب و ذلك يظهر في مدى اهتمام تلك الدول بالعلاقات الأجتماعية حتى ان مقياس جمال المرأة في هذا البلاد لا يهتم بشكل الجسد بل يقيس جمال المرأة طبقا لنجاحها في العلاقات الأجتماعية لأن المجتمع يضع الجماعية فوق الفردية و سنجد العكس تماماً في المجتمعات الغربية كأمريكا و المانيا و بريطانيا\nسنجد كذلك ان في المجتمعات الجماعية لا يوجد اي ترابط بين شعورك و سلوكك !!!\nلهذا قد تشتري شيء لا تحبه كثيراً لأن المجتمع يراه مناسباً لك !\nعربية مرسيدس لرجال الأعمال لأنها تضفي عليهم رونقاً خاصاً و لقد قال لي ذات مرة أحد رجال الأعمال المرموقين في مصر انه لابد ان يشتري كل عام آخر موديل مرسيدس حتى لو لم يكن معه المال الكافي و السبب كما قاله لي (لو ما عملتش كده التجار حيفتكروا ان موقعي ضعيف و حأنضرب في السوق !!)\n\nبينما المجتمعات الفردية سنجد ان التصرفات متوافقة في الغالب مع الشعور و الناس لا تحاول اخفاء شعورها وبالتالي فهم يقبلون على اي منتج اقبالاً حقيقيا مرتبطاً بما يمثله لهم من قيمة \n\nسنجد كذلك ان المجتمعات الجماعية الناس قد يبتسمون في وجهك و يكيلون لمنتجك المديح و لكن في وقت الشراء لن تجد ان ابتساماتهم قد تحولت لأوامر شراء بل ربما تجد العكس تماماً وكل من تعامل مع اليابانيين و الكوريين يعلم جيداً انهم قد لا يغضبون امامك بل وقد يبتسمون مجاملة و لكن لو يعجبهم شيء فحتما سيشتكون و ستكون شكوى قاسية (عن تجربة شخصية اثناء عملي كمدير مركز اتصالات يتعامل مع اليابان في احد مراحل حياتي)\n\nستجد ايضا ان المجتمعات الجماعية عندما يكرهون منتج او براند فذلك يسري كالنار في الهشيم و تصبح استعاضة الصورة الأيجابية شيء شبه مستحيل لأن المستهلكون يتأثرون بسرعة و بقوة من أراء اقرانهم (كمثال نظرة الناس للسيارة ال ام جراند في مصر وما تعرضت له من انتقادات حادة افقدتها السوق كنتيجة للدعاية السلبية)\nسنجد ايضاً ان اقبال الناس على المنتجات الأبداعية و المبتكرة يزيد اضطراداً مع زيادة الفردية لأن الناس تعشق الأنفراد بمنتج جديد ونجد ذلك واضحاً في الطوابير الطويلة المصطفة لشراء جهاز الأيفون الجديد في كل مرة امام متاجر أبل في الولايات المتحدة و بريطانيا بينما لا نجد ما يشابه ذلك في بلادنا لأننا ننتظر دائماً أراء اقراننا و معارفنا \n\nهل عندك شك في ذلك ؟\n\nراجع التايم لاين عندك في الفيسبوك و  قم بعد البوستات التي بها صديق لك يسأل الجميع عن المفاضلة بين نوعين أو أكثر من اجهزة المحمول أو السيارات أو حتى اماكن قضاء العطلة \n\nوقم بعد بوستاتك الشخصية حول نفس الموضوع\nوعندها ستذهل !!!\n\nوفي النهاية لا توجد ثقافة صحيحة و اخري غير سليمة و لكننا ننظر على كل ثقافة كمكون رئيسي من مدخلات النشاط الأقتصادي في كل بلاد العالم و نرى ان كل رواد الزعمال لابد ان يدرسوا جيداً ثقافة كل بلد حتى تكون قرارتهم علمية و سليمة بقدر المستطاع\n\nو انتظرونا في البوست القادم حيث نتحدث عن المؤشر الثالث لهوفستيد وهو التنافسية","created_time":"2015-03-02T20:10:05+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_903157923057250","from":{"name":"Muhammad Sabry Abdulwanis","id":"10212106739285334"},"message":"ممكن أسأل حد واجهته مشكلة مع stackoverflow.com اليوم، مش راضى يفتح معايا من الصبح لا علي الـChrome ولا الـFirefox???","caption":null,"description":null,"created_time":"2015-03-02T22:00:19+11:00","total_likes":2,"total_comments":6}]}