{"posts":[{"id":"172338516139198_1406584752714562","from":{"name":"Amr Ali Tealeb","id":"10155204265056336"},"message":null,"caption":"stackoverflow.com","description":"The await keyword in C# (.NET Async CTP) is not allowed from within a lock statement. From MSDN: An await expression cannot be used in a synchronous function, in a query expression, in the ...","created_time":"2017-03-03T02:10:20+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1406043379435366","from":{"name":"Mahmoud El Kotoury","id":"10158236081320537"},"message":"Hello Geeks\nVERY URGENT PLEASE\n\nI have a website hosted on vps on godaddy , the website has a signup process , in the second step of the signup process which has very little amount of fields including only a poster file upload  and 3 other fields , I tried doing the process from egypt it works fine , from several testers accounts , so after that two accounts from Morrocco and Poland tried to go through the signup process but they failed in the second step , (Ajax request i guess because they said it keep saying loading) i tried to check with a friend in Norway and he was able to go through the signup process normally , what should be the problem is it possible that both of them have a connectivity problem ?? I guess not 　 Please any help","caption":null,"description":null,"created_time":"2017-03-02T09:16:51+11:00","total_likes":0,"total_comments":6},{"id":"172338516139198_1406618416044529","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":null,"caption":"ben-evans.com","description":"Where Facebook is surfing user behaviour, Snapchat is trying to create entirely new experiences all the time, around camera, touch and mobile - around what makes mobile different to the PC.","created_time":"2017-03-03T03:10:18+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1406553229384381","from":{"name":"Mahmoud Tantawy","id":"10155099548114764"},"message":null,"caption":"medium.com","description":"by John Graham-Cumming","created_time":"2017-03-03T01:17:32+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1406187112754326","from":{"name":"Tarek Ahmed","id":"10212288208099246"},"message":"كنت مشتري microcontrollers من Aliexpress و ده الtracking بتاع الاوردر، الناس الي جربت Aliexpress قبل كده هل فيه حاجة المفروض اعملها دلوقتي؟، شكرا مقدما.","caption":null,"description":null,"created_time":"2017-03-02T13:35:25+11:00","total_likes":0,"total_comments":6},{"id":"172338516139198_1406367822736255","from":{"name":"Ahmed Badawy","id":"1285105998248677"},"message":"تم الوصول الى اجابة مرضية. لا حاجة للرد بعد الان.. \nشكرا جدا يا شباب... \n\nHello guys... is it possible to send http headers on a request from the frontend. I'm talking a bout normal refresh on the page like going into a link not an ajax request... \n\n& sorry for my ignorance on the http subject...\nOn that matter: whats the best place i can learn how to understand & manage http requests. Share the resources please... \n\nThanks in advance.\n\nتوضيح:\nازى احط header authorization من خلال get request عادى بالضغط على link او form من غير ajax  requests...","caption":null,"description":null,"created_time":"2017-03-02T19:10:17+11:00","total_likes":1,"total_comments":10},{"id":"172338516139198_1406325452740492","from":{"name":"Mostafa Bayumi","id":"10154940062277349"},"message":"ممكن ازاي اعمل حمايه لابليكشن php انه مشتغلتش الا علي الجهاز اللي نازل عليه بس و لو العميل نسخه لاي جهاز تاني مشتغلتش محتاج افكار ازاي اربط الابليكشن بالجهاز علشان العميل مينسخش الكود و يبيعوا لعملاء اخرين","caption":null,"description":null,"created_time":"2017-03-02T17:25:44+11:00","total_likes":1,"total_comments":6},{"id":"172338516139198_1406827366023634","from":{"name":"Ahmed Ateek","id":"1481891938521689"},"message":"For android Devs && terminal users","caption":"github.com","description":"dryrun - :coffee: Try the demo project of any Android Library","created_time":"2017-03-03T07:32:14+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1406900906016280","from":{"name":"Ahmed Ateek","id":"1481891938521689"},"message":null,"caption":"medium.com","description":"As a terminal aficionado I’ve been wanting to write about this topic for awhile.","created_time":"2017-03-03T08:28:01+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1405749259464778","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":"أنا بقالي داخل على سنتين بستخدم Go و من ضمن الحاجات اللي كنت بحسها ناقصه إن مفيش ORM بنفس قوة اللي موجودين في حاجة زي Ruby أو Node و كدة. جربت أستخدم الموجودين و جربت حتى أكتب libraries فوقهم بس الموضوع بيبقي صعب. و لما حد بيسأل تلاقي الcommunity على طول بيفضل الlibraries اللي في الstandard library أو الحاجات الminimal. دول اللي هما بيخليك تexecute raw SQL و بيديك الfunctions اللي محتاجها علشان تmap الresults لstructs و خلاص. طول عمري كنت فاكر إنك تكتب في الكود SQL بإيدك ديه حاجة مش صح أو code smell أو كدة, بس ليه؟ الإجابة بتاعت إحنا ليه محتاجين ORMs كانت بتبقى علشان تكتب protable code بين الdatabases المختلفة (mysql, postgresql,...) بس هو إنت كام مرة بدأت project و غيرت الdatabase في النص؟  هل أصلا الفروق بينهم كبيرة لدرجة إنك محتاج adapter في النص؟ فا السؤال, هل إحنا فعلا محتاجين ORMs؟","caption":null,"description":null,"created_time":"2017-03-02T03:35:59+11:00","total_likes":25,"total_comments":25}]}