{"posts":[{"id":"172338516139198_735064306533280","from":{"id":"100002177522306","name":"Mahmoud Mohsen"},"message":"ايه رأيكوا في موضوع ال big data analytics \nوالموضوع ده ليه شغل في مصر ولا لأ","created_time":"2014-04-22T15:49:42+0000","total_likes":1,"total_comments":3},{"id":"172338516139198_735194919853552","from":{"id":"652024918","name":"Amr Eldib"},"message":"Emad Elsaid's bot/script along with a number of other scripts I'm using now are getting me to wonder about this question:\nWhat platforms/tools are available to store and quickly execute those small scripts? Either on-demand or automatically (scheduled or on-event)?\nOne example is GitHub't Hubot, but it's limited in that it needs a chat room and the scripts I've seen are written in CoffeeScript.\nAny other similar platforms?","created_time":"2014-04-22T21:11:38+0000","total_likes":0,"total_comments":8},{"id":"172338516139198_735423389830705","from":{"id":"100004360301052","name":"Dina Adel"},"message":"Hi,\nwe have a new company ...decided using openerp and we look for sombody used openerp in any projects before .somebody has experience in dealing with openerp helps us with hire (hiring)...\nPlease if any openerp developer can join us in our company even online ... show us any project has done before via this e-mail:\n\nd.elziny@click-group.com.kw\n---------------------------------------\nor in my account on facebook :\n\nhttps://www.facebook.com/profile.php?id=100004360301052\n----------------------------------------\n- our click company in Kuwait .\nThank you","created_time":"2014-04-23T08:11:50+0000","total_likes":1,"total_comments":3},{"id":"172338516139198_735459219827122","from":{"id":"1502874741","name":"Fatma EL-Sayed"},"message":"hi guys,,plz any one can help\n... انا عاوزا اعرف ال submit button \n بيبعت علي فين؟؟\nhttps://www.facebook.com/MothersBrideGroup/app_596549677076405?ref=ts","description":"Old and New mums, we all gather here to share comments, questions, concerns and advice.","created_time":"2014-04-23T10:29:22+0000","total_likes":0,"total_comments":8},{"id":"172338516139198_735488029824241","from":{"id":"826905424","name":"Mohamed Qamar"},"message":"سؤال يا جماعة\nأنا عاوز اعمل setup and deployment project على الدوت نت لبرنامج، البرنامج ده مخصص انه يشغل جهاز معين، الجهاز ده له 2 drivers واحد منهم msi والتاني  exe الفكرة اني بحاول احط التعريفين دول مع البروجيكت ده بحيث اضيف checkboxs dialog في الinterfaces بتاعت الsetup project يبقى فيه 2 checkbox كل واحد فيهم مسؤول عن درايفر من الاتنين دول بحيث يتسطبوا مع البرنامج وهوا بيتسطب، بس انا خبرتي محدودة في الموضوع ده فمش عارف ايه اللي المفروض يتعمل عشان اعمل حاجة زي دي، ودورت في الموضوع ده على النت وما وصلتش لحاجة مفيدة قوي في الموضوع ده، ياريت لو حد يقدر بفيدني في الموضوع ده يبقى كتر الف خيره وجزاكم الله خيرا","created_time":"2014-04-23T12:03:44+0000","total_likes":0,"total_comments":5},{"id":"172338516139198_735491909823853","from":{"id":"627907956","name":"Emad Elsaid"},"message":"ده مقال لDHH بيشرح فيه وجهة نظره عن ليه الTDD based on unit testing كان مشكلة بالنسبة للديزاين بتاع السيستيمز عندهم و ليه هو بيفضل يعمل High level system testing بحاجة زى Capybara","caption":"david.heinemeierhansson.com","description":"Test-first fundamentalism is like abstinence-only sex ed: An unrealistic, ineffective morality campaign for self-loathing and shaming.It didn't start out like that. When I first discovered TDD, it was like a courteous invitation to a better world of writing software. A mind hack to get you going wit…","created_time":"2014-04-23T12:17:04+0000","total_likes":4,"total_comments":4},{"id":"172338516139198_735541713152206","from":{"id":"519195287","name":"Mahmoud Abd El-Fattah"},"caption":"www.sitepoint.com","description":"Even if you've been coding CSS for a while, you probably still come across new stuff all the time. Here are 12 things you might not have been aware of.","created_time":"2014-04-23T14:44:33+0000","total_likes":2,"total_comments":0},{"id":"172338516139198_735687453137632","from":{"id":"100004658621932","name":"Mohamed Fotouh Shalan"},"message":"is there any free software that enable me to write a perfect cv ?","created_time":"2014-04-23T20:49:01+0000","total_likes":0,"total_comments":3},{"id":"172338516139198_735792839793760","from":{"id":"100000193960321","name":"Abdalla Elnaggar"},"message":"بعد اذن صاحب الكومنت \nبس ده فعلا مشكله بتقابل الواحد واظن ان كل المبتدئين اللى زى حالاتى عندهم نفس المشكله انه يشتغل على فكره بجد ويعمل شغل حتى لو الشغل ده مش هيجيب دخل او حتى ينفع يبقى مشروع بكلم عليه بس الواحد هياخد خبره ويتعلم ويستغل وقته \nبس الكسل هو اللى بيمنع وان الواحد بيقول لنفسه ده فكره اى كلام وملهاش لازمه ويحبط نفسه","created_time":"2014-04-24T00:25:03+0000","total_likes":6,"total_comments":1}]}