{"posts":[{"id":"172338516139198_1009372025769172","from":{"name":"Morad Edwar","id":"10212482712403270"},"message":"Anyone here has an experience with securing the APK files? Many tools now can decompile your APKs and return most of the java files and xml files to its original file. I found this tool and I think it worth to buy it if it will work, What do you think??","caption":"guardsquare.com","description":"DexGuard protects your apps from reverse engineering and hacking attacks. It also makes your apps smaller (10% - 70%) and faster (10% - 20%). It starts from the functionality of ProGuard. It is entirely specialized for Android, thus providing stronger features. Above all, it focuses on protecting yo…","created_time":"2015-09-20T23:07:35+10:00","total_likes":4,"total_comments":4},{"id":"172338516139198_1009717615734613","from":{"name":"Farouq Hassan","id":"1168146509961162"},"message":"السلام عليكم ايه احسن سيرفير ممكن ادفع سنوي و ارفع عليه عدد لا نهائي من دومين ؟ شكرا","caption":null,"description":null,"created_time":"2015-09-21T17:30:22+10:00","total_likes":0,"total_comments":8},{"id":"172338516139198_1010401308999577","from":{"name":"Mohamed Dahy Ahmed","id":"10210613941999408"},"message":"We are teaming up\n\nWe are creating an App to help the refugees starting their new lives in germany. This app wil be helping over 800,000 refugees all over germany.\n\nIt is a very simple app to connect the people who need help \"Refugees\" with the people who are willing to help \"Volunteers\"\n\nWe collected the requirement from both sides refugees and volunteers and created an abstract layout for the app\n\nNow we need to create a demo app for the purpose of fund raising and after achieving our target we will continue with the development.\n\nWe are a team of three engineers and looking for other two enthusiastic volunteers s who can share with us  the same mission to ease the refugees lives and belive that,  technology is one of the best means to reach such a goal.\n \nWe need two active team players: \n\n1- An innovative Android developer\n2- A creative Graphic designer (adobe and flash) \n\nI hope you guys can help and may god help us to help those who in need for our help.\n\nThanks!\nDahy","caption":"youtube.com","description":null,"created_time":"2015-09-23T04:09:37+10:00","total_likes":5,"total_comments":4},{"id":"172338516139198_1010490118990696","from":{"name":"Mostafa Kasem","id":"1822709031088736"},"message":"I'm getting (Additionally, a 500 Internal Server Error error was encountered while trying to use an ErrorDocument to handle the request) after about 10 minutes from running my php file, The page has a lot of CURL Requests in it, I have all timeouts and max execution time set to 0 :\n\n@ini_set('max_execution_time', '0');\n@ini_set('max_input_time', '0');\n@ini_set('mbstring.func_overload', '0');\n@ini_set('output_handler', '');\n@ini_set('default_socket_timeout','10');\n@ini_set('memory_limit','512M');\n@set_time_limit(0);\n\nAnd still getting the same error.\n\n* This problem only happened when number of CURL Requests raised means it was working till yesterday and I'm pretty sure the code has nothing wrong with it.\n\nany Ideas ?","caption":null,"description":null,"created_time":"2015-09-23T08:22:22+10:00","total_likes":1,"total_comments":5},{"id":"172338516139198_1010325649007143","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"Hovering over links (contains characters—%%30%30) will cause chrome browser to crash :D :D\nTry hover over this link :D\nhttp://www.stanford.edu/%%30%30","caption":"motherboard.vice.com","description":"Beware of the trees, and the link of death.","created_time":"2015-09-23T00:45:27+10:00","total_likes":9,"total_comments":4},{"id":"172338516139198_1010795555626819","from":{"name":"Hany Essam","id":"1342489319142943"},"message":"This is probably out of the group scoop but hopefully someone can help,\ni used to purchase from the U.S and pay with my Egyptian paypal account, but when making a purchase today they couldn't accept my paypal account, because paypal shipping address is in Egypt, even i will have the order shipped to U.S address.\nملهاش حل دى ؟","caption":null,"description":null,"created_time":"2015-09-24T03:23:55+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1010679315638443","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":"مصلحة :D","caption":null,"description":null,"created_time":"2015-09-23T20:48:55+10:00","total_likes":12,"total_comments":6},{"id":"172338516139198_1011028678936840","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"ghostproxies.com","description":"Embed this infographic in a blog post: Credits: Created by Ghostproxies.com Embed this infographic in a blog …","created_time":"2015-09-24T18:59:14+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1010730142300027","from":{"name":"Islam AbdelMohaimen Hassan","id":"10211887209872216"},"message":"Hi all, this probably is a noob question as I have absolutely no experience in front end work. I'm using 2 libraries in a website, both have a CSS class with the same name which causes a conflict. Is there a way to resolve this conflict other than renaming the class?","caption":null,"description":null,"created_time":"2015-09-23T23:46:18+10:00","total_likes":1,"total_comments":4},{"id":"172338516139198_1011000968939611","from":{"name":"Mohamed Hashem","id":"1387228811341413"},"message":"Full Stack Overflow developers work almost entirely by copying and pasting code from Stack Overflow instead of understanding what they are doing. Instead of researching a topic, they go there first to ask a question hoping people will just give them the result.\n\nUsing something that works immediately, even if you don’t know how it does it, feels better than encountering the frustration of not being able to fix something.\n\nPosting the “one true solution” and winning a thread on Stack Overflow feels great – even if we have no plan whatsoever to come back to it later if it turns out not to be such a good idea any longer as the environment changed.\n\nSo what? Why is it a problem if people are faster and more effective in releasing products?\n\neven stack overflow nooooooooooooooo ,the essay aim's to decrease feast  happiness ,just joking ....","caption":"sitepoint.com","description":"Microsoft's Christian Heilmann explains the disadvantages of being a \"Full Stack Overflow\" developer","created_time":"2015-09-24T16:33:09+10:00","total_likes":5,"total_comments":2}]}