{"posts":[{"id":"172338516139198_984427674930274","from":{"name":"Saad Shahd","id":"1789774944684241"},"message":"[Javascript]: Don't miss that playlist below, Mattias Petter(Front-end developer at Spotify) is talking about Functional programming in JavaScript.\n\nLink: https://goo.gl/x2SM1P","caption":null,"description":null,"created_time":"2015-08-05T08:18:46+10:00","total_likes":6,"total_comments":0},{"id":"172338516139198_983502941689414","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"Hi there , \nI am a senior PHP Developer with 8 yrs Exp.\n\ni was called three days ago for a job interview i did not apply for (they get my resume from some website)\n\ni was asked if i used joomla before and if i write code documentation  .\n\nI told the interviewer that i did not do any previous work with joomla as i always build Platforms and big systems from scratch and Most of the Joomla Bootstapping Core is an added load i do not need specially with big traffic sites ,\n\nthe second question about documentation , i said i never wrote documentation because i was never asked to , but if i would be asked , i can do this as it is a very easy job but a time consuming. \n\nwhen the interview came to the part where i should show him my code and my previous work , he was on a hurry an he just said i will call you .\n\ni really do not know why such people - calling themselves multi national companies - are not estimating the value of our time .. we prepared .. came in time .. postponed our duties .. why ? he could have asked by phone if i used joomla or made documentation before !!\n\nI do not think that all PHP programmers in FACEBOOK co. or Google inc. used joomla or Done the Documentation part before .\n\nwhat do you think ?","caption":null,"description":null,"created_time":"2015-08-03T08:01:12+10:00","total_likes":15,"total_comments":25},{"id":"172338516139198_984431628263212","from":{"name":"Abdelrhman Ibrahim","id":"1433313313345437"},"message":"#3D_printing","caption":null,"description":"نرجع كدا ليوم الحد اللي فات  :3  \nفاكرين اتكلمنا ع ايه ؟ \nطيب جبنا سيرة ايه :3 ؟\nاللي مش فاكر يجي هنا اللينك اهو  :) :\nhttps://www.facebook.com/Simprex.AB3D/posts/135521133450019 \nبس النهارده هنتمعن و ندخل شويه ف دخانينها 8-) ،\n( مبدأياً كدا ال 3D printer بتختلف عن ال printer العاديه ب 180 درجه ،\nالعاديه دي بتطلع ورق و قماش  ... ال 3D printer بتطلع قماش و ورق  :D  )\n\n* 5 جد شويه *\n\nال 3D printer بتعمل نماذج صلبه ثلاثيه الابعاد لل design اللي بندخلها عن طريق برامج الكمبيوتر الخاصه بال design زي برامج الكاد (CAD drawing  ) و عشان تعمل الطابعه design المطلوب لازم يكون ف عمليات مسؤوله انها ترسّيب الماده المُستخدمه ع شكل طبقات لصناعه  design المطلوب منها ،\n\nنيجي ندخل اكتر شويه ف الموضوع :\n\nالالة بتقرأ ال design اللي دخلناه عن طريق الكمبيوتر و بتحوله لمجموعات من الطبقات اللي بتترسب واحده ورا واحده من السائل او المسحوق من الماده اللي بنستخدمها ف الطابعه ، و ال designer بيختار السُمك بتاع الطبقه اللي هيتم ترسيبها ف البرنامج ،\nعشان الالة تفهم ال design اللي دخلها من برنامج الكاد بيبقى ف ملف ف البررنامج بيلعب دور الوسيط بين ال design و برنامج الكاد و اسمه STL file format ، و الملف ده بيبقى فيه شكل تقريبي لل design و شكل الطبقات اللي هتتجمع مع بعض عشان توصل للشكل النهائي design ،\nمعلومه ع الماشي ( كُل ما كان عدد الطبقات اكتر كل ما كان شكل النموذج ادق )\nالطابعه دي تختلف عن الطابعه العاديه ف الوقت كمان :3 ، عشان ال 3D printer بتاخد من ساعات لايام ف انها تطلع النموذج النهائي بس ده بيعتمد ع حجم ال design و نوع الالة و حسب التكنولوجيا المستخدمه فيها .","created_time":"2015-08-05T08:33:52+10:00","total_likes":3,"total_comments":1},{"id":"172338516139198_984474344925607","from":{"name":"Ahmed Ateek","id":"1481891938521689"},"message":"for android developers ,  give it a try :)","caption":"android-developers.blogspot.com","description":"Android 5.0 Lollipop was one of the most significant Android releases ever, in no small part due to the introduction of material design, a new design language that refreshed the entire Android experience. Our detailed spec is a great place to start to adopt material design, but we understand that it…","created_time":"2015-08-05T10:25:35+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_984562558250119","from":{"name":"Anas Rabei","id":"621823724675667"},"message":"Dears \n\nI have two applications one is written in Java and the other is written in Scala. \n\nThe java application is using the Scala application as a library. When I build the java application against JDK 1.8 every thing works fine. \n\nWhen the I build the application against JDK 1.7, the application throw the following exception.\n\njava.lang.UnsupportedClassVersionError: scala/collection/Seq : Unsupported major.minor version 52.0\n\nIt seems that the Scala application is compatible with JDK 1.8 only. \nI tried to change the project compiler settings in the Scala project and set the target JVM into version 1.7 but nothing changed. \n\nAny suggestions to have the application run against JDK 1.7 ?\nMaher Mohamed Gamal Ahmed Abdurrahman Mahmoud Rabie","caption":null,"description":null,"created_time":"2015-08-05T15:46:48+10:00","total_likes":0,"total_comments":3},{"id":"172338516139198_984011468305228","from":{"name":"Yahia Allam","id":"10211631821926466"},"message":"Hey geeks, I have a question..\n\nIf I've developed some project to someone and he asked me for the source code of this project, do I have the right to say no?\n\nAnd what about this scenario in enterprise-to-enterprise situation?","caption":null,"description":null,"created_time":"2015-08-04T09:01:09+10:00","total_likes":1,"total_comments":9},{"id":"172338516139198_984942758212099","from":{"name":"Ahmed Aboshanab","id":"1428673757207009"},"message":"If you already know how to touch-type, but you would like to gain a bit more speed, I think a good resource to do so is:\nhttp://play.typeracer.com/\n\nIt's a platform where you can compete with others and practice your touch typing skills.","caption":"play.typeracer.com","description":"Race against live opponents typing quotes from books, movies, and songs.","created_time":"2015-08-05T23:21:04+10:00","total_likes":6,"total_comments":0},{"id":"172338516139198_984942824878759","from":{"name":"Mahmoud El-bagoury","id":"10158368771420427"},"message":"The Internet of Things (IoT)                                                      Offshoreology.com","caption":"linkedin.com","description":"The Internet of Things is the latest technology generation applied by numerous industries and large companies, through the attachment of such a highly innovative technology to their products.Also industrialized societies increase their level of modernization through the implementation and optimizati…","created_time":"2015-08-05T23:21:26+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_983757831663925","from":{"name":"Anas Rabei","id":"621823724675667"},"message":null,"caption":"thehackernews.com","description":"Windows 10 is stealing users' bandwidth by default. Learn how to disable It","created_time":"2015-08-03T21:13:34+10:00","total_likes":6,"total_comments":17},{"id":"172338516139198_985338334839208","from":{"name":"Osama Ahmed Attia","id":"10155136362742661"},"message":"Related to the workday goals","caption":"stackoverflow.com","description":"If you were to mandate a minimum percentage code-coverage for unit tests, perhaps even as a requirement for committing to a repository, what would it be? Please explain how you arrived at your ans...","created_time":"2015-08-06T19:52:22+10:00","total_likes":5,"total_comments":1}]}