{"posts":[{"id":"172338516139198_1185238138182559","from":{"name":"Ahmed Abo Mazin","id":"1337260053029891"},"message":"هو امتى تكون ال xml بالنسبالى الخيار رقم واحد ك Data Source ؟؟؟ \nيمكن اللى فى دماغى لو فى اكتر من app عاوزيين يكلموا بعض او ينقلوا Data من واحد ل التانى او انى استخدم web service مثلا هل فى حاجة تانية ؟؟؟ لانى لقيت ناس على Stackoverflow بتقول متفكرشى فيها ك DataSource خالص  \nالحاجة التانية هل فى حد اتعرض فى شغلة انه يكتب Scheme لملف xml مثلا ب XSD او DTD ؟؟؟ انا متعلمهم بس عمرى متعرضت لحد فيهم اقصى حاجة عملتها xml parsing او انى استخدم xml فى Configuration file للموقع بتاعى  كل الموضوع تاجات وبتتقفل حتى فى الاندرويد بتعامل مع ال Json فى ال Parsing","caption":null,"description":null,"created_time":"2016-07-20T03:59:39+10:00","total_likes":1,"total_comments":3},{"id":"172338516139198_1185173768188996","from":{"name":"Mohamed Redavich Eldehiry","id":"10158341490285392"},"message":"I honestly do not know whether this should be in here or the other jobs group. I am not hiring myself so I'll leave it here unless told otherwise by admins.\n\nIf you would be interested in a devOps position in Amazon Dublin or Australia, contact me for referral.","caption":null,"description":null,"created_time":"2016-07-20T02:07:45+10:00","total_likes":2,"total_comments":4},{"id":"172338516139198_1185388134834226","from":{"name":"Ahmed Elmasarany","id":"1471406669538614"},"message":"سلام عليكم شعب ال Geeks الكرام \nشغال على بروجيكت والمفروض انى اخلى اليوزر يدخل اللون اللى هوا عايزه فى الداتا بيز وانا اجيبها من الداتا بيز احطها فى فايل ال CSS\nحولت امشى على اللى هنا -> https://css-tricks.com/css-variables-with-php/\nضربلى البروجيكت كله \nحد عنده حل للموضوع ده ؟\n#php #mysql #sequential_code","caption":null,"description":null,"created_time":"2016-07-20T08:52:46+10:00","total_likes":1,"total_comments":6},{"id":"172338516139198_1183718565001183","from":{"name":"Ramy Raoof","id":"10154199052222651"},"message":"SSL Interruptions: good evening fellows, some of you might be aware/suffering from SSL-connections drops/interruptions. There are different problems reported among technical communities in Egypt over the past 9 days revolving around targeting SSL connections (VPNs targeting, packet drops, ssl mail server fail..etc). One clear thing is lack of understanding as we don't have a consistent pattern to talk about (examples of interruption include different IPs targeting, ISPs, mix of blocking techniques) and i cant tell for sure what is going on. I have seen and spoke with ppl who are going through total VPN-drops, frequent ssl-mail-server fail..etc and some companies/institutions have total vpn failure for the last 48hrs till now. Basically there are different difficulties related to secure connections but no solid explanation yet and no hint what is going on.. the general sense of course is SSL interception either by MITM-server or DPIs but no any sort of evidence so far. I thought of bringing it up here so we can share our problems we are going through and maybe our collective problems help in reaching a pattern to understand and hopefully resolve it, and maybe any of you can share a possible explanation. Thank you.","caption":null,"description":null,"created_time":"2016-07-17T23:33:24+10:00","total_likes":25,"total_comments":14},{"id":"172338516139198_1185604244812615","from":{"name":"Anas Rabei","id":"621823724675667"},"message":"SA, \nDoes anyone know how to download the youtube videos subtitles (closed caption)? \nI tried some command line tools like youtube-dl and youtube2srt but unfortunately it does not work with all of the videos.\nFor example the video in this link (https://www.youtube.com/watch?v=qmWCT_OgrKQ) contains closed caption but both youtube-dl and youtube2srt say the video does not have subtitle.\nCan anyone at least explain why these tools can not download the subtitles from such videos? Is it a restriction set by the video owner or what?","caption":null,"description":null,"created_time":"2016-07-20T18:37:39+10:00","total_likes":1,"total_comments":3},{"id":"172338516139198_1184330148273358","from":{"name":"Eman Herawy","id":"10211603339696724"},"message":"صباح الخير \nممكن  لو حد اخد دبلومة علوم الحاسب بمعهد الدراسات والبحوث  الإحصائية  بجامعة القاهرة  يفيدنى بتجربته فيه ؟! ... كانت  مفيده او لا ؟! ..  فرقت معاه فى حاجه ؟! .. انا من الزقازيق  فصعب انى انتظم ف الحضور  .. هل ده هيأثر ؟! .. وهل  حوار ان نسبة الحضور لا تقل عن 75 % ده .. مجرد كلام ولا  فيه تدقيق شديد ع الحضور  \n؟!  ... بالنسبة لى في صعوبات كتير  بحاول احلها فى سبيل الدبلومه دى .. فمش عاوزه فى الاخر  .. يطلع على مفيش واطلع حاجه متستهلش و الاستفاده تبقى تعبانه  .","caption":null,"description":null,"created_time":"2016-07-18T22:23:30+10:00","total_likes":3,"total_comments":1},{"id":"172338516139198_1185726174800422","from":{"name":"Islam Azab","id":"10154876688426014"},"message":"Is there anyone here wokring Facebook Engineering ?","caption":null,"description":null,"created_time":"2016-07-20T23:19:37+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1185738661465840","from":{"name":"Ibrahim Mohammed","id":"1726284604348944"},"message":"General question that i hope it's not permitted and also hope that this doesn't sound stupid but i'm almost fed up!\nhow can a freelancer without any full-time job get an actual stable job ?, maybe to narrow the answers possibilities my main concern is about how to implement your portfolio page into your cv ?","caption":null,"description":null,"created_time":"2016-07-20T23:46:10+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1185769781462728","from":{"name":"Mohamad Emad","id":"1118459391596579"},"message":"How can I store, read and extract a file into a postregsql db and how can I extract the db as a single .db file \nPS:: I Googled my question but I just don't get the answers so it would be helpful if someone can explain it in plain English \nThanks in advance.","caption":null,"description":null,"created_time":"2016-07-21T00:55:15+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1185771548129218","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Image server toolkit in Go","caption":"github.com","description":"imageserver - Image server toolkit in Go","created_time":"2016-07-21T01:00:08+10:00","total_likes":1,"total_comments":0}]}