{"posts":[{"id":"172338516139198_991856727520702","from":{"name":"Mohammed EL-barbeer","id":"629098840630607"},"message":"هل ترغب فى الحصول على جهاز سمارت فون Klif ,, مجاناً  :)\nو المزود بنظام تشغيل فَيَرفُكس ؟!\nانضم لـ \" FirefoxOS Apps Challenge \" المقدم من موزيلا مصر و إغتنم الفرصة و كن أنت الفائز ;) \n\n#FirefoxOS_Apps_Challenge  #mozillaEgypt #FirefoxOS","caption":null,"description":"هل ترغب فى الحصول على جهاز سمارت فون Klif ,, مجاناً  :)\nو المزود بنظام تشغيل فَيَرفُكس ؟!\nانضم لـ \" FirefoxOS Apps Challenge \" المقدم من موزيلا مصر  , \nسجل تطبيقك الان : http://klif.mozilla-eg.org\nوكن أنت الفائز ;) \nhttps://www.facebook.com/events/1476287392667130/\n---\n#FirefoxOS_Apps_Challenge  #mozillaEgypt #FirefoxOS","created_time":"2015-08-19T04:42:55+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_991852377521137","from":{"name":"Ahmed Zain Mohammed","id":"10155252594718081"},"message":"سا الخير :) , الناس بتوع ال front-end, من الصبح بدور علي حاجة ت flip ال Bootstrap عشان يكون RTL و مش لاقي, المشروع الوحيد الي لقيته أخر commit عليه من سنتين !! حد عنده حل ؟! مش معقولة حاجة بالجمال ده و الواحد مش عارف يستخدمها ف مشاريع عربية :(\n\nو انا قاعد من الصبح أمال أحول كل Bootstrap component  ل AngularJS Directive و فرحااان, و قول خلاص بقي الواحد لقي combination محترمة لل front-end بس للأسف كده مش هاتفيدني في المشاريع العربية, حد عنده حل ؟\n\nشكراً مقدماً.","caption":null,"description":null,"created_time":"2015-08-19T04:35:59+10:00","total_likes":1,"total_comments":13},{"id":"172338516139198_991889010850807","from":{"name":"Mohamed Tarek El Haddad","id":"10158142026600408"},"message":"I stumbled on this and thought some of you may be interested. Zewail here talks about his 4D electron microscopy technology, which gave rise to the field of femtochemistry and for which he received the Nobel prize in chemistry as well. \n\n","caption":"zewail.caltech.edu","description":null,"created_time":"2015-08-19T06:19:57+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_991465874226454","from":{"name":"Ahmed Gaber","id":"1317803628265220"},"message":"\"Sundar Pichai, in one of his interviews, told that his parents, who were of a modest background, sacrificed a lot to ensure that he got all the facilities for education. They never had a car, or a TV and one of their bedrooms was their living room. Almost all the money that his parents had saved was used to buy tickets for Sundar to fly to the USA for his scholarship Master’s degree.\"","caption":"linkedin.com","description":"Indian CEOs and America’s blessingsYesterday, all the news channels, social media platforms, and tabloids worldwide were splashed with the news of Google announcing India-born and bred Sundar Pichai as its new CEO. It’s the second year in a row that an Indian has been handed over the reins of one of…","created_time":"2015-08-18T05:54:02+10:00","total_likes":16,"total_comments":1},{"id":"172338516139198_991916524181389","from":{"name":"Mohammed EL-barbeer","id":"629098840630607"},"message":"هل ترغب فى الحصول على جهاز سمارت فون Klif ,, مجاناً  :)\nو المزود بنظام تشغيل فَيَرفُكس ؟!\nانضم لـ \" FirefoxOS Apps Challenge \" المقدم من موزيلا مصر ,,  إغتنم الفرصة الآن و كن أنت الفائز ;) \n\n#FirefoxOS_Apps_Challenge  #mozillaEgypt #FirefoxOS","caption":"Firefox OS Apps Challenge","description":"Firefox OS Apps Challenge :)\nهل أنت مطور أو مصمم مواقع على شبكة الإنترنت وتقوم بكتابة أكواد HTML + CSS + JS ؟\nالآن فرصتك للفوز بجهاز سمارت فون Kilf المزود بنظام تشغيل فَيَرفُكس، \nفقط قم برفع التطبيق الخاص بك على متجر تطبيقات فَيَرفُكس ثم قم بالتسجيل معنا في التحدي على هذا الرابط :\n http://klif.mozilla-eg.org\n\nما هو نظام تشغيل فَيَرفُكس ؟\nنظام تشغيل للهواتف المحمولة تم تطويره بواسطة موزيلا، ويعتمد على اللينكس ومحرك عرض جيكو القوي الخاص بفَيَرفُكس. تطبيق الإنترنت الخاص بنظام تشغيل فَيَرفُكس يتم بناءها بواسطة ال HTML, CSS, JavaScript. بالإضافة إلى ذلك، تطبيقات الإنترنت الخاصة بنظام تشغيل فَيَرفُكس تستطيع الوصول إلى مُعدات وخدمات الجهاز عن طريق واجهة التطبيقات البرمجية (API).\n\n:مواعيد المسابقة\n---------------------------\nبدايه التقديم :  يوم 20/8/2015\nآخر موعد لاستلام التطبيقات :  يوم 18/9/2015 حتى الثانية عشرة منتصف الليل\nتاريخ إعلان النتيجة (التطبيقات الفائزة) : يوم 21/9/2015\n\n:الجوائز\n---------------------------\nأول 5 فرق فائزة ستحصل على 3 أجهزة للفريق الواحد.\nهدايا خاصة للفائزين من موزيلا \nدعايا للتطبيقات الخاصة بهم على شبكات التواصل الإجتماعي من موزيلا \n\n:شروط التقدم للمسابقة\n---------------------------\n* يمكن للأفراد والفِرق والشركات المشاركة في المسابقة. \n* في حالة انضمام فريق يجب ان يتم اختيار قائد للفريق يقوم بتمثيل الفريق بأكمله في حالة الفوز.\n* يحق لمتطوعي موزيلا المشاركة والمنافسة في المسابقة.\n* يجب أن يكون التطبيق المتقدم للمسابقة جديد ويتم رفعه على متجر تطبيقات فَيَرفُكس في موعد من 20/8 إلى 15/9 في تمام الثانية عشر منتصف الليل.\n* يرجى إرسال التطبيقات بشكل سري للحفاظ على حقوق الملكية الفكرية.\n* يحتفظ الحكام لأنفسهم بالحق في تغيير فئة التطبيق.\n* يحتفظ الحكام لأنفسهم بالحق في دمج عدة فئات في فئة واحدة أو تقسيم فئة إلى عدة فئات.\n* يتم إعلان أكثر من مرشح ويوجد أكثر من فائز في كل فئة.\n* لجنة الحكام تحتفظ لنفسها بالحق في عدم منح الجائزة لأي فرد أو فريق لم يستوفِ\n\n:شروط ومعايير المسابقة\n---------------------------\n* قرارت لجنة التحكيم إلزامية ولا رجعة فيها.\n* يجب أن يكون التطبيق مجاني ومتاح للتحميل من متجر تطبيقات فَيَرفُكس حتى انتهاء موعد المسابقة للتمكن من مراجعته\n* لمزيد من المعلومات عن كيفية البدء يرجى اتباع التعليمات الموجودة بالرابط التالي:https://marketplace.firefox.com/developers/\n* لجنة التحكيم تتألف من مجموعة من المطورين المختصين من مجتمع موزيلا مصر.\n\n:شروط يجب مراعاتها في التطبيق\n---------------------------\n* أن تكون التطبيقات مفيدة  ولهدف واضح.\n* الإبتعاد عن حقوق الملكية والملكية الفكرية في التطبيقات.\n* أن تكون الأفكار جديدة حيث لن يتم قبول أي تطبيق مكرر على ال Marketplace أو تم أخذه من موقع آخر.\n\n:شروط مطوري التطبيقات\n---------------------------\n* لا تقم بأي شيء غير قانوني أو قد يسبب الأذى للآخرين.\n* نحن غير مسؤلون عن استخدامك لمتجر تطبيقات فَيَرفُكس أو أي تصرفات من قبل المستخدمين الآخرين بما في ذلك المطورين.\n* أنت مسؤل عن استخدامك أو سوء استخدامك لتطبيقات وإضافات متجر تطبيقات فَيَرفُكس .\n* نحن نحتفظ بالحق الكامل في تغيير أيًا من هذه الشروط حسب ما نراه وإذا قمنا بإجراء أية تغييرات مادية سوف نقوم بإخبارك بها.\n* عند استخدامنا لكلمة \"المطورين فإننا نعني مطوري الطرف الثالث الذين يجعلون تطبيقاتهم متاحة على متجر تطبيقات فَيَرفُكس.\n* التطبيقات هي برامج مكتوبة باستخدام تقنيات الويب المفتوح وقابلة للتشغيل على منصات مختلفة.\n* متجر تطبيقات فَيَرفُكس يستخدم موزيلا بيرسونا لربط المحتوى المشريَ الخاص بك بحسابك. لن تستطيع استعمال أي محتوى قمت بشرائه بدون تسجيل الدخول باستخدام حساب بيرسونا الخاص بك. إذا قمت بحذف حساب بيرسونا الخاص بك، سوف تخسر أي محتوى قمت بشرائه. من الممكن أن يقوم المطورون بتوفير منتجات وخدمات تتطلب منك تسجيل الدخول أو المصادقة باستخدام وثائق إضافية إلى جانب بيرسونا.\n\n:روابط مفيدة\n---------------------------\nمستندات عن نظام تشغيل فَيَرفُكس (https://developer.mozilla.org/en-US/Firefox_OS)\nمركز تطبيقات نظام تشغيل فَيَرفُكس (https://developer.mozilla.org/en-US/Apps)\nمركز مطوري متجر تطبيقات فَيَرفُكس (https://marketplace.firefox.com/developers/)\nمحاكي نظام تشغيل فَيَرفُكس  (https://developer.mozilla.org/en/docs/Tools/Firefox_OS_Simulator)\n---\n#FirefoxOS_Apps_Challenge #mozillaEgypt #FirefoxOS","created_time":"2015-08-19T07:48:22+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_991953570844351","from":{"name":"Sameh Magharious","id":"10154141190610448"},"message":null,"caption":"blog.xamarin.com","description":"Xamarin developers have been coding the dream: crafting a single, shared codebase to target the multi-device world we live in. Here at Xamarin, we’re excited about the recent release of the Universal Windows Platform, and we know that both Xamarin and Windows Phone developers are excited about the i…","created_time":"2015-08-19T10:07:14+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_991718264201215","from":{"name":"Maged Eladawy","id":"1220459164735315"},"message":"Here is my experience with VPSDime if u are just interested\n\n\"Akheeran (after 2 days of configuration), I'm done from installing & configuring Centos 7 on my new VPS. Moving from shared hosts to VPS is a must. I got my 7$ monthly VPS (Unmanaged) from VPSDime with 6GB of Ram and 30GB SSD Space. So far, its a great experience ! i didn't expect that i'd get such specification with only 7$/month. I regret the time i waste in shared hosts.\"\n\n","caption":"vpsdime.com","description":"Cheap High Memory and High Storage VPS Hosting","created_time":"2015-08-18T22:01:12+10:00","total_likes":4,"total_comments":17},{"id":"172338516139198_992109987495376","from":{"name":"Ibrahem Salah","id":"1103643933095809"},"message":"Is there is a function that takes matrix as parameter and draw it or at least preview it in a decent way so i can see different cells with different colors ?","caption":null,"description":null,"created_time":"2015-08-19T19:54:01+10:00","total_likes":0,"total_comments":4},{"id":"172338516139198_992227890816919","from":{"name":"Muhammad Sweilam","id":"1364071080307326"},"message":"I'm writing a custom CISC CPU core in Verilog for SoC design. Unfortunately, the current FPGA device I'm using (Altera EP4CE6) doesn't containt sufficient BRAM (270 Kbits) for storing the microcode ROM table. Is there any method for optimizing the microcode ROM without depending mainly on BRAM?","caption":null,"description":null,"created_time":"2015-08-20T01:07:25+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_990632204309821","from":{"name":"Ahmed Al-Amir","id":"10155179919799180"},"message":"How about an application that has 18K classes of which 3K are interfaces? There is even a header file with the name FBEventUpdateNotificationSubscriptionLevelMutationOptimisticPayloadFactoryProtocol-Protocol.h, talk about self documenting code.\n\nI know working at Facebook sounds really cool, but I would not want to be the one going through that sort of a project to fix a bug.","caption":"quellish.tumblr.com","description":"Recently someone on reddit asked “How on earth is the Facebook app size so large ?”. The person asking the question realized that the ~100Mb compressed App Store archive wasn’t all assets - a very...","created_time":"2015-08-16T17:53:47+10:00","total_likes":11,"total_comments":1}]}