{"posts":[{"id":"172338516139198_1362086977164340","from":{"name":"Abdulaziz Alaa","id":"10212348961303729"},"message":"Did anyone tried before to create a custom Android keyboard for a some use case in certain activity in his app. I need to make it extend the keyboard class and the keyboard view class so i can make it complete native keyboard. So i can make use of the keyboard functionality in android with a different look. \nAm i thinking right or should i just create it as a part of the layout with the regular layout components.\nI did some work with making a native custom keyboard and i changed the look but i could not get it to work when some edittext has focus. The user still have to go and choose it from settings inputmethod. I need to be able programmatically to make my keyboard the default input method. \nI just want to know what is the best way to do this build a custom keyboard or just make it in the layout.","caption":null,"description":null,"created_time":"2017-01-23T03:24:33+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1362161733823531","from":{"name":"Hassan Saad","id":"303806276703088"},"message":null,"caption":null,"description":"ابدء ازاى ؟\nالسؤال ده اتسأل كتير اوى و اتجاوب عليه كتير اوى بس برده مازال عامل مشكلة عن عدد كبير جدا من الناس وبالذات اى حد لسه بيسمى وبيقول يا هادى فا ﻻزم طبعا يسأل السؤال ده , ابدء ازاى ؟\n\nخلينا نتفق ان مفيش اجابة واحده للسؤال ده وفى مليون طريق ممكن يوصلوا لنفس الهدف .\n\nاحنا بس دايما بنفضل اننا نمسك الموضوع ده اوله عشان نحاول نفهم \n\nيعنى فى البداية خالص الموضوع كله عبارة عن شوية Devices ومتوصلين ببعض عن طريق اسلاك الموضوع منطقى جدا \n\nزى الصور الـ تحت دى عندك شوية اجهزة ممكن بقه تكون PC او Laptop او Smart Phone او Server او Router و عامل Network بسيطة مابينهم عن طريق شوية اسلاك عشان يقدروا يبعتوا رسايل لبعض عن طريق الـ Wires دى بس كده دى هى الصورة المبسطة جدا لازاى العالم ده كله متوصل ببعض :3 بس صدقنى الموضوع مش بالبساطة دى :3\n\nفا يجي بقه حد لسه عايز يبدء ويسأل سؤال ازاى ابدء فى مجال الـ Hacking :3 بص هو اصلا والله مفيش مجال اسمه Hacking المفروض يعنى هو ده مصطلح اطلق على اى حد بيحاول يخلى حاجة تعمل عكس ما هى المفروض تعمله :3 فهمت حاجة \n\nيعنى من الاخر انك تBreak حاجة او تTest هل حد يقدر ممكن يBreak الحاجة دى :3 \n\nبص انت عايز تتعلم Hacking تمام احنا معندناش مشكلة بس الفكرة انت عايز تخترق ايه , اصل مينفعش انك تقول Hacking وخلاص يكون افضل يعنى لو تربطها بمصطلح تانى زي مثلا تقول Network Hacking او Software Hacking يعنى حاجة زي كده \n\nفا دلوقتى زي ما عرفنا ان العالم ده كله عبارة عن شوية اجهزة ومتوصلين ببعض عن طريق اسلاك , فا انت عايز تعمل ايه بقه , هل عايز تخترق الـ Network الـ مابينهم وتشوف مثلا الرسايل الـ بتتبعت مابينهم وﻻ مثلا عايز تخترق الجهاز ذات نفسه عشان مثلا تمسح او تنقل بعض الملفات :3 \n\nحتى لو حددت قرارك بأنه Network security او Computer security انت متعرفش ان الكلمتين دول كبار جدا جدا جدا جدا \n\nطب لو قلنا computer security فا هل انت محدد نوع الـ Device ده عشان الـ Router بيشتغل بطريقة مختلفة عن الـ Smart Phone والـ برده بيتشغل بطريقة مختلفة عن الـ Server والـ برده حتلاقيه مش زي الـ Laptop بتاع ميمى صحبتك الـ عايز تخش عندها :3 \n\nدي كلها Technologies مختلفة وبتشتغل بطرق مختلفة وحتى لو قررت انك عايز تخش على Lap طنط نوال طب هل انت ناوى تخش عليه عن طريق الـ Web service وﻻ عن طريق Malware مثلا وهل انت عارف الـ Web Technology شغاله ازاى يعنى لو افترضنا يعنى ان الجهاز عليه موقع وممكن تTest الموقع ده وتلاقى فيه ثغرة مثلا سواء Known or Unknown تقدر تخش بيها هل انت فاهم الدنيا دى طب لو قلنا انك فاهم افرض دخلت عند طنط ميمى ولقيت هى شغالة Linux هل انت فاهم Linux اصلا عشان تعرف تعمل Remove او Upload للـ Files الـ انت عايزها :3 \n\nالموضوع كبير كبير كبير :3 وهل انت لو نويت انك تخش عن طريق Malware بفلاشة معفنة هل انت عندك الفهم الكافى للـ IP Technology والـ DNS Technology عشان تعرف تظبط Reverse Shell يجيلك صح وتعرف تظبط External IP ويكون Static كمان او لو Dynamic فا تربطه بي Domain وتعمل update للـ Dns هل انت فاهم كل ده بشكل كويس ده غير الـ Antivirus والـ Firewalls ده اذا كانوا موجودين اصلا يعنى :3 \n\nهل انت فهمت حجم اجابة سؤالك عاملة ازاى :3 \n\nبص افضل هاكر هو الـ عنده افضل Knowledge للعالم الـ حواليه يعنى طول ما انت عايش ادرس واتعلم وحتلاقى نفسك من غير ما تحس بتعرف تBreak اى حاجة عشان انت فعلا بقيت فاهم الحاجة دى شغالة ازاى :3\n\nيعنى ملخص الكلام :3\nمش حتفرق انك تبدء لينكس وﻻ شبكات وﻻ برمجة وﻻ جن ازرق :3\nوﻻ حتفرق انك تتعلم من Offensive Security وﻻ sans وﻻ ec council وﻻ حتى FBI , زي ما احنا قولنالكوا \" افضل هاكر هو الـ عنده افضل Knowledge \" :3\n\nابدء بقه زي ما تبدء مش حتفرق واتعلم من اى مكان وبأى طريقة مش حتفرق برده .\n\nالمهم انك تكون محدد انت عايز تعمل ايه وحتعمله ازاى , وتكون منظم دماغك بشكل كويس ^_^ \n\nيعنى ﻻزم تفهم الدنيا دى كلها ماشية ازاى ومتوصلة مع بعض ازاى والجهاز الـ انت عايز تخش عليه ده شغال ازاى وبمجرد ما انت حتفهم النقطة دى حتلاقى ان انت الـ بقيت بتكتشف طريق جديدة وبتعملها Publish كمان عشان توضح عيوب منتج او عيوب Technology :3\n\nونصيحة اخيرة لو انت بتفكر مثلا انك تخترق Smart Phone هل انت محتاج تعرف الـ Server شغال ازاى ! \n\nيعنى من الاخر لو انت واحد لسه بادىء فا اهم حاجة تعرفها الـ Computer شغال ازاى والـ Network الـ مابين الـ Computers دى شغاله ازاى بس كده :3","created_time":"2017-01-23T05:01:44+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1361710190535352","from":{"name":"Muhammed Nasser","id":"1372720529451299"},"message":"انا Front-end developer ومعايا c++ ومش عارف امشي في ال php ولا .Net \nممكن حد يقولي ايه بيميز كل واحده فيهم عن التانيه او اي مقال مش متحيز يقارن بينهم علشان اقدر اقرر","caption":null,"description":null,"created_time":"2017-01-22T17:42:56+11:00","total_likes":1,"total_comments":8},{"id":"172338516139198_1362396817133356","from":{"name":"Ben Othman","id":"1386880034707570"},"message":"a MUST read post: ","caption":"medium.freecodecamp.com","description":"This is the talk I have given at App Builders Switzerland on April 25th, 2016.","created_time":"2017-01-23T09:32:18+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1362507003789004","from":{"name":"Ahmed Ali","id":"1243188289109905"},"message":"محتاج مساعده فى حد بيفهم ف ال Finance  كويس يا ريت .. او مصادر كويسه اقدر اقرأ منها عن ال finance  للشركات الصغيره بوجهه عام \n#مساعده","caption":null,"description":null,"created_time":"2017-01-23T12:03:43+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1361021503937554","from":{"name":"Islam Mostafa Hosni","id":"10155820813988272"},"message":"can someone please help me ? \n \nI've a laptop infected with ransomware (I don't know the name of the virus till now) all I know is the file type and the format of the encrypted files are called OSIRIS.  \nThe files are encrypted with RSA-2048 and AES-128 ciphers. I've tried kaspersky Osiris decryption tool and Osiris decryption tool from Trend Micro, but no use. what should I do ?","caption":null,"description":null,"created_time":"2017-01-22T01:52:27+11:00","total_likes":1,"total_comments":3},{"id":"172338516139198_1362321873807517","from":{"name":"Mohamed K. Fathy","id":"1424757227568482"},"message":"انا هسال سؤال غريب شوية : ازاي افتح PayPal account بدون حساب بنكي لاني معيش بطاقة","caption":null,"description":null,"created_time":"2017-01-23T07:48:11+11:00","total_likes":3,"total_comments":3},{"id":"172338516139198_1362145733825131","from":{"name":"Mohamed Abdel Aty","id":"10212491964880718"},"message":"I am thinking about removing wscript.exe completely from a system as a mitigation for malware that use this scripting engine for infection  \n\nWhat could removing this file effect a home user pc ? For example does Windows update depends on it  ?","caption":null,"description":null,"created_time":"2017-01-23T04:38:51+11:00","total_likes":4,"total_comments":2},{"id":"172338516139198_1362805460425825","from":{"name":"Khalil Ibrahim Youssef","id":"1941416512755083"},"message":"I have an Email list i want to verifier the availablity of The Emails in real time, can you help ?","caption":null,"description":null,"created_time":"2017-01-23T20:09:43+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1362844730421898","from":{"name":"Ahmed M. Elgendy","id":"735673463274709"},"message":"Couchbase Guys, any help?\n\n","caption":"stackoverflow.com","description":"I created a couchbase bucket to sync it with ionic 2 app using PouchDB In the sync-gateway file I allowed guest users : \"users\": { \"GUEST\": { \"disabled\": false, \"","created_time":"2017-01-23T21:16:45+11:00","total_likes":0,"total_comments":0}]}