{"posts":[{"id":"172338516139198_894790210560688","from":{"name":"Ahmed Mahrous","id":"10154309240266156"},"message":"any one help ?\n\n","caption":"stackoverflow.com","description":"i make simple servlet using tomcat server with same tutorial https://www.youtube.com/watch?v=w6YPK9xunCk&index=5&list=PLE0F6C1917A427E96 i create calss called XmlServlet has simple get an...","created_time":"2015-02-14T07:28:53+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_896186530421056","from":{"name":"Anas Emad","id":"10154264552927478"},"message":"اكونت علي تويتر بيستخدم اسم و صور صديق كانها اسمه و صوره و يتراسل للناس كانه هو \nفيه اي حاجة يمكن نعملها غير ريبورت ؟","caption":null,"description":null,"created_time":"2015-02-17T08:41:54+11:00","total_likes":3,"total_comments":5},{"id":"172338516139198_896235887082787","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"For those asking about Python/Django books, this one is free and seems to get a very high rating and starts at the very begining, even for noobs in web development\n\nhttp://chimera.labs.oreilly.com/books/1234000000754/index.html\n\nAnd if you want a free development environment use this:\n\nhttps://www.nitrous.io/join/8VJgm-zW4I4?utm_source=nitrous.io&utm_medium=copypaste&utm_campaign=referral","caption":"chimera.labs.oreilly.com","description":"O’Reilly books may be purchased for educational, business, or sales promotional use. Online editions are also available for most titles (http://safaribooksonline.com). For more information, contact our corporate/institutional sales department: 800-998-9938 or <corporate@oreilly.com>.","created_time":"2015-02-17T11:24:27+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_896184073754635","from":{"name":"Tarik Ibrahim","id":"10155335676276062"},"message":"شباب عندى مشكلة فى تحويل فلوس من Skrill لبنك QNB المفروض و على حسب Skrill ان التحويل تم و البنك بيقول محصلش التحويل تم من شهرين\nاللبارح بعت ايميل للدعم الفنى و مفيش رد لحد اللنهارده :D\nدلوقت ايه الخظوات المفروض انى اعملها عشان اشوف الفلوس راحت فين و ايه البديل ل Skrill لتحويل الفلوس خصوصاً ان ليه فلوس لسه فى Skrill لسه مسحبتهاش","caption":null,"description":null,"created_time":"2015-02-17T08:33:29+11:00","total_likes":1,"total_comments":15},{"id":"172338516139198_896401207066255","from":{"name":"Mohamed Nady","id":"10154387282503733"},"message":"What is \" Big Data \" in a simple Words what kind of Facebook Database use:\n\n","caption":"blog.sqlauthority.com","description":"Decoding the human genome originally took 10 years to process; now it can be achieved in one week - The Economist.This blog post is written in response to the T-SQL Tuesday post of The Big Data. This is a very interesting subject. Data is growing every single day. I remember my first computer which…","created_time":"2015-02-17T20:44:21+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_896412850398424","from":{"name":"Ismail Zohdy","id":"10150897413399977"},"message":"Bread Crumbs Studio  –Web and Mobile apps studio located at Zamalek - is looking for functional/automation software testing engineer with minimum one year experience in testing mobile apps and mobile apps based systems.\nPlease send your resume with email subject ‘Software Testing Engineer’ to ismail@b-c-studio.com","caption":null,"description":null,"created_time":"2015-02-17T21:18:08+11:00","total_likes":1,"total_comments":10},{"id":"172338516139198_896477670391942","from":{"name":"Mohammad Tayseer","id":"10154965677956341"},"message":"Egyptian Geeks group is made to share knowledge, experience even Geeks jokes can posted or shared between all our members.\n\nWho is this group for:\n- Software Engineers/Developers.\n- UX / UI Designers.\n- Business Analysts.\n... not just Egyptians, but any Arab or Arabic speaking or those who are interested in those markets.\n\nThings we would like to avoid in our Group:\none of the main reason that we keep our group growing is our NON-SPAM contents, helpful topics, sharing problems and solutions and YOUR Participation :) . We will appreciate your help in keeping this group SPAM FREE and into the point. such as \"Ads, Non-Free Courses, etc...\"\n\nAUTO-POSTING Apps-bots are not permitted in our Group.\n\nWE ARE NOT GOOGLE! Do your research before posting any question. Don't waist out time and efforts while you didn't do the minimum to resolve your problem.\n\nFor Job Ads, please use out Job Board:\nhttps://www.facebook.com/groups/EgyptianGeeksJobs/\n\nCheck out our Archive:\nhttp://egyptian-geeks.github.io/EgyptianGeeksArchive/\n\nEGYPTIAN GEEKS","caption":null,"description":null,"created_time":"2015-02-18T00:51:15+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_896459153727127","from":{"name":"Somaya Mostafa","id":"10154265076857097"},"message":"السلام عليكم\nماهي افضل طريقة برنامج لتداول الملفات داخل الشركة و حفظها باقسامها ووضع الصلاحيات لاقسام دون الاخري؟؟؟","caption":null,"description":null,"created_time":"2015-02-17T23:46:56+11:00","total_likes":4,"total_comments":18},{"id":"172338516139198_896450337061342","from":{"name":"Khaled Ramadan","id":"10155975474214478"},"message":":)","caption":"youtube.com","description":"What would happen if Adolf Hitler attended a Scrum sprint review? Well sit back and enjoy...","created_time":"2015-02-17T23:13:56+11:00","total_likes":5,"total_comments":2},{"id":"172338516139198_896439827062393","from":{"name":"Amr Medhat","id":"10154469113964779"},"message":"بما إن الجروب آخذ في الازدهار وعدده بيكبر باضطراد و فيه محتوى قيم كتير بيزيد برضه مع زيادة العدد، و حيث إن تقنية الفيسبوك قايمة على العمر الافتراضي القصير لكل بوست واللي بيصعب الوصول لمنشور قديم أو البحث العقيم اللي ما بيرجعش نتايج كويسة .. من كل هذا المنطلق، ليه ما ننقلش على منصة تانية بتحل المشاكل دي كلها زي ديسكورس مثلا؟\n","caption":"discourse.org","description":"Conversations, not pages Why break conversations into awkward and arbitrary pages, where you have to constantly find the Next Page button? We've replaced all that with the power of just-in-time loading. Want to read more? Keep scrolling down. Dynamic notifications It’s difficult to have a conversati…","created_time":"2015-02-17T22:39:53+11:00","total_likes":6,"total_comments":5}]}