{"posts":[{"id":"172338516139198_1399676303405407","from":{"name":"Said Bakr","id":"10154979109648745"},"message":"عندي مشكلة بخصوص ال Port Forward وموش عارف بصراحة دي مشكلة مقدم خدمة \"تي إي ضاطا\" ولا مشكلة في إعدادات الروترات عندي!\nالموضوع باختصار عندي ماكينة في الشبكة المحلية مشغل عليها خادم ويب، وانا عندي راوترين، واحد بياخد النت من ال ADSL وبيبعته للراوتر التاني اللي بيوزع النت في الشبكة اللاسلكية. المهم انا عامل Port Forward من الراوتر الأول للبورت 80 إلى الأي بي اللي واخده الراوتر التاني عليه وعلى بورت 80 برضه.\nومن على الراوتر التاني عامل Port Forward للأي بي بتاع الماكينة إياها اللي عليها خادم الويب.\nكل حاجة جوة الشبكة المحلية ماشية زي الساعة مافيش اي مشكلة. المشكلة بتبدأ لما أدي الأي بي الخارجي بتاعي لحد علشان يدخل على السيرفر هنا بقى تحصل الاشتغالات، فساعات كل حاجة تشتغل تمام، وساعات تانية ما يقدرش يوصل للسيرفر. وكملاحظة مبدأية (لسة ما حققتهاش) لما بيبقى الاي بي الخارجي بتاعي بيبدأ ب 156 كله بيبقى شغال، ولما يبقى 197 بيتقف.\n\nفيا ترى الموضوع ده فعلا بسبب مقدم الخدمة، ولا انا الروترات عندي بتخرف؟","caption":null,"description":null,"created_time":"2017-02-25T06:14:34+11:00","total_likes":2,"total_comments":10},{"id":"172338516139198_1400663749973329","from":{"name":"Abdullah Hesham","id":"1288509424563678"},"message":"بؤس level 100 ._.","caption":null,"description":null,"created_time":"2017-02-26T03:43:55+11:00","total_likes":4,"total_comments":6},{"id":"172338516139198_1399106330129071","from":{"name":"Pola Ashraf","id":"10154301446888199"},"message":"Xamarin Developers, I have a question, Is it Reliable enough?\nWhenever I try to use, I find myself in a hell of conflicting libraries, with lack of support for native libraries like ChromeCast, etc.\n\nShould i give it more time, or Should I use native better?","caption":null,"description":null,"created_time":"2017-02-24T16:36:06+11:00","total_likes":3,"total_comments":2},{"id":"172338516139198_1400749256631445","from":{"name":"محمد خطابوفيتش","id":"1362794537115161"},"message":"كحد مبتدئ فى الـ front end web . \nانا متعلم اساسيات html , css , js , bootstrap , jquery \nوكل اللى بعمله هو مجرد محاكاه لبعض التمبلت اللى بشوفها مثلا على تطبيق فى الدروس \nأيه هي التقنيات وال tools اللى المفروض اتعلمها وايه نوعيه البروجيكت اللى اعملها تساعدني اتطور من نفسي فى المجال","caption":null,"description":null,"created_time":"2017-02-26T05:14:27+11:00","total_likes":1,"total_comments":3},{"id":"172338516139198_1390672377639133","from":{"name":"احمد قرواش","id":"1250647018364386"},"message":"السلام عليكم\nعندي استفسار بخصوص الالية الي بتمشي في الفيس بوك في عملية تحديثاته.\nسمعت ان كل اسبوع في تحديثات بتنزل للفيس بوك سواء علي ال mobile app او wep app\nطيب عملية التحديث بتم ازاي بدون ما يحصل توقف لل services الي بتبقي شغاله.\n\nيعني انا دلوقتي بعمل web services وعاوز التحديثات بنفس السرد الي بيحصل في الفيس بوك بحيث ال services الي شغاله عندي مش يحصل ليها توقف.\n\nانا بستخدم SOAP WCF للسيرفريس والكلاينت عندي ASP.NET MVC \nايه المفترض اطبقه او اتعلمه بحيث يبقي عندي نفس الميزة ديه.","caption":null,"description":null,"created_time":"2017-02-17T14:12:28+11:00","total_likes":6,"total_comments":8},{"id":"172338516139198_1400946476611723","from":{"name":"Mahmoud Tantawy","id":"10155099548114764"},"message":"Videos for almost all talks in FOSDEM 2017, so what's FOSDEM?\n\"FOSDEM is a two-day event organised by volunteers to promote the widespread use of free and open source software.\"\n\nYou can also find archived videos for 10+ years of the event here: https://video.fosdem.org/","caption":"fosdem.org","description":null,"created_time":"2017-02-26T09:16:12+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1400592953313742","from":{"name":"Amr Almgwary","id":"1830109697242778"},"message":"Can you represent 4 bits with only two bits ?!\nI tried but I cannot\nThe same i cannot represent 10 digits with only 5 digits.\nIs this true for any number of digits? \nCan we represent big numbers with small numbers using some compression or hashing?","caption":null,"description":null,"created_time":"2017-02-26T01:49:59+11:00","total_likes":0,"total_comments":9},{"id":"172338516139198_1399595366746834","from":{"name":"Ihab Khattab","id":"10154627403959272"},"message":null,"caption":null,"description":"كارثة على مستوى الإنترنت لو تم استغلالها ممكن تتسبب في اختراقات لملايين الحسابات\nشركة CloudFlare أكبر مقدم لخدمة الـ caching لأكثر من 5.5 مليون موقع بينهم مواقع ضخمة حصل عندهم bug تسببت في تسريب ملايين الـ requests اللي فيها passwords/cookies\nالـ bug اكتشفت الأسبوع اللي فات وتم الإعلان عنها من ساعات كان سببها ان السيرفرات بتعمل dump random portion of memory في الـ response لو كان فيه خطأ في الـ html tags بتاعت الصفحة اللي معمولها caching\nوبما ان كل caching server عندهم shared وممكن يعمل caching ﻷكتر من موقع ف الـ memory dump اللي راجع لل client فيه data من requests جايه من users تانيين على مواقع تانية\n\nاللي ممكن يستغل الثغرة دي أي حد عنده logs من web crawlers ودي bots بتزور المواقع وتاخد نسخة منها أو من بعض الـ data اللي فيها لهدف معين, أشهر حد بيعمل كدا google وبتستعملها في الـ search engine وحاجات تانية, اللي اكتشف الـ bug كان engineer من google وبلغ بيها CloudFlare و google أعلنت انها بتحاول تمسح كل الـ logs/data اللي عندها","created_time":"2017-02-25T04:48:30+11:00","total_likes":21,"total_comments":2},{"id":"172338516139198_1401441939895510","from":{"name":"Eslam Fathy Farghal","id":"10210941837915607"},"message":"Sorting algorithms comparison, what is gravity sort anyway :D ?","caption":"youtu.be","description":"13 Sorting algorithms Insertion Bubble Selection Cocktail Shaker Merge In-Place Merge Out-of-Place Gravity Quick Counting Radix LSD (Least Significant Digit)...","created_time":"2017-02-26T20:10:43+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1400935739946130","from":{"name":"Mahmoud Tantawy","id":"10155099548114764"},"message":null,"caption":"ana-balica.github.io","description":"Blog about code, traveling and social involvement.","created_time":"2017-02-26T09:00:16+11:00","total_likes":13,"total_comments":1}]}