{"posts":[{"id":"172338516139198_1157735477599492","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"If you want to follow a certain post you can use \"Turn on notifications for this post\". Please use it instead of commenting with \"F\", \"Follow\" or anything ...\n\nTry to contribute to the discussions with meaningful inputs.","caption":null,"description":null,"created_time":"2016-06-07T23:54:01+10:00","total_likes":25,"total_comments":1},{"id":"172338516139198_1157746534265053","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"الموقع ده بيتيح ليك البحث عن الـ co-working spaces في أي مكان ... ملقتش في مصر غير district مع ان فيه اماكن أخرى كثيرة. اللي يعرف حاجة ممكن يضيفها مجاناً","caption":"workfrom.co","description":"The best places in a city to work remotely, based on recommendations by actual remote workers. See WiFi speeds, plugs, food and more before you go.","created_time":"2016-06-08T00:17:12+10:00","total_likes":16,"total_comments":4},{"id":"172338516139198_1157678220938551","from":{"name":"Ahmed Badawy","id":"1285105998248677"},"message":"from a nodejs noob >>> \n\nHelp me decide Hapi vs. Kraken vs. Sails.js vs. Loopback ? \n\nI've seen articles & videos about this, but i didn't reach a clear decision so i turned to you. please help me choose one. \nmy focus on reliability & maintainability.","caption":null,"description":null,"created_time":"2016-06-07T21:49:51+10:00","total_likes":7,"total_comments":3},{"id":"172338516139198_1157982387574801","from":{"name":"Mohammed Gamal","id":"831075223709574"},"message":"\"Completing a game of “Super Mario Brothers” can be hard — very, very hard.\"","caption":null,"description":"Super Mario Brothers is NP Hard (https://en.wikipedia.org/wiki/NP-hardness).\n\nFor my non-computer science friends, that means that it's basically not possible to make a program to solve the game in a reasonable amount of time.\n\nThe implication of this work is actually really interesting: if we can frame really hard computer science problems as video games, we can use human pattern recognition as a way to develop useful heuristics for solving them in reasonable time. Neat.\n\nhttps://www.csail.mit.edu/super_mario_brothers_is_np_hard","created_time":"2016-06-08T08:33:50+10:00","total_likes":12,"total_comments":1},{"id":"172338516139198_1158305094209197","from":{"name":"Moustafa Alzantot","id":"10154890030331815"},"message":"مجموعة قيمة من المسارات الدراسية لإحتراف خوارزميات الحاسب و برمجتها مقدمة من جامعة UCSD ، من ضمن أفضل ٢٠ جامعة على مستوى العالم في علوم الحاسب، على  موقع Coursera.\nhttps://www.coursera.org/specializations/data-structures-algorithms\n\nالمجموعة مكونة من خمسة مسارات دراسية لدراسة أساسيات الخورازميات، هياكل البيانات، خوارزميات الرسوم و الشبكات و تنتهي بمشروع نهائي. طريقة التقييم شيقة حيث بالإضافة إلى الأسئلة النظرية تعتمد أسلوب يشبه أسلوب المسابقات البرمجية حيث يتم طرح مسائل لتطبيق ما تعلمته و يقوم  الموقع باختبار الحل البرمجي باستخدام حالات اختبار تغطي جميع المدخلات المحتملة لاكتشاف أية أخطاء في الحل الذي قمت بتقديمه.\n\nيمكنك الاشتراك في المسارات و مشاهدة المحاضرات جميعها مجاناً و لكن يلزمك دفع مبلغ  تقريباً ٤٠٠ دولار للحصول على الشهادة المعتمدة و التمكن من تقديم حلول لجميع الاختبارات. أو يمكنك طلب الحصول على مساعدة مالية Financial aid بملأ الاستمارة الخاصة بذلك للحصول على المحتوى الكامل و الشهادة المعتمدة جميعها مجاناً :)","caption":"coursera.org","description":"Explore Data Structures and Algorithms Certificate offered by University of California, San Diego, Higher School of Economics. Master Algorithmic Programming Techniques - Learn algorithms through programming and advance your software engineering or data science career. The Specialization covers algo...","created_time":"2016-06-08T20:57:36+10:00","total_likes":17,"total_comments":0},{"id":"172338516139198_1158455554194151","from":{"name":"Ahmad Naser","id":"765927810225286"},"message":null,"caption":"anbilarabi.com","description":"تحياتي لكل المتابعين والطلاب حول العالم العربي الحبيب، يسرني اعلامكم اني قمت بنشر دورات جديدة على موقع سكيل شير العالمي على شكل دورات مصغرة يمكنكم الاشتراك بها مقابل سعر رمزي جدا هو دولار واحد فقط لمدة 3 شهور، اترككم الان مع الدورات اخوتي واخواتي","created_time":"2016-06-09T02:15:39+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1158562180850155","from":{"name":"Ahmed Atalla","id":"423597977977586"},"message":"The new framework from IBM","caption":"strongloop.com","description":"Introduction to API Connect for LoopBack Developers June 8, 2016/in API Connect, Arc, LoopBack /by C. Rand McKinneyShare If you’re a LoopBack developer, you have no doubt heard about IBM API Connect, the first product to come out of the IBM acquisition of StrongLoop.  You may not have paid too much…","created_time":"2016-06-09T06:25:44+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1158618210844552","from":{"name":"Rachid Mohamed","id":"761181650723366"},"message":"السلام عليكم\nاكادمية Coach Academy\nhttps://www.facebook.com/elcoachacademy/posts/1196535910371082?ref=notif&notif_t=notify_me_page&notif_id=1465400579205819\nعامله ايفنت تعليمى او معسكر لمده 10 ايام Programming Camp\nهندرس 60 ساعة موزعين على 10 ايام محتوى علمي الكوتش محمد عبد الوهاب\nانا الحقيقه اسمع عن الكوتش محمد عبد الوهاب انه من اقوى المدريب فى مصر\nدى تفاصيل الايفنت \nhttps://www.facebook.com/events/1048057601930613/\nانا كنت عايز اعرف هل حد اتعامل مع الاكادمية دى قبل كده . او اشترك فى ايفنت زى دا .\nيا ريت يشاركنا بتجربته لانى بفكر اشرك فيه","caption":null,"description":"مسابقة تحديد المستوي بالمعسكر التدريبي بالجونة\n\nزي ما قولنا ان الكوتش هيدرس بنفسه محاضرة من محاضرتين هتدرسهم يوميا طوال ايام الكامب لكل المستويات و في المحاضرة التانية هتكون بتعمل تطبيق عملي على اللي درسته في محاضرة الكوتش مع مساعدين الكوتش و هم طلابه ايضا و على افضل مستوى ، محاضرة الكوتش تستمر لـ 3 ساعات تقريبا.\n\nعشان كدة من الافضل انك تختار المستوى المناسب ليك من المستويات الموجودة في هنا goo.gl/CKhILr و تدخل المسابقة يوم الجمعة عشان تشوف المستوى ده مناسب ليك ولا لأ.\n\nالمسابقة هتبدأ يوم الجمعة الساعة 2 AM و تستمر 24 ساعة ، طبعا مش شرط تقعد الـ 24 ساعة كلهم ولكن احنا عاملين كده عشان منعرفش ظروفك ايه.\n\nللتسجيل في المسابقة goo.gl/forms/21Mzm4oxBjGQJx043\n\nلو مدخلتش مسابقات قبل كده:\n1- لازم يكون عندك حساب هنا www.codeforces.com/register\n2- قم بتفعيل الحساب\n3- ارسل لنا الهاندل علي  goo.gl/forms/21Mzm4oxBjGQJx043 مع كل البيانات\n\n4- انتظر دعوة تصلك للانضمام لجروب الكوتش اكاديمي\n5- بداخل الجروب هتلاقي المسابقة نزلت قبل ميعاد البداية مباشرة\n\nحظ سعيد لكل المتسابقين و نشوفكم ان شاء الله في الجونة","created_time":"2016-06-09T08:52:50+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1157530390953334","from":{"name":"Hossam Abubakr","id":"10154935254193046"},"message":"Do you guys know about any other Egyptian Startup that succeeded overseas?","caption":"techcrunch.com","description":"I came across Instabug when I was in Cairo in 2013. Little did I know that this plucky startup, born in the Arab Spring, would eventually make it through Y..","created_time":"2016-06-07T14:52:10+10:00","total_likes":25,"total_comments":3},{"id":"172338516139198_1158808274158879","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"The JavaScript community generally moves at a fast pace, and keeping with the mainstream usually means more resources and support and relevance. Based on the trends examined in the article, today’s JavaScript developer should learn React & Redux, be familiar with functional programming, and get started with TypeScript. In addition, there will be windows of opportunities for those who’ve dabbled with React Native, while having some experience with Electron may be nice. (Of course, it goes without say that TDD is a skill to learn no matter what the year).","caption":"www.codementor.io","description":"It's mid-2016 now. What are the skills a JavaScript developer should learn in 2016? This article will analyze JavaScript...","created_time":"2016-06-09T17:11:04+10:00","total_likes":7,"total_comments":0}]}