{"posts":[{"id":"172338516139198_881509475222095","from":{"name":"Hesham Mohamed Eladawy","id":"10154309434427452"},"message":"التدوينة دي تلخيص لبوست كان عبارة عن سؤال اتكتب على الجروب هنا وبيتكلم عن مشاكل الشركات الصغيرة ، انا دونت السؤال والردود لأنها كانت ممتعة ومفيدة","caption":"heshameladawy.blogspot.com","description":"لو فيه مجموعة طلبة في نفس السن بيعملوا startup إيه الأخطاء اللي المفروض مايعملوهاش من ناحية التعامل بينهم؟، و إزاي يديروا النظام الهرمي للشركة(و ياريت لو أي اقتراحات لطريقة تانية لتوزيع المهام بينهم؟).","created_time":"2015-01-16T13:50:25+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_881274325245610","from":{"name":"Abdelrahman Osama","id":"10155619445890931"},"message":"Guys we are launching soon, what will be the categories you will need/offer ? :)","caption":null,"description":"Do you have an idea you want to make it real but you need skilled people with you? Then comment below which skills would you need in those people (like: web development, etc..), and which skills would you offer to them in return (like: logo design, photography, etc..).\n\nhttp://lemoow.com/ Exchange tasks with skilled people!","created_time":"2015-01-16T02:18:34+11:00","total_likes":5,"total_comments":6},{"id":"172338516139198_881605901879119","from":{"name":"Ahmed Moosa","id":"10208573337479504"},"message":"بعض الزملاء هنا , شغالين NodeJs , فالبوست دا ربما يكون مفيد ليهم .\n\nhttps://www.facebook.com/groups/125499867491756/permalink/838946966147039/","caption":null,"description":"Any quick, free Node hosting services for deploying my node app?","created_time":"2015-01-16T19:53:22+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_881510271888682","from":{"name":"Hesham Mohamed Eladawy","id":"10154309434427452"},"message":"باحضر لكورس بالعربي عن الأسكرم...\nدي اجندة الكورس...\nتعليقاتكم هاتفيدنا بالتأكيد :)","caption":"youtube.com","description":"اول محاضرة في كورس متكامل يشرح اطار عمل الأسكرم... من هم المستهدفون، العاملون في البرمجة، طلبة هندسة البرمجيات، مديروا المشروعات والمديرون التنفيذيون. ماهو ا...","created_time":"2015-01-16T13:53:31+11:00","total_likes":7,"total_comments":1},{"id":"172338516139198_881794471860262","from":{"name":"Abdo Magdy","id":"10154407181291167"},"message":"Hi, I have a database of contacts that include mobile numbers with the old format, you know in 2011 there had been a shift in numbers format by adding a new digit. Are there a piece of software that can help me update the numbers automatically without the hassle of Excel tricks?\n\nI imagine there should have been a something to import CSV and do automatic update done. Anyone still aware of a software like that?\n\nThanks a lot","caption":null,"description":null,"created_time":"2015-01-17T06:14:28+11:00","total_likes":0,"total_comments":12},{"id":"172338516139198_882114998494876","from":{"name":"Meligy","id":"10154884040385170"},"message":"RT @shanselman: Reality TV for Developers - Where is http://t.co/eLttgN8kIq for Programmers? http://t.co/ZZ5vAnXqw4","caption":"hanselman.com","description":"Scott Hanselman on Programming, User Experience, The Zen of Computers and Life in General","created_time":"2015-01-18T00:37:20+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_882066691833040","from":{"name":"Adel K. Khalil","id":"10158375948495584"},"message":"This answer is spot on however I would like your thoughts on a more hands-on advise.","caption":"www.quora.com","description":"Geo Sebastian's answer: It's fairly simple actually, once you have amazing proficiency in software engineering, having made thousands of mistakes to tell you what works and what doesn't and of course the diversity of the projects that you've done. And let's not forget the last part, strong knowle...","created_time":"2015-01-17T22:41:47+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_881762705196772","from":{"name":"Ahmed M. AbouZaid","id":"10158193077815618"},"message":"الوضع كالتالي :D\n\nمن كام يوم بدأنا نستعمل Ansible بشكل فعلي في الشغل (واللي ميعرفش أنسيبل إيه هو عبارة عن Configuration management tool).\nوكان في حاجة معينة -صغيرة بس مهمة- عاوزينها بس مكانتش موجودة فيه، فعملت موديول ليه بباش في خمس دقايق.\n \n \nأنسيبل فيه ملف inventory بيكون فيه متقسم السرفرات لمجموعات عشان لو عاوز تنفذ حاجة معينة على مجموعة معينة من المجموعات.\nملفات الإنفينتوري بيكون شكله حاجة زي التالي:\n\n[group1]\nmember1\nmember2\nmember3\n \n \n[group3]\nmember1\nmember2\nmember3\n \n \n[group3]\nmember1\nmember2\nmember3\n \n \nاللي المفروض يعمله الموديول إنه بيطلع الجروبز بس في شكل json.\n \n \nالموديول بالباش هنا (دي كانت النسخة الأولية، حالياً السكربت بيطلع كل جروب فيه كام ميمبر).\nhttps://gist.github.com/AAbouZaid/066a3e5e026c599ec196\n \n \nبعد كدا قولت أروش على نفسي شوية وأكتبه بـ AWK بس بدون أي Bash :D\nعملت نفس النسخة من الموديويل في ١٠ دقايق وموجود هنا:\nhttps://gist.github.com/AAbouZaid/abf6f95bfb0fa1196dbe\n \n \nانهاردة قررت أروش على نفسي أكتر وأجرب أكتب أول بايثون سكربت :D\nفعلياً أنا معملتش أي حاجة قبل كدا ببايثون ولا حتى خلصت قراية فيه، بس عملت بالشوية اللي عارفهم يعني :D والنتيجة كانت التالي:\nhttps://gist.github.com/AAbouZaid/82c6085cccbd1b0deb3c\n \n \nدي أفضل طريقة \"نضيفة\" وصلت ليها لإن الغرض إن الموضوع يتعمل بنضافة مش مجرد النتيجة النهائية :D\n \n \nأنا sysadmin مسكين بعمل أي حاجة عاوزها بباش أياً كانت إيه هي ... لكن حابب أدوس أكتر في بايثون :D\nلو حد عنده طرق أكتر نضافة واختصاراً من الكود اللي مكتوب هيكون شيء عظيم إني أسمع منه :D \nيعني بدور ازاي أعمل ده بطريقة more pythonic :D","caption":"gist.github.com","description":"- Gist is a simple way to share snippets of text and code with others.","created_time":"2015-01-17T04:36:05+11:00","total_likes":13,"total_comments":18},{"id":"172338516139198_882213071818402","from":{"name":"Pola Ashraf","id":"10154301446888199"},"message":"Is anyone here using Umbraco CMS or Orchard CMS, I've read a lot about both, but can't decide which one to use\nboth are built using the same concepts (Content Types etc.)\nboth are used by Microsoft\nSo is anyone here used any of them to tell us his story ? and why he chose one over the other ?","caption":null,"description":null,"created_time":"2015-01-18T05:10:07+11:00","total_likes":0,"total_comments":7},{"id":"172338516139198_882568535116189","from":{"name":"Mahmoud Abd El-Fattah","id":"10155412942040288"},"message":"The power of CSS3!","caption":"hongkiat.com","description":"Contrary to popular belief, CSS is not only used to provide basic style for a web page in order to make it look more attractive. There are plenty of other things that one can do with CSS as well. With the ability to create animations and interactions, CSS along with ... Continue reading »","created_time":"2015-01-18T21:53:37+11:00","total_likes":5,"total_comments":1}]}