{"posts":[{"id":"172338516139198_560526393987073","from":{"name":"Eslam Hamouda","id":"10210277573008432"},"message":"مقال لشخص يعرض حياته بعدما ترك الانترنت لمدة عام كامل.","caption":"theverge.com","description":"I was wrong. One year ago I left the internet. I thought it was making me unproductive. I thought it lacked meaning. I thought it was \"corrupting my soul.\" It's a been a year now since I...","created_time":"2013-05-02T02:21:03+10:00","total_likes":2,"total_comments":1},{"id":"172338516139198_560617750644604","from":{"name":"Islam Abo-Amra","id":"1421810817839564"},"message":"HURRY UP! Registration deadline is extended for two more days till midnight May 2nd, 2013\n\nWe have also received many questions about the Full Agenda of the two days. Okay, everything will be available on the page here and will be emailed to you with your ticket details on Midnight Friday May 3rd, 2013. And with the quality of the speakers and carefully put contents for the two days, we promise this will hit your expectation bar high enough inchaAllah.\n\nThe two days will go with around 13 sessions and 6~8 workshops, with ability for you to attend all the sessions and two of the workshops. And guess what, this is for FREE!\n\nSo what are you waiting for, hurry up and REGISTER NOW!\n\nProfessionals’ registration form:\nhttps://docs.google.com/forms/d/1C1U0vB5kU14LDrJAZ9WYXDvTiOD0IrafgrTgwJSSwkk/viewform\n\nStudents’ registration form:\nhttps://docs.google.com/forms/d/18eiOASd-nmm8TS_WsFid4RfGZ8v8yEdjCM-Cg_V-0fw/viewform","caption":null,"description":"=====================================\r\nRegistration is now OPEN! and what's more, it's for FREE!\r\n=====================================\r\n\r\nThe Inevitable Cloud Community is collaborating with the Information Technology Institute ITI and are organizing the biggest Cloud Computing event in Egypt, CLOUD WEEKEND ’13 May 11-12, 2013. The event will bring together a broad array of top-level IT professionals from business, academia and government communities who will tackle these topics and detail their experience with us.\r\n\r\nCLOUD WEEKEND ‘13 is a networking event that provides a unique setting for attendees to meet and network with peers, partners, prospective vendors and colleagues from global multi-national organizations. \r\n\r\nThanks for the Information Technology Institute ITI, Attending the conference this year is for free! Yes, once your registration application is approved, you’ll have your ticket to attend the full two-day event for free!\r\n\r\nWe promise that CLOUD WEEKEND ‘13 will be the best event yet and we would love you to be a part of it! So hurry up and register now\r\n\r\nProfessionals’ registration form:\r\nhttps://docs.google.com/forms/d/1C1U0vB5kU14LDrJAZ9WYXDvTiOD0IrafgrTgwJSSwkk/viewform\r\n\r\nStudents’ registration form: \r\nhttps://docs.google.com/forms/d/18eiOASd-nmm8TS_WsFid4RfGZ8v8yEdjCM-Cg_V-0fw/viewform\r\n\r\nDeadline for registration is April 28, 2013. So hurry up and register now!\r\n\r\nApproved attendees should receive their free tickets by email on May 3rd, 2013","created_time":"2013-05-02T06:51:27+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_560845867288459","from":{"name":"Ahmed Adel","id":"10155949666619129"},"message":"Try and Rate","caption":"calebjacob.com","description":"Tooltipster is a powerful, flexible jQuery plugin enabling you to easily create clean, HTML5 validated tooltips.","created_time":"2013-05-02T23:09:10+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_555019831204396","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Should we make IRC Room for Egyptian geeks? anyone here still using IRC?","caption":null,"description":null,"created_time":"2013-04-18T04:05:12+10:00","total_likes":3,"total_comments":6},{"id":"172338516139198_561327497240296","from":{"name":"Ahmed Adel","id":"10155949666619129"},"message":null,"caption":"itwadi.com","description":"وأخيرا اكتملت رخص المشاع الإبداعي النسخة العربية المصرية وصارت جاهزة للاستخدام الرسمي. حيث ترجمت وطوعت رخص المشاع الإبداعي على حسب القانون المصري.","created_time":"2013-05-04T03:50:37+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_561396767233369","from":{"name":"Haytham ElFadeel","id":"10155089129978350"},"message":"For all those engineers who spend the night coding:\n\nWe aim to make Kngine able to answer every single question we can ask and as smart as humans. If your ambition as big as ours? We have a job for you.\n\n","caption":"kngine.com","description":"Kngine - Android and iPhone intelligent assistant and answer engine - Ask me anything","created_time":"2013-05-04T07:34:41+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_560842537288792","from":{"name":"Ahmed Adel","id":"10155949666619129"},"message":"Try and Rate","caption":"getfarawla.com","description":"Farawla is a code editor for web developers who find more beauty in their code than the Mona Lisa.","created_time":"2013-05-02T22:58:41+10:00","total_likes":1,"total_comments":3},{"id":"172338516139198_559249500781429","from":{"name":"Adel K. Khalil","id":"10158375948495584"},"message":"Guys, any idea how to push notification (PhoneGap) with Parse \ni Post on this URL https://api.parse.com/1/push and JSON object { \"channels\": [\"Broadcast\"],\n\"data\": { \"title\":\"test\", \"alert\": \"test\" } }\n\nIt works if the app is running on the background, need to fix this to work if the app is closed? any ideas?","caption":"api.parse.com","description":null,"created_time":"2013-04-28T21:24:52+10:00","total_likes":0,"total_comments":5},{"id":"172338516139198_561547827218263","from":{"name":"Mohamed Elsherif","id":"10158483817400314"},"message":"راديو اسأل مطور, الحلقة العاشرة, في هذه الحلقة نستعرض موضوع جديد و هو موضوع أنظمة التخزين الحديثة, و التي تتعدى مجرد قواعد البيانات الكلاسيكية, نتعرض بتفصيل لأسباب اللجوء لهذا النوع من تقنيات التخزين, و فوائده و عيوبه, و أشهر التقنيات التجارية في هذه الأيام\nAsk Developer Podcast, Episode 10, in this episode we discuss the NOSQL subject, which challenges the traditional database models in the current web scale world, we discuss in details the motivations behind this kind of technology, and the pros & cons of it.","caption":"soundcloud.com","description":"راديو اسأل مطور, الحلقة العاشرة, في هذه الحلقة نستعرض موضوع جديد و هو موضوع أنظمة التخزين الحديثة, و التي تتعدى مجرد قواعد البيانات الكلاسيكية, نتع...","created_time":"2013-05-04T17:30:17+10:00","total_likes":4,"total_comments":0},{"id":"172338516139198_561607043879008","from":{"name":"Sameh Magharious","id":"10154141190610448"},"message":null,"caption":null,"description":"We're reaching the final hours of the International Day Against DRM. Thank you for shopping with us and supporting the authors and other businesses who offer DRM-free products. You still have time to take advantage of our site-wide 50% off DRM-free ebooks & videos (60% off for purchases totaling over $100)\r\nhttp://oreil.ly/DRM-FREE-2013","created_time":"2013-05-04T22:13:44+10:00","total_likes":2,"total_comments":0}]}