{"posts":[{"id":"172338516139198_934009456638763","from":{"name":"Mohamed Zeineldin","id":"10212399082202789"},"message":"I need to know if anyone know a solution connecting between mobile payment solution like VF cash ..etc and credit cards system .....\nso if someone transferred money to me , i could receive it throw ATM","caption":null,"description":null,"created_time":"2015-04-30T23:03:55+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_933668463339529","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"Just installed VSCode on my personal custom made #Debian\n\nNow installing the #mono framework. let's see where this goes.","caption":null,"description":null,"created_time":"2015-04-30T07:56:48+10:00","total_likes":8,"total_comments":8},{"id":"172338516139198_934092963297079","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"Oh my My little heart","caption":"youtube.com","description":"Microsoft HoloLens demo onstage at BUILD 2015","created_time":"2015-04-30T23:59:14+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_934160756623633","from":{"name":"Mahmoud Mustafa El-Badry","id":"10155209531076654"},"message":"sometimes it's amazing to read about the people behind open source projects","caption":"incompleteness.me","description":null,"created_time":"2015-05-01T02:43:04+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_933684820004560","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"Since I am sure you guys are interested in everything I install and can't sleep without knowing my latest news, I now also installed MonoDevelop, not because I need it to Run VSCode, but because after installing Mono Libraries I thought I might as well.\n\nNotice in the second picture how much RAM is being used although I am using Pycharm and Mono and Iceweasel with multiple tabs. \n\nThis is exactly why I really love the #linux platform and HD space consumed with all the software I installed, including the web server and Eclipse is still 4.44 GB RAM.\n\nI guess I can easily run this machine on a USB drive and take it everywhere.\n\nFor those who need physical proof I attach this pic","caption":null,"description":null,"created_time":"2015-04-30T08:47:57+10:00","total_likes":4,"total_comments":18},{"id":"172338516139198_934106113295764","from":{"name":"Ahmed M. Araby","id":"10154630737934263"},"message":"Anyone have experience with online payments \nI'm using paypal-like verification method to authenticate card ownership , which charges random amount and requires to enter it\n\nanyone have better better approach  ?","caption":null,"description":null,"created_time":"2015-05-01T00:37:31+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_934238893282486","from":{"name":"Ahmed Faĥmŷ","id":"1384388628250242"},"message":"أهم أحداث اليوم الاول من مؤتمر المطورين Microsoft Build 2015","caption":null,"description":"ملخص اليوم الاول من مؤتمر مايكروسوفت\n---------------------\n\nأعلنت Microsoft في مؤتمر المطورين Microsoft Build2015  في سان فرانسيسكو الامريكية\n1 - إن الترقية للإصدار الجديد Windows 10 ستكون مجانية لمدة عام \n2 - تهدف إلى الوصول إلى مليار مستخدم لويندوز 10 تأمل الى تخطى جوجل و التى يعمل بنظامها 500 مليون جهاز .\n3 - الاسم الرسمي لمتصفحها الجديد الذي كان يحمل في السابق اسم “مشروع Spartan” اسمه الرسمى الجديد: Microsoft Edge !! \nو يتميز ببعض الخصائص الإضافية مثل تكامله مع المساعد الصوتي “Cortana” كما سيدعم الإضافات الموجودة في متصفحات فايرفوكس وكروم مع قليلٍ من التعديلات لتعمل مُباشرة على المتصفح\n4 -إتاحة مصدر .NET للمطورين لأنظمة ماك ولينكس لأول مرة !\n5- أعلنت عن متجر مخصص لقطاع الأعمال بإسم Windows Store .\nالفكرة من المتجر هو جعل الامور أسهل بالنسبة لقطاع الاعمال حيث يستطيع المدراء السيطرة على التطبيقات التي يرغبون في ظهورها للموظفين ولكن هذا لايعني ان المتجر مخصص للعمل فحسب فهناك تطبيقات موسيقى وتطبيق Photoshop Elements للتعديل على الصور وغيرها .\n\n6 - بالنسبه للاجهزه اللوحيه واجهة النظام  ستكون مختلفة عليها حيث سيتم وضع الكثير من التطبيقات في قائمة إبدأ \n7 - أكدت ان هناك زر جديد ” للخلف ” سيظهر في الواجهة .. كما سيتكيف النظام مع شاشات اللوحيات كجهاز الكمبيوتر الشخصي مع دعم تطبيقات 32bit واستجابة سريعه للمس \n8- أعلنت عن 425 مليون مستخدم لخدمات Azure\n\n9- أعلنت عن أداه جديده Visual Studio Code لتحرير التعليمات البرمجية لنظام لينكس وماك إضافة لنظام الويندوز أيضاً و تقول انها خفيفة بشكل لايصدق وتقدم الكثير من المزايا للمطورين .\nويمكن للمطور من التطوير على المنصة بأستخدام عدة لغات مثل الجافاسكريبت و asp.net\n\n10-  انك تقدر تكتب objective c على الفيجوال استوديو و يرن عادي على الايفون \n\nيتبع ...","created_time":"2015-05-01T05:37:38+10:00","total_likes":23,"total_comments":1},{"id":"172338516139198_934569049916137","from":{"name":"Karim Ali","id":"1306002799479969"},"message":"My short intro to basket.js, have fun! :)","caption":"medium.com","description":"One of common concerns I faced in web/frontend development is libraries like “Angularjs, Bootstrap, JQuery… etc..” loadi…","created_time":"2015-05-02T02:01:47+10:00","total_likes":12,"total_comments":1},{"id":"172338516139198_934665049906537","from":{"name":"Ahmed Bahnasy","id":"1270319029713569"},"message":"شباب الايفينت ده مهم جدا \nلكل الناس المهتمه بالويب \n\nhttps://www.facebook.com/events/841375902597860/","caption":"المؤتمر المصري الاول لمطوري الويب","description":"ال web؟؟\nفي ناس كتيير اوي بتعرف web كويس في مصر\nبس برده في ناس كتيير عاوزين يتعلموا و يدخلوا المجال ويبدعوا فيه ومش عارفين يبداو منين !!!\n\nوفي ناس كتيير برده واقفبن عند نقطه معبنه و مش عارفين\nيكملوا ويطوروا من نفسهم ازاااااااي !!!!\n\nوفي برده ناس عاوزين يوصلوا علمهم و خبرتهم للناس دي\n\nتخيبل بقي ؟؟؟؟؟؟؟؟؟؟؟\n\nلو جمعنا الناس دي كلها في مكان واحد وخليناهم يتفاعلوا مع بعض في حاجه عمليه\n\nيعني لو مثلا واحد شغال web developer في شركه كبيره يجي ويشنغل معاك في project فعلي\n\nولو مثلا web designer يجي ويعلمك ازاي الشغل بيمشي جوه الشركه وازاي تتعامل مع العملاء\n\nده غيير ان ممكن ناس تكلمك عن التكنولجيا الجديده اللي ظهرت في ال web وازاي تقدر تستفيد منها\n\nطيب ايه ال topics اللي هنتكلم فيها \nاول حاجه هنتكلم عن الفرق بين لغات البرمجه للويب زي ال php ,JSP,ASP.NET, و هكذا\nوبعدين هنتكلم عن ازاي تقدر تعمل plugin بنفسك و اي حد في العالم يقدر يستخدمه بعدك\nوهنتكلم عن ازاي ال web development بيتم في الشركات الكبيره وايه دور \nال web developer جوه الشركه بالظبط وايه هي الحاجات اللي لازم تكون عارفها عشان تقدر تشتغل في شركه كبيره \nوهكذا بالظبط في ال web design \n\nطيب واللي عاوز يشتغل freelancer ؟؟؟؟؟؟؟؟؟؟؟؟؟؟\nدول كمان مش ناسينهم وهنتكلم عن ال freelancing خطوه خطوه\n\nده غير ان احنا هنتكلم عن ال tools الجديده اللي ظهرت في الويب وازاي تقدر تستخدمها \nوده غير برده topics كتييير جدا زي \nsecurity\ncloud-computing \nbootstrap \n\nوالناس اللي هتتكلم في المجالات دي عندهم خبره سنين في المجال ده منهم اللي شغال في شركات ومنهم اللي شغال freelancer وحابين انهم ينقلوا خبرتهم ليكم \nوهنزلكم الاجنده فيها كل حاجه بالتفصيل \nو هتعرفوا مين ال speakers اللي موجوده معانا \nطيب جميل اوي !!!\nامتي بقي الكلام ده وهيبقي فين ؟؟؟\nالميعاد هيكون يوم 8و9 مايو ( الجمعه والسبت الجايين) ان شاء الله \nوالمكان هيكون في قاعه الربع في شارع المعز- الحسين - القاهره القديمه\n\nطيب والتسجيل ؟؟؟\n\nده لينك التسجيل :\n \nhttp://goo.gl/0TrXEo","created_time":"2015-05-02T06:39:20+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_934668009906241","from":{"name":"Ahmed Faĥmŷ","id":"1384388628250242"},"message":"العدد الثانى من مجله Devmix :D","caption":"devmix.org","description":"  العدد الثانى من مجلة فريق DevMix نتمنى ان تنال اعجابكوا و نحقق لكم من خلالها اقصى استفاده ممكنه العدد الثانى :: عدد شهر ابريل 2015 تحميل المجلة هنستنى منكم تقيم المجلة بعد القراءه على الفورم...","created_time":"2015-05-02T06:55:01+10:00","total_likes":2,"total_comments":0}]}