{"posts":[{"id":"172338516139198_739892666050444","from":{"id":"100004951184058","name":"MohAmed HAmada"},"message":"السلام عليكم ياااريت يا جماعه الناس اللي بتفهم ف asp و برمجه ويب \nده كورس MCPD اناا هنزله \nياريت الناس تحمله ده حجمه صغير حداا و تقولي رايهاا ف المحتويات و لو ف حاجه ناقصه\nhttp://www.iteshare.net/Membership/Mits/2014/mcsd2012.pdf","caption":"www.iteshare.net","description":null,"created_time":"2014-05-02T03:20:51+03:00","total_likes":0,"total_comments":1},{"id":"172338516139198_740274779345566","from":{"id":"770091061","name":"Tarik Ibrahim"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-05-02T23:49:07+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_740275859345458","from":{"id":"1219778072","name":"Mohammed Zerox"},"message":"eventtus reimagined https://dribbble.com/shots/1535852-eventtus-reimagined","caption":"dribbble.com","description":"eventtus reimagined campaign page link","created_time":"2014-05-02T23:51:53+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_739899116049799","from":{"id":"548509156","name":"Ahmed Gaber"},"message":"السلام عليكم\nفي موضوع كده انتشر اليومين دول بتاع بوستات ازاي تشوف كاميرا صاحبك و ازي تعمل معرفش ايه منين علي الفيس, الموضوع مزعج الصراحه\nالنهارده قلت اقلب كده في الكود اللي بيتنسخ ده وطلعت بشويه حاجات انا شايفها كارثيه في السيكيورتي بتاعه الفيسبوك قلت اشيرها معاكم و محتاج رأي جيكس الفيسبوك اللي معانا\nاولا الكود بيشتغل علي مرحلتين, الكود اللي بيتنسخ ده يعتبر ثابت بتغيرات بسيطه لكن في اساسه ثابت\nاول ملحوظه يمكن شدت انتباهي ان الكود مكتوب بالتركي, نسبه كبيرة اللي كتب الكود تركي او بيعرف تركي و حابب يشفر الكود يمكن الله اعلم, الامر ده غريب لاني عايش في تركيا و اللي شايفه ان الاتراك ابعد ما يمكن عن البرمجه او الهاك علي العموم دي ملحوظه جانبيه حبيت اسجلها مش اكتر\nالملحوظه التانيه و يمكن دي اللي انا مش فاهمها الصراحه ان الكود بيطلب بيرمشن و بيشتغل علي ابليكشن فيسبوك رقمه 121876164619130 \nهو ده الابليكشن اللي السكربت بياخد منه الاكسس توكن علشان يعمل اي اكشن سواء فولو او بوست او لايك لصفحه, لو جيت تشوف ايه الابليكشن ده هتلاقيه ابليكشن البيج مانجر من الاندرويد, ممكن تلاقي تفاصيل اكتر من هنا Graph Explorer\nدي بقي الصدمه, الابليكشن ده ناس كتير جدا بيستخدموه, ده معناه انك لوعامل له اكسبت و ده احتمال كبير, السكربت بتاع الهاكر هايدخل ياخد اكسس توكن و يعمل اللي هو عايزة, و اللي شفته ان الاكسس توكن بتتخزن علي الاوفلاين ستورج ده معناه ان هو بالاكسس توكن ممكن يشتغل بعدين , انا مش فاهم الحته دي اوي انا بتكلم من معلومات سطحيه جدا و قراءة عابرة للاسكبرت\n\nالسكربت بعد ما بيعمل الاكسس توكن بيبعتها لصفحه ويب الهاكر بيبقي عاملها و بيبقي كاتب فيها الكود الحقيق بتاع الفولو او ايا كان النشاط اللي هو عايز يعملها\nامثله للصفحات الخارجيه دي \nhttp://www.weebly.com/weebly/apps/readDraft.php?draftId=839295953963304781&userId=27236607\n\nhttp://bqzet01.blogspot.com\n\nملحوظه : الصفحه لو فتحتها دلوقتي مش هاتعمل حاجه لانها مش ماسكه توكن, ممكن تشوف الحاجات اللي بتتعمل لو بصيت في السورس بتاع البيدج\n\nده تحليل سريع جدا من بصتي علي الكود و دلوقتي بقي \nالسكربت ده بيستغل جشع, او سذاجه الضحيه في انه يوقعه في الغلطه,\nفس ناس بتشتكي انه بيعمل ديسلايك لصفحه و يلاقي نفسه لايك تاني, او يعمل انفولو و يلاقي الفولو رجه, انا اعتقد ان المشكله سكربت من النوع ده, خاصه ان الابليكشن بيبقي واخد بيرمشن publish_stream يعني الستريم بتاعه الضحيه معاه يعمل اللي هو عايزة من غير حتي اكشن من اليوزر\n\nالموضوع مزعج الي ابعد حد لانه بيشتغل علي ابليكشن حتي انا عامل له اكسبت, \n\nايه بقي\nMohamed A. Baset","caption":null,"description":null,"created_time":"2014-05-02T03:45:54+03:00","total_likes":7,"total_comments":10},{"id":"172338516139198_740428085996902","from":{"id":"652024918","name":"Amr Eldib"},"message":"Very clever. Get a report card on your GitHub activities\nhttp://osrc.dfm.io/","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-05-03T08:07:10+03:00","total_likes":3,"total_comments":1},{"id":"172338516139198_740123902693987","from":{"id":"627907956","name":"Emad Elsaid"},"message":"حفلة الكود :)\nاوكى عدنا اليكم من جديد ببوستر جديد ^_^ \nمسألة الحفلة من بروجيكت اويلر و هى : \nhttp://projecteuler.net/problem=12\nالمسألة دى لطيفة و سهلة ، بيتكلم عن سلسلة اعداد اسمها triangular numbers كل عدد فيها بيبقى مجموع الأعداد الطبيعية اللى قبله يعنى العدد ال٣ فى السلسة هو ١+٢+٣ و العدد السابع هو ١+٢+٣+٤+٥+٦+٧ وهكذا \nبيقول ان كل عدد بيبقى ليه مجموعة اعداد ممكن يتقسم عليها، عاوز اول عدد فى السلسلة ممكن يتقسم على \"اكتر\" من ٥٠٠ عدد.\nخلونا نشوف tricks جديدة فى للغات اللى هاتستخدموها، be creative and have fun coding \nHint: فى نظرية الأعداد فى نظرية بتدرس عدد الdivisors بتاعة عدد معين و متسمية على اسم اويلر ;)","caption":null,"description":null,"created_time":"2014-05-02T17:04:46+03:00","total_likes":5,"total_comments":18},{"id":"172338516139198_695785460461165","from":{"id":"100004658621932","name":"Mohamed Fotouh Shalan"},"message":"لو انت مش عارف تروح مكان معين و عاوز تعرف توصله ازاى و ايه هى المواصلات اللى ممكن تركبها و تكلفة المواصلات اللى انت هتركبها كام و الوقت اللى انت هتخده فى الطريق \n\nاحنا عاوزين نجمع اراء ان البرنامج ده المستخدمين محتاجينه ولا لاء .. فممكن تساعدنا علشان نعرف \n\nادخل و جاوب على الأسئلة الموجوده \n\nhttps://docs.google.com/forms/d/1puKM7d6HRRLgBMVhAohBDCcqVOhhNNBH0qCmTowhz7o/viewform","caption":"docs.google.com","description":"عبارة عن برنامج للسمارت فون هيقدر يساعدك علشان توصل لأى مكان فى مصر .. عن طريق انه هيعرفك ايه انواع المواصلات اللى ممكن تركبها (هيقدملك اكثر من حل ) و هيعرفك التكلفه من المكان اللى انت فيه للمكان اللى انت عاوز توصله و كمان هيعرفك الوقت اللى انت هتاخده فى الطريق و كمان هيعرفك على الخدمات المتاحه فى ط...","created_time":"2014-02-04T00:22:51+03:00","total_likes":0,"total_comments":25},{"id":"172338516139198_740822952624082","from":{"id":"704237103","name":"ElMohanned Ahmed"},"message":"It seems that Waterfall is finally and officially dead!! The DOD (traditionally largest backer and funder of CMMi) now is required to use agile practices in software projects..\n\nDOD issued the New Approach report that requires DOD to use agile practices in its acquisition of IT systems:\nhttp://www.afei.org/WorkingGroups/section804tf/Documents/OSD_Sec_804_Report.pdf\nThe SEI has issued a report analyzing DOD’s report:\nhttp://www.sei.cmu.edu/reports/11sr015.pdf\n\nThe report recommends among other things:\n• A multi-level planning approach and a time boxed delivery manner. \n• New approaches should embrace the value of “80 percent solutions” (as appropriate).\n• Tangible evidence of relevant development capabilities in the form of prototypes or deployed systems (“working software”) will have preference in an evaluation with a commensurate decrease in paper-based proposal components.\n• Embrace the concept that incremental and iterative development and testing, including the use of prototyping, yield better outcomes than trying to deploy large, complex IT network systems in one big bang.\n• Requirements management process will be adjusted to reflect time boxed development constraints and allow for uncertainty. \n• Prioritization and further definition of requirements will be an ongoing activity.\n• Development efforts will focus on what can be achieved in the short term.\n• Development will involve continual test and evaluation with user involvement.\n• Test and evaluation will be structured to support iterative and incremental delivery. \n• Testing approaches will make extensive use of prototyping and automated testing.","caption":"scrum.jeffsutherland.com","description":"SCRUM LOG JEFF SUTHERLAND - Jeff created the first Scrum team in 1993 and worked with Ken Schwaber to formalize Scrum at OOPSLA'95. Together, they extended and enhanced Scrum at many software companies, helped write the Agile Manifesto in 2001, and authored the Scrum Guide.","created_time":"2014-05-04T01:13:06+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_740827152623662","from":{"id":"1246823411","name":"Abdelrady Fcis"},"message":"Jquery selectors performance test.","caption":"www.dotnetcurry.com","description":"Performance Test your jQuery Selectors using the jsPerf online tool.","created_time":"2014-05-04T01:27:51+03:00","total_likes":3,"total_comments":6},{"id":"172338516139198_739811616058549","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"the UK government just spent 5.5m GBP on getting extended support for XP :S","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-05-02T00:16:56+03:00","total_likes":0,"total_comments":5}]}