{"posts":[{"id":"172338516139198_1085983338108040","from":{"name":"Mohamed Elsherif","id":"10158483817400314"},"message":null,"caption":null,"description":null,"created_time":"2016-02-25T06:29:33+11:00","total_likes":23,"total_comments":5},{"id":"172338516139198_1084673208239053","from":{"name":"محمود على","id":"1371403339587094"},"message":"السلام عليكم ورحمة الله وبركاته \nإزيكم ياشباب، يارب تكونوا بخير.\nبعد إذنكم ياشباب كنت محتاج استشارة من الخبراء هامة وعاجلة جداً إذا تكرمتم\n- أنا محتاج أعمل متجر إلكترونى يليق ببراند قوى واحترافى للغاية، ولما طلبت من بعض الشركات، فيه اللى فضَّل البرمجة الخاصة وفيه اللى فضَّل الووردبريس أو الأوبن كارت.\n- أنا بميل إنها تكون ووردبريس أسهل فى الاستخدام، وهايتم تصميمها بشكل أسرع وأرخص وأكثر مرونة، لإنى بحس إن البرمجة الخاصة مكلفة جداً وتصميمها محتاج شهور، ولو محتاج أضيف فيها أى شىء مهما كان بسيط لازم برمجة للإضافة دى، إنما الووردبريس بيوفر معظم الإضافات اللى انت محتاجها، وكفاية إنه Open Source .\nأنا محتاج رأى حضراتكم، وبارك الله فيكم.","caption":null,"description":null,"created_time":"2016-02-23T02:13:10+11:00","total_likes":2,"total_comments":11},{"id":"172338516139198_1086313018075072","from":{"name":"Tarek Amr","id":"10154871355735944"},"message":"I struggle a lot with YouTube recommendations. Out of zillions of videos of Mortada Mansour and El 3elm wel Emaw and such crap, I rarely see something useful. \n\nAnyway, after this short rant, how about we share nice coding-related videos here every now and then? This one is about refactoring, for the Rubyists among you.","caption":"youtube.com","description":"Most developers know enough about refactoring to write code that's pretty good. They create short methods, and classes with one responsibility. They're also ...","created_time":"2016-02-25T20:28:55+11:00","total_likes":3,"total_comments":2},{"id":"172338516139198_1087151817991192","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"Bottom line is, if you are trying to change someone’s mind, criticism is not an effective way to do it.\n--\nDon't call someone's baby ugly !","caption":null,"description":null,"created_time":"2016-02-27T04:05:59+11:00","total_likes":3,"total_comments":1},{"id":"172338516139198_1086316831408024","from":{"name":"Tarek Amr","id":"10154871355735944"},"message":"I have a mild medical condition, which is, I am allergic to Java. Currently, I have some huge Java code, like some classes are 1,000 lines of code or something. Don't worry, I am not asked to add a single line of code to it. However, I am asked to give some guidelines to the development team, whether we should refactor it. Cut it down into micro-services? Which parts should go into micro-services?? Hopefully, some day, we re-write parts of this code into more human-readable languages. \n\nSo, what I want is a tool that I can point it to the code and it gives me back some statistics, like how many modules are there, how many classes, how big is each class, number of lines is good enough approximation for the complexity to me. Maybe, some additional stuff, like which classes are more tightly coupled to each other or something. Anything else I need to know? Do you know any tools I can use for that?\n\nBig plus to CLI (please, please no eclipse-plugins), hopefully no bells and whistles, less than 50 MB, no Maven and XML-based configurations and such stuff from the 1990's.","caption":null,"description":null,"created_time":"2016-02-25T20:43:11+11:00","total_likes":1,"total_comments":6},{"id":"172338516139198_1086380288068345","from":{"name":"Hesham Mohamed Eladawy","id":"10154309434427452"},"message":null,"caption":"heshameladawy.blogspot.com","description":"في مشاريع البرمجيات وخصوصا مع الحكومات ... تكون مرحلة توطين الموظفين على البرنامج Onboarding هي اصعب مرحلة. وحين نذكر التوطين فنحن حتما لا نعني التدريب وانما نعني التفعيل والأستخدام ومداومة الأستخدام ومن ثم تحقيق الأستفادة المرجوة. تكمن المشكلة في التوطين في مفهوم \"مقاومة التغيير\" وهو امر فطري لدى ا…","created_time":"2016-02-25T23:10:59+11:00","total_likes":3,"total_comments":3},{"id":"172338516139198_1087335971306110","from":{"name":"Abdelrahman Mounir","id":"10156001976483569"},"message":"I was looking for some competitive programming books to read, i've stumbled onto competitive programming 1/2/3, introduction to algorithms and programming challenges, which of those - or others - do you recommend?","caption":null,"description":null,"created_time":"2016-02-27T10:44:03+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1087302204642820","from":{"name":"Ahmed Abo Mazin","id":"1337260053029891"},"message":"انا مش عارف اية المشكلة هو بيقول انى محتاج اسطب Oracle Client مع انى مسطبة وشغال على اوركل على جهازى من اكتر من سنة ولسة شغالة \nمش عارف اشغل OLE DB على اى نوع Oracle بمجرب ما بيعمل open بيضرب الاكسبشن بيقول ان ال Provider اللى انا كتبة فى مشكلة \nانا لم بعمل Test لل Connection من خلال ملف udl بيقولى Connected Successfully فافتحو ك نودباد واخد ال Connection String وارمية فى البرنامج بيضرب بسبب ال Provider","caption":null,"description":null,"created_time":"2016-02-27T09:29:01+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1087040904668950","from":{"name":"Kareem Badawy","id":"1206517932798772"},"message":"حد عنده solution للهوست بتاع الصور لو انا بعمل ابلكيشن و مش حشتري host حاجه فور فري و يبقي سهل نرفع ليها و نعرض منها من ال app و شكرا","caption":null,"description":null,"created_time":"2016-02-27T00:40:12+11:00","total_likes":5,"total_comments":12},{"id":"172338516139198_1087312641308443","from":{"name":"Mostafa Yahia","id":"614707025392326"},"message":"I Am Inviting You To Try My New Game \nGive me Your Review \nAll Reviews Are Welcome \nand Give it the Rating You See it's Deserve \nand thanks A lot :) \n\n","caption":null,"description":null,"created_time":"2016-02-27T09:40:41+11:00","total_likes":2,"total_comments":0}]}