{"posts":[{"id":"172338516139198_733885486651162","from":{"id":"100002377283171","name":"Ahmed Abo Mazin"},"message":"did any one has the chance to apply the international competition of \"battle of brain \" \nif yes please help me to know how i can apply for it  \nand do I have to have a trainer?\nGive me any information about it ,please?","created_time":"2014-04-20T11:18:10+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_733994153306962","from":{"id":"100001558247907","name":"Mohamed Emam"},"message":"Blog Post: Decision Making (if statement - if else ....etc)\nLink: http://wp.me/p4cKPM-3g :)","caption":"mohammedemam.wordpress.com","description":"Hello in this post we will know more about Decision Making so let's get started :) Decision making structures require that the programmer specify one or more conditions to be evaluated or tested by...","created_time":"2014-04-20T15:09:13+0000","total_likes":1,"total_comments":2},{"id":"172338516139198_734099386629772","from":{"id":"1146591394","name":"Mostafa Sany Khodeir"},"message":"anybody have Umbraco Knowledge??","created_time":"2014-04-20T19:32:32+0000","total_likes":0,"total_comments":7},{"id":"172338516139198_734202766619434","from":{"id":"627907956","name":"Emad Elsaid"},"message":"Good news, \nالبوت اللى كنت شغال عليه خلصته دلوقتى حالآ، البوت عبارة عن سكريبت مع اكونت فيسبوك انا اضفته للجروب دلوقتى، البوت لو حد عمله منشن فى كومنت و كتب بعد الإسم لغة برمجة من دول : \nc, c++, fortran, haskell, io,javascript, lua, ocaml, php, perl, python, ruby, slash, assembly\nو بعدين سطور الكود هياخد السطور مع اسم اللغة و يروح يبعتهم على موقع eval.in و يجيب الناتج و يرد بكومنت على نفس البوست، انا هاجربه على البوست ده دلوقتى و هاقفله وانا بقفل الجهاز ، هانحتاج سيرفر نحط عليه السكريبت لحد ماجيب سيرفر شخصى احطه عليه.\nهيا بنا نلعب","created_time":"2014-04-21T00:53:49+0000","total_likes":25,"total_comments":25},{"id":"172338516139198_734351506604560","from":{"id":"788270371","name":"Amr Reda"},"message":"Blog post from the reCAPTCHA product manager at Google commenting on the ICLR 2014 paper by the Google StreetView and Brain folks.\nDuring his ICLR talk, Julian Ibarz said their ConvNet-based system can recognize Google's CAPTCHAs with 99.8% accuracy (\"better than humans\" according to Julian).","caption":"googleonlinesecurity.blogspot.com","created_time":"2014-04-21T05:44:55+0000","total_likes":2,"total_comments":0},{"id":"172338516139198_734367756602935","from":{"id":"100006020376039","name":"Mostafa Hussein"},"message":"بعد اللي انا شوفته دا اقتنعت 100% اننا مش عايشين :D","description":"We believe it's possible to create a ring of balloons that fly around the globe on the stratospheric winds and provide Internet access to the earth below. Ba...","created_time":"2014-04-21T05:59:41+0000","total_likes":2,"total_comments":0},{"id":"172338516139198_734426999930344","from":{"id":"100000224131120","name":"Moutaz Shams"},"message":"مبروك وصولنا لعشرين واحد وعشرين 2021 مهووس، إنت.. أيوا إنت.. حبذا توصف لنا المحتوى أو الأنشطة اللي تحب تشوفها في الجروب، المحتوى اللي انت كنت متوقعه لما اشتركت أو اللي تأمل إنك تلائيه","created_time":"2014-04-21T09:34:28+0000","total_likes":7,"total_comments":22},{"id":"172338516139198_734461933260184","from":{"id":"627907956","name":"Emad Elsaid"},"message":"Facebook Bot responds with code output\n\nthis script is a bot that will wait for anyone to mention you in a comment with language name and some code he want to execute and see the output, script will get the comment and parse it, then use an old script i have written before to execute scripts using eval.in website, gets the output and comment back to the same post with output, status code and a link to the code page on eval.in website.\nyou will need to create a facebook user, register it as a Developer, create a new application and get access token then modify the constants of the script (app_id, app_secret) and then execute the script with access token as parameter and execute it again without parameter to make it listen to notifications, the script will work only on comments in groups, as i exclusively made it for egyptian geeks group, if you want you can remove the filter of notifications and it'll erspond to everyone, but that will be headache and my consume your application rate limit\nthe idea of this script is not mine, it is made before by other developers for IRC and Reddit, i created it for facebook :), have fun\nGist: https://github.com/blazeeboy/RubyScripts/tree/master/2014-4-21","created_time":"2014-04-21T11:22:55+0000","total_likes":14,"total_comments":17},{"id":"172338516139198_734513343255043","from":{"id":"1779281195","name":"Ahmed Kamal"},"message":"I'm looking to contribute to an opensource project in my spare time. I guess it would be useful if those who contributed before could share their experience with us :)\n\nhttp://blog.smartbear.com/programming/14-ways-to-contribute-to-open-source-without-being-a-programming-genius-or-a-rock-star/","caption":"blog.smartbear.com","description":"Plenty of people want to get involved in open source, but don’t know where to start. Here are several ways to help out even if you lack confidence in your technical chops.","created_time":"2014-04-21T13:30:01+0000","total_likes":4,"total_comments":0}]}