{"posts":[{"id":"172338516139198_1083461561693551","from":{"name":"Abdalla Elnaggar","id":"1706578676025248"},"message":"I am trying to use Firebase and i get this error message in the log cat\nand there is no answer for that in stackoverflow\n\njava.lang.IllegalAccessError: tried to access method java.util.concurrent.ScheduledThreadPoolExecutor.setRemoveOnCancelPolicy:()V from class com.firebase.client.utilities.DefaultRunLoop\n\nany help ??\nor there is any stable alternative to Parse\nThanks in Advace","caption":null,"description":null,"created_time":"2016-02-21T01:15:14+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1083668035006237","from":{"name":"Islam Ali","id":"10154821080868780"},"message":null,"caption":"www.southampton.ac.uk","description":"Scientists at the University of Southampton have made a major step forward in the development of digital data storage that is capable of surviving for billions of years.","created_time":"2016-02-21T07:09:10+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1080808018625572","from":{"name":"Ahmed Abo Mazin","id":"1337260053029891"},"message":"فى سؤال محيرنى \nهو ارتفاع سعر الدولار هيأثر على مجالنا فى حاجة ؟؟؟  يعنى انا شايف ان تعاملنا معظمة مع الاجانب يعنى لو بصينا للموضوع بزوية ضيقة هيكون ان الارباح الشركة هتزيد طبعا انا فاهم انها هتاثر على حياتنا من زاوية تانية يعنى ارتفاع اسعار فى المنتجات وخلافة بس هل فى اى تاثر على شغلنا ؟؟؟","caption":null,"description":null,"created_time":"2016-02-16T10:06:38+11:00","total_likes":6,"total_comments":13},{"id":"172338516139198_1083705228335851","from":{"name":"Mohamed Elsherif","id":"10158483817400314"},"message":null,"caption":null,"description":"الحلقة 43 من راديو اسأل مطور, في هذه الحلقة نناقش مشاكل احتفاظ الشركات التقنية بالبيانات الشخصية و استهداف الحكومات و الأجهزة الأمنية لها و نناقش بعض الأخبار التقنية التي حدثت و المتعلقة مثل مطالبة ال FBI لشركة Apple لكسر تشفير أحد أجهزة iPhone و الذي تم اصدار حكم محكمة لالزام الشركة بهذا و على اثره قام Tim Cook المدير التنفيذي للشركة باصدار خطاب مفتوح لمستخدمين التكنولوجيا.\nhttp://www.apple.com/customer-letter/\n\nأيضاً تحدثنا عن موضوع Where is The Fair Use #WTFU و الذي اثير مؤخراً على يوتيوب\nhttp://amreldib.com/linkblog/WhereIsTheFairUse\n\nو أيضاً صدر العدد الثانية من Ask Developer LinkSheet يمكنك الحصول عليها هنا\nhttp://amreldib.com/linkblog/AskDeveloperLinksheet2SelfParking3DPrintedBuildings\n\nالعدد الأول\nhttp://amreldib.com/linkblog/AskDeveloperLinksheet1LateAsAlways\n\nاشترك في قناتنا على يوتيوب و تابعنا على فيسبوك\nhttp://fb.com/askdeveloper\nhttp://soundcloud.com/askdeveloper\nhttp://www.askdeveloper.com\nhttp://youtube.com/bashmohandes","created_time":"2016-02-21T08:43:40+11:00","total_likes":9,"total_comments":0},{"id":"172338516139198_1083527208353653","from":{"name":"Shady Atef","id":"10210653485386787"},"message":"مساء الخير..  اللي عايز يبتدي في big data يبذأ منين ؟","caption":null,"description":null,"created_time":"2016-02-21T03:04:36+11:00","total_likes":8,"total_comments":9},{"id":"172338516139198_1083775744995466","from":{"name":"Eslam Nawara","id":"1792334344427042"},"message":"My first post and first GitHub reference implementation as part of a technical blog initiative.\n\nI've been discussing the elements in that post with many other bright team members and I thought of putting it together for broader review.\n\nI hope you find it useful -- although it's a bit long :-)\n\n","caption":"architectworks.ghost.io","description":"Introduction Building modern applications adds different set of requirements than traditional old ones. Because modern applications serve potentially thousands to millions of users, the need to be fast performing and highly available is no longer a luxury. In addition, applications business span is…","created_time":"2016-02-21T12:23:00+11:00","total_likes":9,"total_comments":1},{"id":"172338516139198_1070839012955806","from":{"name":"Mohamed Eldishnawy","id":"10154966737859462"},"message":"Hi Guys, i am a fellow Egyptian Entrepreneur living in Finland. If any of you accustomed, knows about, or loves data science, and know what is \"data taxonomy\" by heart, be in touch with me (comment here). I was pleased to hear about that group from someone, and checking the stuff here, proves again that Egypt have a lot of skilled and smart people. So lets unit somehow! :). Just as a hint, this is not a job post, or something. I am working with some other colleagues on a project related to data taxonomy, and wondered, if anyone in Egypt have interest, or work on such field","caption":null,"description":null,"created_time":"2016-01-31T00:27:50+11:00","total_likes":6,"total_comments":5},{"id":"172338516139198_1080892695283771","from":{"name":"Ahmed Badawy","id":"1285105998248677"},"message":"انا عندى مشكلة ديما مع ال js انا لقيتنى يحتاجها كتير فاتعلمت الاساسيات بها قعدت مدة بستخدم ال jquery و بعدين ذاكرت ال anjularjs واشتغلت بيه فترة. مشكلتى الرءيسية انى مش عارف ابقى احسن js ازاى. انا معقول فيها بس فى اكواد كتيييير عل github بحاول افهم source code بتاعها بس مبعرفش لانه متطور جدا بالنسبالى. و بالتالى اما بتقابلنى مشكلة ما بحاول الجء لاى حاجة غير ال js. \nسؤالى هنا. ازاى احسن نفسى فى الjs عشان افهم اكواد الناس الى فال github. هل فى اسلوب او approach معين فى الدراسة ليها انتوا بتستخدموه ؟\n و ياريت لو تذكرو الاماكن الى درستوه منها لانى تايه اوى بالنسبة لل js. الكورسات كتييير و الفيديوهات اكتر و كذلك الكتب مش عارف ابدء بايه و اعمل ايه بالظبط...","caption":null,"description":null,"created_time":"2016-02-16T14:53:24+11:00","total_likes":25,"total_comments":21},{"id":"172338516139198_1083343135038727","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":"السلام عليكم\n\nمن فضلكم عندى عميل اشترى دومين نهايته org.eg - المشكلة انى مش عارف اشغل الدومين ده على جوداداى او arvixe - هل الدومين ده لازم يشتغل على هوستنج معين ؟\n\nمع العلم انا شغال .net","caption":null,"description":null,"created_time":"2016-02-20T20:38:22+11:00","total_likes":1,"total_comments":9},{"id":"172338516139198_1079129902126717","from":{"name":"Ahmed Mohamed Abd El-Hamid","id":"827049870776926"},"message":"السلام عليكم ورحمة الله وبركاته\nبعد اذن حضراتكم يا بشمهندسين\nكنت عايز أعرف اذا عايز أبدأ في مجال ال Information Security أبدأ ازاي ؟؟\nهل في خطوات معينة مناسبة الواحد ممكن ياخدها عشان يوصل لمستوى كويس في الاساسيات ؟؟\nومحدش يقوللي دور على الانترنت دورت كتير ومستفدتش حاجة في الآخر محدش كاتب حاجة مفيدة وبدور على مواقع بالانجليزي مش عربي\n\nيا ريت اللي يرد يكون عنده خبرة في الموضوع عشان يقدر يفيدني .. واللي يعرف حد اتخصص في المجال ده يعمل له منشن رجاءا\n\nوشكرا مقدما","caption":null,"description":null,"created_time":"2016-02-13T13:47:12+11:00","total_likes":6,"total_comments":15}]}