{"posts":[{"id":"172338516139198_929821507057558","from":{"name":"Ali Badr","id":"1834716980132754"},"message":"Greetings geeks \n\nLately , i found my self interested in game developing , so i wanna know what path should be taken in order to be a game developer ?","caption":null,"description":null,"created_time":"2015-04-22T20:12:04+10:00","total_likes":0,"total_comments":13},{"id":"172338516139198_930750296964679","from":{"name":"Meligy","id":"10154884040385170"},"message":"Anyone experienced with a good WordPress duplicator plugin that actually works and would recommend it to me?\n\n.\n\nI'm working on some theme changes for my WordPress blog. I got a local environment easily with bitnami installers. Now I'd like to test some of my posts using the theme in a local environment.\n\nI'd love to be able to install a plugin on my production site, get a ZIP file, install the same plugin on my dev (local) site, upload the zip file, and get all posts, categories, tags, media files, plugins, and configurations (site + plugin) set for me.\n\nI realise I could do some file transfer and SQL crap, would love to avoid that though.\n\nDoes anyone here have a **FIRST HAND** experience with such a plugin\n(I'm obviously not looking for Google results :))","caption":null,"description":null,"created_time":"2015-04-24T19:14:26+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_930863736953335","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":"tedxcairo.parseapp.com","description":null,"created_time":"2015-04-25T00:52:48+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_930867540286288","from":{"name":"Meligy","id":"10154884040385170"},"message":"The author is an Egyptian technical company","caption":"eg.bkam.com","description":"As we were working on upgrading our PostgreSQL database servers from 9.1 to 9.3, we have found many tutorials, but we have also faced many issues that w","created_time":"2015-04-25T01:03:51+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_930864873619888","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":"www.businessinsider.com","description":"Nina Mufleh created a website that looks a lot like Airbnb's, and it talks about a lot more than just her professional experience.","created_time":"2015-04-25T00:56:06+10:00","total_likes":15,"total_comments":1},{"id":"172338516139198_930967376942971","from":{"name":"Ali Helmy","id":"10154192201495583"},"message":"happy to share some progress on the latest release I (as part of crytek) have been working on the past couple of months\n","caption":"cryengine.com","description":"First up is the new Character Tool, which combines the functionality of several previous tools (Character Editor, Animation Importer, Animation Compression Editor, DBA Editor) into one new tool, with a completely reworked and improved user interface. Also included is asset browsing for all your anim…","created_time":"2015-04-25T05:14:05+10:00","total_likes":5,"total_comments":0},{"id":"172338516139198_930992800273762","from":{"name":"Ahmed Bahnasy","id":"1270319029713569"},"message":"سلام عليكم \nالايفينت ده لي اللي ميعرفوش كان ايفينت احنا عاملينه عشان نجمع فيه كل الماتيريال اللي ليها علاقه بدراسه الويب بشكل عام\nالايفينت دلوقتي فيه ناس كتيير شاركت فيه و دلوقتي تقدروا تدخلوا وان شاء اللي هتلاقوا كل اللي هتحتاجوه عن الويب \n\nhttps://www.facebook.com/events/694991760629290/","caption":"اي حاجه تعرفها عن الويب اكتبها هنا knowledge Exchange Web solutions","description":"الفكره بسيطه اوي \nتخيل كده لو جمعنا اكبر عدد ممكن من الناس اللي عندها اي خبره في مجال الويب سواء خبره كبيره او قليله\nوكل واحد من الناس دي حط هنا كل الحاجات المفيده اللي اتعلم منها ويب \nسواء كانت youtube channel\nاو اسم كتاب كويس \nاو جروب او مدونه او موقع \nاو اي حاجه ليها علاقه بالويب وهو استفاد منها مهما كانت الحاجه دي بسيطه  اكيد في حد هيستفاد منها \nتخيل بقي ؟؟؟؟؟؟\n\nكل اللي عليك انك لو تعرف اي حاجه كويسه ممكن تفيد الناس في الويب \nاكتبها هنا علي طول عشان اكيد في ناس كتيير هتستفاد منها \nواكيد برده مهما انت كنت كويس هتستفيد من اللي الناس بتكتبه هنا \nعاوزين نجمع اكبر كميه ماتيريال ليها علاقه بالويب هنا \nعاوزين الايفينت ده يبقي مرجع لي اي حد يعرف عاوز يتعلم ويب\nعاوزين ن شير *الخير\n\n\n\n\n\n\n\n\nthe event is to Spread the knowledge of Web designing and development Techniques \nwe make this by collect all the materiel relatod to web solutions into the event \nwe need your support\nyou can share the event and invite the people who can help us","created_time":"2015-04-25T06:29:31+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_931009376938771","from":{"name":"Moataz Mahmoud","id":"1266447236802029"},"message":"For those who stay tuned to try Windows 10 :)","caption":null,"description":null,"created_time":"2015-04-25T07:16:53+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_930918356947873","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"codecapsule.com","description":"Introduction I want to make solid-state drives (SSDs) the optimal storage solution for my key-value store project. For that reason, I had to make sure I","created_time":"2015-04-25T03:07:02+10:00","total_likes":7,"total_comments":2},{"id":"172338516139198_930803303626045","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":null,"description":null,"created_time":"2015-04-24T21:47:11+10:00","total_likes":14,"total_comments":23}]}