{"posts":[{"id":"172338516139198_1343706875669017","from":{"name":"Mostafa Abdellatif Elgayar","id":"10155096840402220"},"message":"Any idea how I can deploy a Django app on GitHub-Pages with the help of Firebase?","caption":null,"description":null,"created_time":"2017-01-02T22:33:26+11:00","total_likes":0,"total_comments":6},{"id":"172338516139198_1345188868854151","from":{"name":"Mahmoud Hashem","id":"10158311848480290"},"message":"Hello Geeks community :)\n.\nWas wondering if anyone is into the \" Healthcare IT Systems & Healthcare Information Management\" ?\n.\neither a Clinician or IT professional. \n.\nMaybe interested in creating a special interest group for this area?\n.\nWhat do you think ?","caption":null,"description":null,"created_time":"2017-01-04T18:32:36+11:00","total_likes":1,"total_comments":3},{"id":"172338516139198_1344529075586797","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"سؤال بجد للناس اللى بتشتغل فى مصر بقالها فتره: هل فيه حد هنا, أو حد تعرفه إشتغل فى شركة داخل مصر وقعد فيها فترة ولم يشتكي من سوء الإدارة؟\nوالمقصود بالإدارة هنا من أول مديرك المباشر وقدرتة على إدارة العمل وتأثيره فى العمل (سواء تأثيره بالسلب أو ضعف شخصيته ف ملوش تأثير إيجابي) وإنتهاءً بال CEO.\n\nبالطبع أغلبنا ممكن يتفق إن سوء الإدارة فى الشركات فى مصر يعتبر من أسوأ الحاجات اللى ممكن الواحد يعاني منها, ودا يرجع ساعات لضعف او وهن المدير, عدم كفائته, دخول المصالح والمحسوبيه فى قرارات إدارة المكان, وما إلي ذلك من حاجات بتؤثر بشكل كبير فى نفوس الناس اللى بتشتغل فى المكان.\n\nوجزء كبير من اللي خلاني أعرض عليكم مشكلة زي دي, هي إني شفت كتير من خيرة الناس اللى اشتغلت معاهم, أو اللي اعرفهم ومكانوش شغالين معايا بشكل مباشر, بيعانوا من سوء إدارة الأماكن اللى كانوا بينتموا إليها, وأخطرها على الإطلاق, المشاكل اللى بتؤدي لأنك تتحول من شخص نشيط وحريص على مصلحة المكان وبتحاول إنك تكون مبدع فى مهام عملك وتشتغل بضمير وتحاول تجيب حلول جديدة لمشاكل الشغل بيعاني منها, لأنك تصبح شخص محبط, وغير قادر على الإبداع لأنك عانيت من مشاكل سواء عدم تشجيع مديرينك ليك فى العمل أو معاصرتك لتفضيل المديرين لأشخاص بعينهم عن أشخاص تانيين لأي سبب, أو لضعف كفاءة أصحاب القرار داخل الشركه انهم يشوفوا جدوي من اللى بتحاول تقدمه كمقترح جديد سواء نابع منك انت او من فريق العمل ككل.\n\nوبالتالي علشان نحاول نخلي الموضوع منظم, لو عندك تحليل أو إضافه لموضوع ضعف مستوي الإداريين وساعات ال CEOs فى مصر, حاول ترتبها وفقاً للمعايير التاليه:\n1- ايه أكثر 3 حاجات كانت بتحبطك من الإدارة فى أغلب الشركات اللى إِشتغلت فيها.\n2- إيه أكتر 3 حاجات كانت كويسه وكنت تتمني تشوفها معممه فى الشركات التانيه.\n3- لو فى ايدك تاخد قرارات شايفها ممكن تحسن مشكلة الإدارة فى المؤسسات اللى اشتغلت فيها, كنت هتتصرف إزاي؟ وإيه أهم 3 قرارات شايف إن أغلب الشركات لازم تنفذهم فى أسرع وقت؟, وإيه دوافع قراراتك دي؟\n\nملحوظه: هدفي نناقش المشكلة, مش نذكر أسماء أشخاص/شركات, فرجاء don't make it personal. :)","caption":null,"description":null,"created_time":"2017-01-03T23:12:33+11:00","total_likes":22,"total_comments":10},{"id":"172338516139198_1344130185626686","from":{"name":"Ahmed Abousamra","id":"10154800961930546"},"message":"Guys I would love to hear your opinion/experience on a problem I have been researching which is how Uber/Careem update the driver location like real time. The only obvious way I can think of that the drivers devices send their location each small interval of time like 2~5 seconds, but I know that there is a limit on the number of free requests by google. What is the best way to handle this? Is the only way to pay google for the extra requests :)? Would love to hear your experience on that.","caption":null,"description":null,"created_time":"2017-01-03T09:55:23+11:00","total_likes":16,"total_comments":15},{"id":"172338516139198_1345293438843694","from":{"name":"Alaa Ali","id":"10154999548701303"},"message":"a scholarship to attend Render conference this March.","caption":"2017.render-conf.com","description":"We’re setting aside a number of free tickets as part of our scholarship scheme. The scheme is open for all to apply to, and chosen applicants will receive access to all content, food, drink and all the extras.","created_time":"2017-01-04T21:50:40+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1345040478868990","from":{"name":"Osama Soliman","id":"709206249239999"},"message":"If you like Javascript you will love this channel","caption":"youtube.com","description":"In this YouTube channel I publish \"creative coding\" video tutorials every week. Subjects covered range from the basics of programming languages like JavaScri...","created_time":"2017-01-04T13:30:56+11:00","total_likes":7,"total_comments":0},{"id":"172338516139198_1344904885549216","from":{"name":"Essam A. Hassan","id":"1246324408754353"},"message":"Me and many friends of mine always want to write opensource projects to support or fulfill specific needs and help other software developers ( and not just our daily needs ) and all of us have the same issue addressing the real needs of the market so we can build the right software and help more people\n\nI'm pretty sure some of you had the same issue and you end up writing only the libs and services you need\n\nhow do you think we can solve that? how can OSS devs address the needs of the market and write the right solution? do you think there should be a place for that?\n\nP.S: One of the proposed options is contributing to ongoing projects but I don't think this is solving the whole issue.","caption":null,"description":null,"created_time":"2017-01-04T09:22:53+11:00","total_likes":4,"total_comments":2},{"id":"172338516139198_1345030932203278","from":{"name":"Eslam Mohamed","id":"1316030208462594"},"message":"صباح الخير يا شباب\nمحتاج tool اقدر اعمل بيها Analysis علي ملف فيه Text والنتيجة تطلع بأكتر الكلمات المتكررة وعدد مرات تكرارها\nحد يعرف حاجة زي كدا؟","caption":null,"description":null,"created_time":"2017-01-04T13:09:19+11:00","total_likes":0,"total_comments":11},{"id":"172338516139198_1345638318809206","from":{"name":"Hassan Saad","id":"303806276703088"},"message":null,"caption":null,"description":"عندنا خبرين ، واحد حلو و واحد وحش :3 \n\nوكالعادة نبدء بالوحش :P \n\nالخبر الوحش : ان احنا المفروض كنا نزلنا كورس قبل كده على اليوتيوب اسمه Advanced Penetration Testing بس للاسف الكورس مكملش عشان كان فيه Gap مابين مستوى بعض الناس و مستوى اول Two Levels منه عشان كده اضطرينا اننا نوقفه نظرا لان الغالبية العظمى مش مستفيدة وحسينا اننا المفروض كنا ننزل Levels  اقل من كده شوية فى الاول وبعدين كنا ممكن ننزل الكورس كده فا ده كان سبب ليه احنا وقفنا الكورس ده عشان فى خلال الفترة ديه كنا بنحاول نشوف حل للموضوع ده فا وصلنا لاننا لازم ننزل كورس تانى قبل ما نكمل الكورس دع ويكون الكورس للـ Beginners اكتر , بحيث يوفر ليهم بعض ال Basics of Linux فى الاول عشان يقدروا يفهموا الكورس الـ Advanced شوية , وده فعلا ال عملناه , الحمد لله حاليا وانت بتقرء البوست ده , في كورس اترفع فعليا على ال Channel بتاعتنا على اليوتيوب بيشرح Linux Basics للناس ال عندها مشكلة فى الحتة ديه ^_^\n\nوالخبر الحلو بقه اننا حنرجع تانى نكمل الكورس الـ كنا بدءناه\n\nفا الناس ال عيزه تبدء من الاول بقه فا حيكون التسلسل كالأتى :- \n\nاول حاجة تدرس كورس الـ Linux Basics ده وبعدين تقدر تروح تدرس كورس Advanced Penetration Testing \n\nالمفروض الـ احنا حنبدء نعمله بقه من هنا ورايح اننا نمسكAttack Attack ونحاول نفهم كويس ايه الـ Mechanism الـ شغالة بيه وبعدين نطبقها عملى عشان نشوف تأثيرها وازاى كمان نقدر نوقفها ^_^ و طبعا لو فيه اى Attack مترتبة على Knowledge تانية قبليها فا الاول لازم طبعا نشرح الحاجة دى الاول , فا ان شاء الله الموضوع حيكون ممتع جدا ان شاء الله ^_^\n\nوالكورس ده حيكون فيه جزء قدام شوية عن الـ Exploit Development وكمان حيكون فيه جزء عن الـMalware Analysis and Forensic فا ان شاء الله حيكون كورس مفيد جدا و ممتع جدا و تقريبا ده حيكون اول كورس على النت عموما بيشرح الحاجات دى بالعربى ، ولو حد يعرف حاجة بتشرحهم بالعربى ياريت يسيبلنا لينك فى الكومنتات :3 دمتم يخير ^_^\n\nChannel : https://www.youtube.com/c/NineHackers\n\nLinux Basics : https://www.youtube.com/watch?v=a-BgUxDa1vo&list=PLzTb6KlnGyi3qTGSxDY4AuLws1j-kdGt5\n\nAdvanced Penetration Testing : https://www.youtube.com/watch?v=_kG6p7rfIeY&list=PLzTb6KlnGyi2G4DYc7vFKcGYiDV12lllF","created_time":"2017-01-05T06:27:57+11:00","total_likes":6,"total_comments":0},{"id":"172338516139198_1341935205846184","from":{"name":"Anas Emad","id":"10154264552927478"},"message":"واحد صاحبي عامل ابلكيشن طبي مدفوع علي جوجل \nو عاوز يعرف ازاي اعرف ان كان الapk المتسطب ده نازل من متجر جوجل سواء بعملية شراء او لأ ولا نازل من النت بشكل غير قانوني \nلان فيه مواقع و ناس بتشتري النسخة المدفوعة و تنزلها و تعيد رفعها علي مواقعهم تاني و يعمل ريفيند مثلا \nايه تجاربكم العملية في الموضوع ده ؟","caption":null,"description":null,"created_time":"2016-12-31T23:34:50+11:00","total_likes":9,"total_comments":13}]}