{"posts":[{"id":"172338516139198_916543438385365","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"If you wanna do animation, Do it Right!","caption":"medium.com","description":"Over-animated interfaces can have a negative impact on the user experience, but subtle and invisible animation can impro…","created_time":"2015-03-29T15:31:19+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_916318585074517","from":{"name":"Tamer Ahmed","id":"10153746998237614"},"message":null,"caption":null,"description":"تأثير الثقافة المصرية على الشركات الناشئة\n\nمؤشر التساهل مع النفس\nمش قلت لكم مافيش فايدة ؟\n\nالمؤشر السادس لهوفستيد\n\nمحسن بيه : آنا حاسس الناس بقت كئيبة قوي يا رأفت\nرأفت : ابدا يا باشا هما كده طبيعي\nمحسن : ما بقاش في أفكار جديدة و كل كلامهم بقى عن ان الشركة مش عاجباهم\nرأفت : يأفندم احنا كل شهر بنعمل جايزة الموظف المثالي\nمحسن : ايوه و بيكسبها الواد عاطف بتاع البوفيه انا عايز أعرف ليه الواد ده بيكسب دايماً ؟\nرأفت : آصله كوميدي و بيضحك الناس كلها\nمحسن : بيضحكهم يعني بيضيع وقتهم !!! أرفد عاطف يا رأفت !!!\n\nموعدنا في هذا المقال نتحدث عن المؤشر السادس لهوفستيد وهو ما يطلق عليه مؤشر التساهل مع النفس و كيف يتعامل المجتمع مع رغباته و مشاكله\n\nالمقالات الخمسة السابقة\n\n المقال الأول \nhttps://www.facebook.com/permalink.php?story_fbid=766304380119384&id=747640815319074&substory_index=0\nو المقال الثاني\nhttps://www.facebook.com/permalink.php?story_fbid=770879682995187&id=747640815319074&substory_index=0\nالمقال الثالث\nhttps://www.facebook.com/permalink.php?story_fbid=772570776159411&id=747640815319074&substory_index=0\nالمقال الرابع\nhttps://www.facebook.com/permalink.php?story_fbid=782025645213924&id=747640815319074&substory_index=0\n\nالمقال الخامس\nhttps://www.facebook.com/permalink.php?story_fbid=783012671781888&id=747640815319074\n\nو كلما انخفضت قيمة المؤشر فذلك يدل على مجتمع منغلق يحاول كبح جماح أي أفكار جديدة تأتي لمواطنيه و كلما أرتفعت قيمة المؤشر فذلك يدل على مجتمع يتساهل مع رغبات مواطنيه و يتعامل معها بما يجعل المجتمع أكثر أنفتاحاً و تقبلاً لأفكار جديدة\n\nو كما رأينا في المؤشر الخامس المعبر عن النظرة المستقبلية فسنجد ان مصر تسجل رقماً (4) هو ثاني أقل دول العالم في هذا المؤشر\nمما يدل على مجتمع يميل للتشاؤم و السخرية من أوضاعه (كل حاجة بنقلبها نكتة) و كذلك فهو مجتمع لا يعرف كيف يقضى أوقات فراغه (الويك اند بنقضيها في الشوبنج و مذاكرة الأولاد)\nالمجتمعات ذات المؤشر المنخفض تميل لكبح كل رغبات افراد المجتمع مما يجعل افراد المجتمع انفسهم يشعرون بأنهم مطالبون بتعذيب ذاتهم وجلدها كلما استطاعوا لذلك سبيلاً !!! ولو تهاونوا في ذلك فسنجد ان المجتمع نفسه يتطوع من أجل ان يقهرهم و يعيدهم لحظيرة الأنغلاق\nلذلك فسنجد اننا الشعب الوحيد في العالم الذي يقول عندما يضحك كثيراً (خير اللهم أجعله خير) !!! وكأن مجرد الضحك هو مقدمة لما قد يكون أسوأ !!!\n\nبينما في الدول ذات المؤشر المرتفع مثل أستراليا (71) سنجد ان المجتمع يميل للتفاؤل و مبدأ ان هناك وقت للعمل و وقت للمرح وكذلك سنجد ان نظرة الناس تميل للأيجابية و التفاؤل ولذلك فهم يخصصون وقت فراغهم للأنشطة الترفيهية (الشاطيء و التنزه) و كذلك هناك جزء مخصص من أموالهم لهذه الأنشطة دائماً\n\nو الآن كيف يوثر ذلك على الأقتصاد و الشركات الناشئة ؟\n\nلو كان نشاط شركتك يتعلق بالكوميديا في أي صورة فلديك فرص جيدة (صفحة أصاحبي ) ولو تخصصت في الكوميديا السوداء فأنت تزيد من فرص النجاح\nعلى الجانب الآخر فأنت تعاني بشده مع التشاؤم الذي يميل لأحباطك من أي أفكار جديدة (حنفشل كلنا) و (مافيش فايدة) وهذا مبدأ في المجتمع يجعل الأستثمار المخاطر في الشركات الناشئة شبه معدوم\n\nأما لو كان نشاطك ترفيهياً و يتعلق بقضاء أوقات فراغ جيدة فستعاني بشدة (جميع مدن الملاهي و الترفيه في مصر تعاني بشده اقتصادياً) و زيارة سريعة لأي من تلك المشروعات في غير اوقات الأعياد سيفاجئك بأن المدينة شبه فارغة دائماً و هذا من الزسباب الرئيسية لمعاناة الفنادق و المنتجعات السياحية في مصر عندما تنخفض اعداد السائحين القادمين من الخارج و بالتالي لو كنت فندقاً صغيراً تستهدف المصريين و السياحة الداخلية فلا تعول كثيراً على ذلك لأنك لن تجد أشغالاً من المصريين سوى في الأعياد و المناسبات !!\n\nو أخيراً فأن كبح جماح المرح و تحويل الناس لماكينات تعمل بلا روح يؤثر سلبياً على بيئة العمل و يجعلها تميل للتقليد و التكرار و تقلل فرصة استولاد أي أفكار جديدة و مبتكرة\nفالعقول التي لا تجد متنفساً لا تستطيع ان تتنفس أفكار جديدة\nفهي لا تولد أفكار جديدة\n\nولا تستقبل أفكار جديدة !!!\n\nأرفد عاطف يا رأفت !!!\n\nو هكذا فقد قدمنا كل موشرات هوفستيد في هذه السلسلة\n\nو يبقى لنا مقال وحيد سنناقش فيه مقارنة بين دول مختلفة في الست مؤشرات معاً و كيف يؤثر ذلك في أقتصادها و كيف يمكننا ان نستخدم مؤشرات هوفستيد من أجل التسويق و تقديم منتجات جديدة لأي سوق","created_time":"2015-03-29T05:29:38+11:00","total_likes":7,"total_comments":1},{"id":"172338516139198_916545415051834","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"code.ciphertrick.com","description":"In my last post we had learned the basics of creating a custom directive in angular js. In this post we will learn how we can attach a controller to a directive and also to isolate scopes in directives. If you are just getting started on directives and have no idea what I've said in the above","created_time":"2015-03-29T15:39:41+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_916349818404727","from":{"name":"Ahmed Fathalla","id":"10158253090550262"},"message":"For those who missed it, here is video recording of the Ask Developer Hangout where we discussed an Introduction to Source Control in Git. Thanks Mohamed Elsherif for hosting this\n\n","caption":"youtube.com","description":"The weekly hangout for Egyptian Geeks Developers. The Event time 08:00 PM Cairo Local Time 11:00 AM US (Pacific Time) 02:00 PM US (Eastern Time) اللقاء الأسب...","created_time":"2015-03-29T06:56:04+11:00","total_likes":14,"total_comments":1},{"id":"172338516139198_916616478378061","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"http://sixrevisions.com/resources/websites_for_web_development/","caption":"sixrevisions.com","description":"Here's some of the websites I keep track of to find new techniques, resources, and news about building websites","created_time":"2015-03-29T20:13:33+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_916630328376676","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"a poster which demonstrates the request life cycle in ASP.NET WebAPI 2.\n\nhttp://www.asp.net/media/4071077/aspnet-web-api-poster.pdf","caption":null,"description":null,"created_time":"2015-03-29T20:40:59+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_916545498385159","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Blocking the rendering of the content due to web fonts is disrespectful, annoying and unnecessary. Show content in fallback font first, load Web fonts later. And it’s not difficult to achieve either. Store fonts in localStorage or just use WebFontLoader: https://github.com/typekit/webfontloader. One-time-font-switch is OK.\n\nThere’s nothing more annoying than knowing that the content is already available but blocked due to heavy Web fonts.﻿","caption":"github.com","description":"webfontloader - Web Font Loader gives you added control when using linked fonts via @font-face.","created_time":"2015-03-29T15:40:10+11:00","total_likes":2,"total_comments":2},{"id":"172338516139198_916671021705940","from":{"name":"Mohamed Said","id":"10154262557095952"},"message":null,"caption":"sitepoint.com","description":"The survey is complete and the data has been crunched - which framework is the most popular PHP framework of 2015? Tune in to find out.","created_time":"2015-03-29T23:03:12+11:00","total_likes":6,"total_comments":0},{"id":"172338516139198_916610821711960","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"Although this article is published on 2012, but it's still relevant to today's challenges, and I encourage everyone to see what s/he is missing and then move on to cover those 10 things.","caption":"lifehacker.com","description":"No matter how tech savvy you are, there are certain things every one of us has to deal with when using a computer—and we don't always deal with them in the most efficient ways. Here are 10 things that everyone can (and should) learn to keep their computer fast, safe, and easy to use.","created_time":"2015-03-29T20:03:10+11:00","total_likes":4,"total_comments":4},{"id":"172338516139198_916977408341968","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"I think this needs to be translated and simplified for non tech-savvy users :)","caption":"digitalsecurity.intel.com","description":"We click and tap hundreds of times a day. It’s such a muscle memory, that sometimes we click on things without properly looking at them. Because almost 95% of all hacks in 2013 were caused when users unknowingly clicked bad links, one could easily argue that the love of clicking is the root of all o…","created_time":"2015-03-30T10:02:39+11:00","total_likes":3,"total_comments":9}]}