{"posts":[{"id":"172338516139198_724281317611579","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"http://ipython.org/ipython-doc/dev/whatsnew/version2.0.html","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-04-02T11:36:50+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_724284260944618","from":{"id":"578241053","name":"Hussien Elmaydome"},"message":"مطلوب مبرمج asp\n- خبرة فى C#.\nMS SQL server, T-SQL. \nASP.net web forms, ASP.net MVC is preferred.\n- خبرة فى التعامل مع Html 5, CSS2,3, Javascript, .net code, Jquery\n- التعاون مع فريق الشركة\nملاحظات:\n- العمل فى مقر الشركة القاهره - الجيزه\n- نرجو ارسال السيرة الذاتية وسابقة الأعمال على الايميل: Sameh@tech-world.ws\n- الراتب يحدد علي حسب الخبره وبعد المقابله","caption":null,"description":null,"created_time":"2014-04-02T11:51:33+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_724345804271797","from":{"id":"100002623936802","name":"Ahmed PiTech"},"message":"Are you working on a graduation project!\nHave a project idea!\nWant to create team!\nCan't manage a timeline!\n\nDon't worry; Give us that responsibility, let us to re-arrange your thought.\nYou are invited to our FREE session \"Project Management\" on Sunday 6th April 2014 in Tanta University, Faculty Of Engineering.\nHall (21)\nLearn how to manage your project in a professional way.\n\nRegister Now @ http://foe.pitechnologies.net/\ndon't forget to receive your code","caption":null,"description":null,"created_time":"2014-04-02T14:51:58+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_723841117655599","from":{"id":"661261340","name":"Mohammad Tayseer"},"message":"DjangoPackages.com is a list of reusable apps/components/projects for the web framework Django. It allows you to compare some packages around a certain topic (as you see in the link).\nAre there similar things for other systems (NodeJS, .net, etc)? Please share if you know","caption":"www.djangopackages.com","description":"This page lists a few well-known reusable Content Management System applications for Django and tries to gather a comparison of essential features in those applications.","created_time":"2014-04-01T13:58:36+03:00","total_likes":1,"total_comments":2},{"id":"172338516139198_724392020933842","from":{"id":"540788204","name":"Ahmed Hassan"},"message":"فقط في مصر","caption":"شكرا لصديق الصفحه\n Mahmoud Osama","description":"ههههه","created_time":"2014-04-02T17:16:48+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_724141144292263","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-04-02T02:14:54+03:00","total_likes":0,"total_comments":4},{"id":"172338516139198_724472780925766","from":{"id":"1055914266","name":"Hady Ahmad"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-04-02T21:06:24+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_724472784259099","from":{"id":"537890257","name":"Ahmed Magdy"},"message":"We are looking for a talented and creative web designer to join our web design and development team.\nWeb design work will include:\nCreative website designs which reflect a product/clients brand, images, and other graphics for the websites. Designing layouts, colour schemes, fonts and a combination of text, audio, image and video selection. Converting those designs to Html,css format.\nRequires knowledge and experience in the following:\n-1-2 Years of Experience\n-Adobe Photoshop,Adobe Illustrator\n-Html,CSS3, Jquery, Javascript.\nPlease send your CV and Portfolio to ahmed@logic-designs.com with the subject set as \"Web DESIGNER\". Please include your Portfolio","caption":null,"description":null,"created_time":"2014-04-02T21:06:25+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_724010210972023","from":{"id":"100000116116716","name":"Mohamed Sameeh Sharaf"},"message":"انا مش خريج هندسة و بشتغل في الاي تي ، تفتكر في ليا مجال...","caption":null,"description":"ارفع راسك فوق ، انت خريج تجارة (او اي كلية تانية مش هندسة)\nبكيبورد : محمود سعيد ، مصمم الحلول البرمجية ، اي ام سي مصر Solution Architect – EMC Egypt \n\nمقدمة بكيبورد : محمود مجدي\n\nامبارح جالي السؤال المعتاد ، انا مش خريج هندسة و بشتغل في الاي تي ، تفتكر في ليا مجال...\n\nبرضوا السؤال ده بتسأله كتير و كنت بدي اجابة اي كلام صراحة ، بحفز و بقوله لاء طبعا ملهاش علاقة بس مفيش حاجة و رد قوي، قررت انه اقف وقفة مع النفس كده و ارد بما لا يقطع مجالا للشك للسائلين من هنا و الى ابد الابدين في الموضوع ده.\n\nبس قولت مش انا اللي حكتب الاجابة، انا عايز حد يكون هو خريج حاجة مش هندسة علشان يرد ، دورت في قائمة معارفي و اصحابي لقيت 4 ينفع يكونوا احسن ناس ترد على الموضوع ده:\n- محمد مرزوق – محمد خريج تجارة و شغال في مايكروسوفت الشرق الاوسط Senior Consultant\n- محمد سعد و هو خريج اداب و شغال في مايكروسوفت امريكا Technical Sales Professiona (ايوة يا معلم في ناس خريجي اداب و تجارة و اشتغلوا في مايكروسوفت و وصلوا لمايكروسوفت امريكا)\n- احمد طه و ده خريج تربية موسيقية و بيشتغل في اي بي ام\n- محمود سعيد و هو كان شغال في مايكروسوفت و راح دلوقتي EMC\n\nالاربعة ميتخيروش عن بعض ، بس بما ان وصولي لسعيد اسرع فشرحتلوا الموضوع و هو مشكورا كتب الرد ، مش حعطلكوا بقا و مع مقال محمود (و اللي يقولك بعد كده حاجة اسمها كليات القمة ، اخرم عينه و عليك ان تراعي صلة الرحم و متتهورشي).\n\nمحمود كتب التالي:\n\n\"أعمل ما تحب , حتى تحب ما تعمل\" اه!!! ومش العكس (حب ما تعمل , حتي تعمل ما تحب) في راي الشخصى المتواضع اعتقد ان ده اهم عنصر من عناصر النجاح لاي شخص في اي مجال و ده طبعا متزامن في نفس الوقت مع \"بذل الجهد المطلوب والتوكل علي الله عز و جل وحسن الظن فالمردود حتي و لو كان علي عكس الاهواء\" و ممكن نضرب مثال واقعى هنا عليه انا شخصيا:\n\nالبدايه كانت من اكتر من 24 سنة ,حوالى 1988م  لما اتعاملت مع اول جهاز كومبيوتر فالبيت و هوا الجهاز الخاص باحد اخوتى و من هنا بدأ ال باشن\" Passion  اوالشغف , ان مجال الحاسبات او ال IT هوا هيكو ن مجال \"شغلي\" ان شاء الله , و جت الثانوية العامة و مجبتش مجموع كلية هندسة وكانت خيبة امل ليه و لافراد اسرتي و دخلت كلية التجارة و بعد سنتين من الدراسة جبت اول جهاز كومبيوتر خاص بى و ده كان سنة 2000م  ومن هنا بدئت اذاكر حاجات متعلقة بالـ IT و لما الكلية خلصت و كنت مستني الخدمة العسكرية و كانت وزارة المعلومات و الاتصالات بدات فطرح منح الاي تى و كان نصيبى اني التحقت باطول المنح بعد اجتياز الاختبارات الخاصة (من 5000 متفدم ,121 بس اتقبلوا) من جامعة NBU الكندية و فى اخر الدراسة اتيحت ليه الفرصة انى ادرب في سنرجى (لييج او جلوبل نولدج دلوقتى) ثم الاتحاق بالعمل معهم لاربع سنوات تقريبا , ثم سنة و نصف تقريبا مع رقميات فالامارات ثم مع ميكرسوفت مصر لحوالى خمس سنوات , ثم ميكرسوفت جلف لسنة و نصف تانية و اخيرا و ليس باخر (ان شاء الله) أي أم سي.\n\nانا شخصيا لو جيت رجعت الشريط من الول و جيت شوفت الواحد كان موفق في ايه و ايه اللي ممكن اشاركة مع الشباب اللي لسه بيبدأ طريقة , ده هيبقى فالنقاط المختصرة التالية (كلها حصلتلي) و لاي مشورة مفصلة علشان مطولش عليكم , ارجوالتواصل على: http://buff.ly/1mHHeKO\n• تطبيق قاعدة \"اعمل اللي بتحبه\"\n• اخذ المشورة من الاشخاص الموثوق فيهم وفي خبراتهم قب لالقدوم على الخطوات او القرارت المصيرية.\n• عدم التوانى في بذل الجهد المطلوب , لان من جد و جد.\n• استثمر فى نفسك حتى لو مفيش مردود مادي فالوقت القصير.\n• عدم الاستماع للكلام المثبط للهمم زاي (انت مش خريج هندسة, بتوع هندسة لو كانوا فالحوا مكنوش داخلوا مجال الIT (بهزر طبعا , لان اعتقد في مجال ال IT الدراسة الجامعية لكل واحد فينا سواء كانت هندسة, طب, تجارة,الخ ساعدته في حياته  العملية فال اي تى بشكل مباشر او حتى غير مباشر, فهيه فالاخر اضافة\n• اعرف امتي تقول \"لا\" فالوقت المناسب , و لو معرفتش تطبق النقطة رقم \"2\"\n• اهم نقطة , حسن الظن فالله من انه لايضيع اجر من احسن عملا.\n\nطولت عليكم و شكرا.\n\n========\nمحمود سعيد خلص و انا احب اضيف شوية ملاحيظ في الهامش:\nفي ناس حتخرج كلامنا من سياقه ، احنا مش بنقلل من اي كلية و لا بنرفع من اي كلية ، مش تقليل من خريجي هندسة او كومبيوتر او اي حاجة ، بس لانه في ناس كتير منضموش للكليات دي لاسباب كتير ، محدش من الكليات يعتبر الكلام ده اهانة او تقليل لانه ده ليس الهدف و لا الغرض\nاللي حيقول انه الكلام ده بس عندنا ، حرد انه من 3 سنين انا كنت في تركيا باخد كورس و اللي بيدينا الكورس كان شغال في http://buff.ly/1mHHhpT و كان خريج فلسفة و معاه دكتوراه في الفلسفة بس معجبوش الموضوع و اشتغل في ال IT و كان Senior Architect و لسه جاي من مشروع في الناتو (هو بريطاني و شغال في شركة امريكي)\n\nاعتقد انه الامثلة و الكلام اللي فوق ده كافي لأي حد خريج اي حتة انه توصله الرسالة ، مفيش حاجة اسمها كليات القمة الطريق مفتوح للكل ، متخليش حد يعجزك ، ممكن اهلك مش شايفين او مش عارفين، خد كلامهم براحة بس متتكسرشي جوا نفسك ، دوووووووووووس يا برنس و ارفع راسك فوق يا برنجي","created_time":"2014-04-01T20:23:10+03:00","total_likes":9,"total_comments":17},{"id":"172338516139198_724493684257009","from":{"id":"1437802222","name":"Ahmad El-Melegy"},"message":"للمهتمين بمجال الـ Game Development","caption":null,"description":null,"created_time":"2014-04-02T21:56:22+03:00","total_likes":1,"total_comments":0}]}