{"posts":[{"id":"172338516139198_913602858679423","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Mohamed A. Baset","caption":"phys.org","description":"Name any of the big browsers and there's an exploit for it. All four major browsers fell down during the Pwn2Own hacking competition running concurrently with the CanSecWest 2015 Conference in Vancouver, British Columbia. That meant showdowns on Internet Explorer, Chrome, Safari and Firefox. All fou…","created_time":"2015-03-23T11:25:09+11:00","total_likes":8,"total_comments":3},{"id":"172338516139198_913236702049372","from":{"name":"Ahmed Elsayed Shahawi","id":"1317342155017349"},"message":"مفهوم ال Unit Testing بشكل مبسط مع مثال.","caption":"alshahawi.wordpress.com","description":"في برمجة الكمبيوتر ، اختبار الوحدات (Unit Testing) هي طريقة لاختبار اجزاء البرامج المكونة من Classes , Units, Components , Libraries  , etc ، وذلك لتسهيل عملية اقتناص الاخطاء من البرنامج. لتدرك عزي...","created_time":"2015-03-22T19:42:48+11:00","total_likes":12,"total_comments":4},{"id":"172338516139198_913844261988616","from":{"name":"Kareem Elansary","id":"10155149930945530"},"message":"open google chrome\nright click on anything -> inspect element\nleave the element highlighted then go to console\ntype -> el = ($0)\nthen type -> inspect(el)","caption":null,"description":null,"created_time":"2015-03-24T00:56:27+11:00","total_likes":9,"total_comments":3},{"id":"172338516139198_913807441992298","from":{"name":"Kareem Elansary","id":"10155149930945530"},"message":"THIS IS AWESOOOOOOOOOOME!","caption":"youtube.com","description":"Demo of Scoop, a command-line installer for Windows.","created_time":"2015-03-23T23:20:26+11:00","total_likes":5,"total_comments":5},{"id":"172338516139198_913945388645170","from":{"name":"Ahmed Zain Mohammed","id":"10155252594718081"},"message":"Hey guys,\n\nThis is my first post ever here, hope to make some friends :)\n\nAnyway, you all know about SaaS solutions, i was wondering; is there is ANY Arabic SaaS apps ? I keep saying to myself \"Well, of course there are, many\", but nothing ever pop up to me online!\n\nI just finished one BTW, it's called \"Tamkeen\", it's a learning management Web App for training centers/academies, delivered as an online service.\n\nHope you have sometime to check it out and give me your feedback :) \n\ntamkeenlms.com\n\nThe #1 problem i am facing in MENA is that people are not open minded enough about the idea itself, i always get this from clients: \"ammm ... and MY DATA will be on your servers! \"\n\nSaaS solutions are just awesome for both the customer and the provider, but how can we help push the trust of the targeted customers to accept it and see its pros ?! Any one has any expertise in this area ?","caption":null,"description":null,"created_time":"2015-03-24T05:17:33+11:00","total_likes":2,"total_comments":4},{"id":"172338516139198_913348142038228","from":{"name":"Meligy","id":"10154884040385170"},"message":"شت - أنا عندي نفس المشكلة دي **و محتاج علاج**\n\n(باستثناء اني بطلت أحمل أغلب الوقت، إلا كتب أحيانا - بأضمن مكاني في الكورس من دول بالكوبون المجاني قبل ما يروح بعدين ما أشوفوش)","caption":"amnaymag.com","description":"ضحكة تقنية : هوس و مرض تحميل و تخزين الكورسات و مشاركتها","created_time":"2015-03-23T01:00:20+11:00","total_likes":23,"total_comments":25},{"id":"172338516139198_914234025282973","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"Awesome demo showing the power of http/2\nThe impact is HUGE","caption":"http2.akamai.com","description":null,"created_time":"2015-03-24T20:42:52+11:00","total_likes":18,"total_comments":5},{"id":"172338516139198_914020661970976","from":{"name":"Biga Gaber","id":"1454091814622301"},"message":"Hi Geeks,\nI need your help.\nI'm preparing for a presentation about \" the beauty of javascript\"\nall what I need a small video up to 1 minute to say what is the best feature you see in javascript.\nthe deadline in 10/4/2015\nif any one interest to make this video \nplease send to me via my email \" ahmedgabr292@gmail.com \"\nthanks","caption":null,"description":null,"created_time":"2015-03-24T07:57:29+11:00","total_likes":3,"total_comments":11},{"id":"172338516139198_914362035270172","from":{"name":"Tamer Ahmed","id":"10153746998237614"},"message":null,"caption":null,"description":"الثقافة المصرية و تأثيرها على الشركات الناشئة\nآنت شايف الجبل اللي هناك ؟ \n\nمؤشر النظرة المستقبلية\n\nمحسن بيه : يا رأفت احنا انتاجنا أنخفض\nرأفت : فعلاً الماكينات عندنا قديمة و العمال و المهندسين بقوا متأخرين علمياً و عملياً\nمحسن : طيب و الحل أيه ؟\nرأفت : لازم نغير الماكينات علشان تواكب المستقبل وندرب المهندسين و العمال على تكنولوجيا حديثة\nمحسن : نغير الماكينات ماشي لكن لو دربنا المهندسين و العمال كلها شهرين و حيسيبونا و يروحوا مصانع المنافسين !!!\nرأفت : يعني حضرتك خايف تدربهم فيمشوا ؟\nمحسن : نعم\nرأفت : طيب افرض ما دربناهمش و فضلوا ؟\n\nهذا الحوار يحدث كثير في كل مؤسساتنا وعلشان نفهم السر لابد من النظر على الموشر الخامس لهوفستيد وهو مؤشر النظرة المستقبلية Long term orientation\n\nالمقالات الأربعة السابقة ستجدون لها روابط هنا\n\nراجع المقال الأول \nhttps://www.facebook.com/permalink.php?story_fbid=766304380119384&id=747640815319074&substory_index=0\nو المقال الثاني\nhttps://www.facebook.com/permalink.php?story_fbid=770879682995187&id=747640815319074&substory_index=0\n\nالمقال الثالث\nhttps://www.facebook.com/permalink.php?story_fbid=772570776159411&id=747640815319074&substory_index=0\n\nالمقال الرابع\nhttps://www.facebook.com/permalink.php?story_fbid=782025645213924&id=747640815319074&substory_index=0\n\nهذا الموشر يعبر عن مدى علاقة المجتمع بالماضي و نظرته للمستقبل \nفكلما انخفض المؤشر كلما كان هذا دليلاً على ان المجتمع يعيش في الماضي كثيرآ متمسكاً بالتقاليد و الأعراف كما زنه ينظر بكثير من الريبة لأي تغيرات تحدث في المجتمع و توثر على الموروث الثقافي سواء كان هذا الموروث معبراً عن قيم حقيقية أم هو مجرد تقاليد (مدة الحداد أربعين يوم )\nبينما المجتمعات ذات المؤشر المرتفع سنجد انهم ينظرون للمستقبل نظرة براجماتية تميل لاستشراق المستقبل و ادراك ان هناك زمان جديد سيأتي و هو يحتاج لنوع مختلف من التعليم و التدريب\n\nنظرة على قيمة المؤشر في مصر كفيلة بأن تصدمنا صدمة حقيقية فنحن آقل ثاني دول العالم في هذا الموشر (7 من 120) وهذا الرقم المنخفض يعني آن المجتمع في مصر يبجل الماضي تبجيلاً مخيفاً و يعني انتشار قوي لثقافة عدم الأدخار (اصرف ما في الجيب يأتيك ما في الغيب)  والميل بشدة لتحقيق نتائج سريعة حيث كثيراً ما نسمع تلك الجملة Quick wins  لتعبر عن الرغبة في تحقيق الفوز السريع\nذلك يعني ان الشركات في مصر تهتم بثقافة المكسب السريع و الربح الوفير خلال مدة زمنية قصيرة و دون الأهتمام باقامة علاقة قوية مع الزبون مما يجعل الزبائن ينفضون سريعاً ناحية الشركات الأجنبية التي تدرك قيمة ان تبني علاقة دائمة مع الزبائن.\n\nغياب النظرة المستقبلية يجعل الشركات الناشئة عرضة لمخاطر عديدة و لعل أهمها و أخطرها غياب التمويل\nفمن المعروف ان الشركات الناشئة تحتاج لتمويل مخاطر يتحمل عدم وجود أرباح لمدة قد تصل خمس أو عشر سنوات مما يطلق عليه استثمار طويل الأجل و بالتالي فعندما يتنافس مشروع بهذه المواصفات مع ودائع شهرية في أي بنك و مع هذه الثقافة نستطيع ان نخمن بوضوع لمن ستكون الغلبة !!!\n\nالشركات الناشئة تحتاج كذلك لموظفين و لدعم من العائلة و الأصدقاء وبما ان الموظفين يميلون كذلك لتحقيق المكسب السريع فسنجد انهم لن يهتموا كثيراً بمنحهم أسهم في الشركة قد يكون لها قيمة بعد خمس سنوات أو أكثر و سنجد انهم  يفضلون منحهم مرتب مجزي يحصلون عليه في نهاية كل شهر.\nهنا تصبح محاولة اقناع موظفين مهرة أو مدربين من أجل العمل في شركتك مع منافسة قوية من شركات قائمة و تعمل في السوق من سنين منافسة شبه محسومة في ظل الثقافة السائدة\n\nوأخيراً فحتى مع قليل من الحظ و الحصول على موظفين مهرة فستجد انهم يميلون للحلول التقليدية بينما انت كشركة ناشئة لابد ان تكون لك رؤية مستقبلية و بالتالي فأنت بالتعريف تحاول تغيير الماضي و الحالي من أجل المستقبل وهنا تتحول عملية التوظيف للبحث عن آبرة في كومة قش في ظلام دامس فوق أشواك موجعة !!!!\n\nالنظر على جانب المستهلك يبدو أكثر تحدياً فأنت كشركة ناشئة تأتي له بحلول جديدة لمشاكل أما انه تعود عليها فلم تعد تشكل مشكلة في ثقافته (طابور العيش)\n\nأو أنك تقدم له حل عصري يكسر عاداته الموروثة (استخدام بطاقات الأئتمان في مقابل الكاش) وهذا يجعله رافض بطبيعته للتغيير حتى لو كان هذا أسهل و أفضل\n\nأو أنك تتحدى شركات كبيرة قائمة منذ زمن طويل و تولد داخل عقلية المستهلك اعتياد فطري على أستخدامها (حتى الآن و مع انتشار استخدام خدمة تحويل النقود عبر الموبايل لا تزال الحوالة البريدية هي الحل المفضل للغالبية العظمي من الشعب)\n\nبينما بالنظر للدول ذات الموشر المرتفع مثل كوريا الجنوبية (100) و اليابان (88) نستطيع آن ندرك صدق المؤشر من فلسفة الشركات الكورية و اليابانية التي تؤمن بأن تحقيق منحنى متصاعد للأرباح أهم بكثير من تحقيق ربح كبير في فصل واحد \nكما تؤمن هذه الشركات ان الهدف الأسمي هو خدمة حملة الأسهم على المدى الطويل بتقديم تنمية مستدامة بدلاً من أرباح سريعة في سعر السهم طبقاً للسوق ولهذا يميل حملة الأسهم اليابانيين و الكوريين للأحتفاظ بأسهمهم لمدد طويلة \nنظرة المقارنة على سوق الأسهم اليابانية مقارنة ببقية أسواق العالم تعضد هذه النظرة رغم ان مدة الأحتفاظ بالأسهم تتجه للأنخفاض عالمياً لكن تظل بورصة طوكيو بين الأعلى\n\nو نجد ان نظرة المجتمع في هذه الدول تتجه نحو توفير كل ماهو أفضل للسكان على المدى الطويل و تحقيق التنمية المستدامة آهم من تحقيق ما نطلق عليه القفزات الفجائية\nبل ستجد ان تلك النظرة تمتد للمنتجات اليابانية و الكورية نفسها فالسيارات اليابانية لا تتغير أشكال موديلاتها بشدة بين عام و الأخر مقارنة بالسيارات الأوروبية التي تتغير موديلاتها بشكل أجمالي من عام للآخر و هذا يخفض كثيراً من قيمة السيارات الأوروبية بينما تجد السيارات اليابانية تحتفظ بقيمة أعادة بيع مرتفعة دائماً عن مثيلاتها الأوروبية و الأمريكية\n\nمرة أخرى علينا أن ندرك جيداً ان ثقافة النظرة المستقبلية بالتأكيد ستؤثر علي مستقبل شركتك !!!!!","created_time":"2015-03-25T03:32:18+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_914401065266269","from":{"name":"Mohammed EL-barbeer","id":"629098840630607"},"message":"Mozilla Egypt Tour - Menofia ;) \nDon't miss the Chance ...","caption":"Mozilla Egypt Tour - Menofia","description":"و لسه موزيلا مستمرة في جولتها في محافظات مصر، و جولتنا القادمة هتكون في شبين الكوم - محافظة المنوفية\n\nاتعلم - طور - ابتكر - اتحدى - استمر ......\n\nاعرف اكتر عن موزيلا - اتعلم ويب - صمم تطبيقات - انضم لمجتمع موزيلا المصرى .\n\nنحن فى انتظاركم و سعداء بمشاركتكم الحدث الاكبر لموزيلا فى مصر يوم السبت 4/4\n\nفي كلية الهندسة بشبين الكوم\n\nاليوم سيبدأ من 9 صباحًا و معكم حتى 5 مساءًا\n\nاليوم سينقسم إلى جزئين أساسيين\nالجزء الأول:\nو هو خاص بموزيلا ، المؤسسة، المجتمعات، المنتجات و كل ماله علاقة بها و أيضًا فتح الباب أمامكم للمشاركة معنا\nكممثلين لمجتمع موزيلا، أو كسفراء للطلاب في مدينتكم .. أو متطوعين معنا في مجتمع موزيلا مصر\n\nالجزء الثاني:\nوهو تقديم نظام Firefox OS والتعرف عليه وعلى كيفية تطوير تطبيق باستخدامه عن طريق عمل Circles لمشاركة الأفكار ومعرفة كل ماهو متعلق بالنظام، أيضًا سنقوم بتغطية لـ Firefox Webmaker فكونوا مستعدين لهذا اليوم الحافل بالمعلومات والإفادة.\n\nاستعد فيما بعد للحدث الأكبر \"Mozilla Egypt Camp\" حيث ستتاح لك فرصة المنافسة في تطوير وابتكار تطبيقات لنظام التشغيل فيرفُكس Firefox OS، اسع لتكن الرابح ضمن أفضل خمسة تطبيقات سيحصلون على جوائز قيمة من موزيلا.\n\nhttp://mozillaegypttour1.mozilla-eg.org/\n\nسجل الآن \nhttp://mozillaegypttour1.mozilla-eg.org/Menofia.html","created_time":"2015-03-25T05:15:08+11:00","total_likes":0,"total_comments":0}]}