{"posts":[{"id":"172338516139198_1372105786162459","from":{"name":"Michael Henry","id":"10155149755210955"},"message":"مساء الخير يا شباب، البوست موجه لكل الشباب اللي تملك او بتدير شركة متخصصة في مجال تطوير واداره تطبيقات الويب والموبايل وخدمات التسويق علي الانترت، الموضوع بخصوص قانون القيمة المضافة.\n\nمن المعروف اننا كشركات خدمات كنا معفيين من ضريبة المبيعات ودلوقت بعد موضوع القيمة المضافة بقي في كلام كتيير عن تطبيقه علي الشركات دي انا جبت نص القانون من الجريدة الرسمية وفي اخر صفحة خالص في الاعفائات مكتوب الخدمات الاعلانية فهل احنا نندرج تحتها وهل لو حجم مبيعات الشركة اقل من ٥٠٠ الف جنيه تبقي معفية؟ محتاج رد الناس اللي عندها خبرة في الموضوع وطبعا ماحدش يقوللي روح المصلحة واسأل عشان هناك كله ماشي بالحب وممكن يقولك لازم تسجل ويطلع انت ملكش تسجيل اصلا.\n\nدة نص القانون: ","caption":"hpa.com.eg","description":null,"created_time":"2017-01-30T21:06:31+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1369832319723139","from":{"name":"Ahmed Atalla","id":"423597977977586"},"message":"السلام عليكم ورحمة الله\nهو معرض الكتاب كله روايات وكتب أدبية ولا إيه ؟\n\nأنا لسه مرحتش بس كنت عايز أعرف هل متوفر فيه الكتب التقنية الأجنبية اللي بنشوفها أونلاين في لغات البرمجة المختلفة \nياريت لو حد راح يقولنا إيه اللي موجود ؟","caption":null,"description":null,"created_time":"2017-01-28T21:38:51+11:00","total_likes":3,"total_comments":8},{"id":"172338516139198_1371350532904651","from":{"name":"Eslam Elkhafagy","id":"1258802354202382"},"message":"السلام عليكم \nلو سمحتوا انا دلوقتى حابب اشتغل ويب Java EE و ذاكرت لحد ال servlet & jsp \nفدلوقتى الاحسن انى اعمل بيهم موقع ولا اكمل hibarnate و بعد كده اعمل الموقع ؟\nو هل فى شركات فى مصر شغالة جافا بتعمل intern للطلبة فى الاجازة ؟","caption":null,"description":null,"created_time":"2017-01-30T03:47:42+11:00","total_likes":12,"total_comments":7},{"id":"172338516139198_1372701429436228","from":{"name":"Ahmed Hashem","id":"1786709881592928"},"message":"https://dzone.com/articles/just-say-no","caption":"dzone.com","description":"A company that is not listening to the workforce, dissing experienced software engineers' advice, and sinking projects as a consequence does not deserve your free time.","created_time":"2017-01-31T08:58:37+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1371222156250822","from":{"name":"Ahmad Dawoud","id":"1200777176707152"},"message":"Hello, friends! I'm making up a list of people I can potentially try to contact and have them as speakers at a certain conference. If you know some people who are good/preferably really good at these fields, could you please tag them in the comments section here, or just leave their names? \nThe tech fields I'm currently looking at are as follows: AI, 3D Printing, Virtual Reality, and Android Development. \n\nThanks in advance!","caption":null,"description":null,"created_time":"2017-01-30T01:55:23+11:00","total_likes":7,"total_comments":6},{"id":"172338516139198_1372652742774430","from":{"name":"Tarek Ahmed","id":"10212288208099246"},"message":"Hi, I know this is weird question to ask, but has anyone here tried to buy something from Aliexpress? if yes was it delivered ok? or did you have any problems that can be avoided? what's a good way to pay? \n\nI want to buy some ARM microcontroller boards which i can't find at all in Egypt, this is an  stm32f103 (ARM Cortex-M3 72MHz 64k flash and 8k ram) microcontroller board that can be programmed in C or using the Arduino IDE, it's 1.8$ each which means if it has 100% taxes on it, it becomes 2.6$ which is around 70 LE, compare that to an arduino uno now 25$ for an 8-bit mcu, or a Chinese clone of the uno which is sold for 110LE (for an 8 bit avr 16MHz 32k flash and 2k ram). \nHere is an advice, if you are an instructor teaching Embedded systems start using there, a college student with a embedded systems or robotics project these will greatly improve the quality of your project and processing power, if you have an electronics store or a company that can import these please do, low power IoT and embedded systems is the future and ARM architecture dominates that market.","caption":null,"description":null,"created_time":"2017-01-31T07:27:18+11:00","total_likes":5,"total_comments":4},{"id":"172338516139198_1372789929427378","from":{"name":"Mohamed Eldishnawy","id":"10154966737859462"},"message":"Guys, i need some recommendation for sources to learn about ACR (Audio Content Recognition). For example, how Shazam works, etc. Your help is highly appreciated","caption":null,"description":null,"created_time":"2017-01-31T09:48:22+11:00","total_likes":1,"total_comments":3},{"id":"172338516139198_1372253579481013","from":{"name":"Marwan Hanafi","id":"10210298913361523"},"message":"حد قبل كده استخدم moneygram فى استلام فلوس ؟ انا بحاول ادورلهم على اى رقم مش لاقى","caption":null,"description":null,"created_time":"2017-01-30T23:33:56+11:00","total_likes":0,"total_comments":4},{"id":"172338516139198_1373422852697419","from":{"name":"Ahmed Mostafa","id":"10210792339701765"},"message":"هو جوجل مش شغال عندكم بردوا ولا عندى انا بس ولا حكومتنا المجيدة بتلعب فى حاجة فى وصلة النت  ؟","caption":null,"description":null,"created_time":"2017-01-31T22:37:17+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1373567376016300","from":{"name":"Mohamed Sayed","id":"752810281554018"},"message":null,"caption":null,"description":"كنا في أخر بوست اتكلمنا عن الأشياء الجديدة اللي بيقدمها #سيرفر_2016\nالنهاردة هنبدأ نتكلم عن اول ميزة من الميزات الجديدة اللي بيقدمها واللي هتكون ان شاء الله مش اخر ميزة نتكلم عنها..\nالنهاردة هنتكلم عن الـ #Nano_Server\n\n#النانو_سيرفر هو ضمن احد خيارات تثبيت #الويندوز سيرفر 2016 وبيتم ادارته عن بعد remotely administered server\nودة لأنه مش بيقدم واجهة المستخدم الرسومية #GUI\nكمان مش بيدعم تسجيل الدخول محلياً No local logon capability\nودة خلاه مناسب جداً كنظام تشغيل للسحابة الخاصة ومراكز المعلومات private clouds and datacenters.\nبيشبه بشكل كبير ويندوز سيرفر وهي في الوضع #Core_mode بس مساحته أقل وبيدعم فقط التطبيقات 64 بت وعشان كدة هو محتاج لمساحة أصغر علي الديسك وبيتثبت أسرع وبيحتاج لتحديثات اقل وعدد مرات restart اقل ولما بيـrestart بيشتغل اسرع.\n\nخيار نانو سيرفر متاح فقط مع اصدارات ويندوز سيرفر 2016 Standard and Datacenter\n\n#النانو_سيرفر هو الخيار الأمثل في الحالات التالية علي سبيل المثال ..\n- As a host for Hyper-V virtual machines.\n- As a storage host for Scale-Out File Server.\n- As a DNS server.\n- As a web server running Internet Information Services (IIS)*\n- As a host for applications that are developed using cloud application patterns and run in a container or virtual machine guest operating system.*\n\n* ميزات جديدة.\n\n#الأختلافات_الهامة التي يتميز بها وضع نانو سيرفر\n=======================\n- Nano Server is \"headless;\" there is no local logon capability or graphical user interface.\n- Nano Server cannot serve as an Active Directory domain controller.\n- Group Policy is not supported.\n- Nano Server cannot be configured to use a proxy server to access the internet.\n- NIC Teaming (specifically, load balancing and failover, or LBFO) is not supported.\n- System Center Configuration Manager and System Center Data Protection Manager are not supported.\n- Best Practices Analyzer (BPA) cmdlets and BPA integration with Server Manager are not supported.\n- Provide a new version of Windows PowerShell.\n\nللأسف الشديد فترة الدعم الخاصة بالنانو سيرفر اقل بكتير من فترات الدعم الخاصة بالـCore server او خيار التثبيت الكامل Desktop Experience installation option اللي ممكن تمتد لحد 5 سنين.\n\nانا هتوقف لحد هنا. \nبس مش معني كدة ان دة هيكون اخر كلامنا عن النانو سيرفر او اخر كلامنا عن الميزات الجديدة اللي بتقدمها السيرفر 2016.\n\nتابعونا علي صفحتنا https://www.facebook.com/ITNetworksWay/\nللمزيد من المعلومات حول موضوع الويندوز سيرفر 2016\n#أستفاد_وشير_عشان_غيرك_يستفاد\n#NetworksWay\n#Microsoft_Server_2016\n#MCSA_2016\n#MCSE_2016\n\n*المصدر: موقع مايكروسوفت technet مقالات","created_time":"2017-02-01T01:20:36+11:00","total_likes":0,"total_comments":0}]}