{"posts":[{"id":"172338516139198_1296186977087674","from":{"name":"Mohammed Hussien","id":"10154099730567024"},"message":null,"caption":null,"description":null,"created_time":"2016-11-18T00:54:06+11:00","total_likes":7,"total_comments":3},{"id":"172338516139198_1294397183933320","from":{"name":"Ahmed Ghozia","id":"10154402183178575"},"message":"سلام عليكم و رحمة الله\nانا مدرس مساعد بقسم هندسة و علوم الحاسب - كلية الهندسه الإلكترونيه - جامعة المنوفيه.\nعندنا الكليه بتتخصص آخر سنتين: هندسة و علوم حاسب - هندسة إتصالات - هندسة التحكم.\nالطلاب بتتسائل دايما عن فرص العمل بعد التخرج - و انا إجابتي بتكون إتعلم صح و أسس نفسك كويس نظري و عملي و هتلاقي شغل إن شاء الله - و ده بناء علي تجربتي مع زملاء و خريجين لكليتنا.\n\nانا حابب الناس هنا - كمبرمجين شغالين في السوق - يجيبوا علي سؤال فرص العمل بعد التخرج - متاحه لمين ؟ و هل السوق فيه فرص و بينمو ؟ من هو الخريج المطلوب ؟ ما هي انواع الفرص المتاحه ؟ \nلأن الإجابه من حضراتكم هيكون ليها وقع تاني علي الطلاب و يا ريت لو يبقي فيه هاشتاج نسجل بيه ال posts في الموضوع ده  و شكرا جزيلا مقدما.","caption":null,"description":null,"created_time":"2016-11-16T07:05:07+11:00","total_likes":25,"total_comments":16},{"id":"172338516139198_1296448887061483","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"ربنا يباركله ويجزيه الجنة ويرزقه الاخلاص","caption":null,"description":"تحديث: https://www.facebook.com/M.Magdy.soliman/posts/1220442401381912\nمساء الخير ، انا الصبح حطيت بوست علشان الكورس اللي حعمله و العائد بتاعه حيروح لصالح مستشفى الدمرداش للاطفال ، المستشفى بيعاني جدا و حقيقة مكونتش عارف اعمل ايه فقررت اعمل كورس اكستشينج سيرفر لمدة 5 ايام بعد الضهر تذكرته 500 جنيه و العائد بالكامل حنتبرع بيه للمستشفى فأحب اضيف كام نقطة و ياريت معلشي تعملوا شير من جديد علشان الناس توصلها التحديثات (انا اسف اني بطلب منكم الشير بجد بعتذر)\n\n1- يا رب يا رب يا رب خليه عمل خالص لوجهك ، انا بصراحة انبسطت اما شوفت التفاعل اللي شوفته اللي مكونتش متوقعه الصراحة ، و جيت في مرحلة خوفت لاصاب بالعُجب لدرجة انه كنت قررت الغي الموضوع علشان ميخشش في باب الرياء ، بس تذكرت انه ده من مداخل الشيطان برضوا ، فانا مكمل ان شاء الله و ياااااارب خليه عمل خالص لوجهك\n\n2- يا ريت يا جماعة تخروجني من موضوع الفلوس بقدر الامكان الا في الضرورة القصوى ، و ياريت اللي برا مصر و يقدر يتبرع بالدولار يستنى لحد ما نشوف هل المستفى بتقبل تبرعات بالدولار و لا لاء علشان نوفر ليهم عملة صعبة ، و التبرع حيكون منكم للمستشفى مباشرة و تبعتولي الايصال و ساعتها حدعيكم للمحاضرة\n\n3- الناس اللي قالت عايزين الموضوع اونلاين او مسجل ، ده حيعتمد بشكل كبير على تجهيزات المكان اللي حيتاح لينا ، بس حنحاول بقدر الامكان طبعا\n\n4- الحمد لله انضم ليا المهندس هاني دنيا ، هاني يبقا\nSenior Premier Field Engineer\nفي مايكروسوفت\nو متخصص جدا في الاكستشينج سيرفر  ده حيكون اضافة مهمة جدا لكل اللي عايز يحضر الكورس و هاني بيشتغل مع اكبر العملاء في الشرق الاوسط و انا شخصيا حكون مستني اسمع ليه\n\n5- علشان اغريكم انا حرفع بار التحدي لمستوى غير مسبوق ، سيبكم اني سبع سنين\nMicrosoft Most Valuable Professional\nفي الاكستشينج و ادعي اني بفهم على أدي فيه ، بس انا حشير معاكم ديزاين دوكيومنتس ، تيمبليتس و جرافيكس لمشاريع تمت قبل كده ، حاجات بقا لوز الموز مش عايز اقولكم\n\n6- اللي عايز يشترك معانا من برا او من جوا مصر ، انا عملت فورم بسيط تتركوا فيه و حنعرف منه ندر نلم فلوس اد ايه الفورم على الويب سايت بتاعي\nhttp://www.sureskillz.com/campaigns/2519/\n\n7- المشكلة بقا فعلا المكان ، ياريت يبقا المكان في مدينة نصر او مصر الجديدة ، و لو حد يقدر يساعدنا يقولنا\n\n8- الكورس حيكون استعراض سريع للاكستشينج سيرفر و ال\nArchitecture\nبتاعه و بعدين حنتكلم في\nMultiple AD Forests Multi-Site Deployment Disaster Recovery Sites Hyper Converged Systems Considerations Backup and Restore Design and Architecture Consideration \n\nياااارب نقدر نعمل حاجة ، و معلشي اللي عمل شير يعمل تاني ، ربنا يسهل و نعمل الموضوع ده في غضون الاسبوعين الجايين\n\nشكرا","created_time":"2016-11-18T05:37:53+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1296494160390289","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"My latest screencast as an intro to docker\n\n","caption":"youtube.com","description":"Introduction to docker containers. Showing very basic commands for creating docker containers","created_time":"2016-11-18T06:56:22+11:00","total_likes":15,"total_comments":1},{"id":"172338516139198_1296440863728952","from":{"name":"Amgad Mohamed","id":"10154947722695120"},"message":"حد عنده حل للمشكلة دي","caption":null,"description":null,"created_time":"2016-11-18T05:22:10+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1296577877048584","from":{"name":"Mohamed Tarek El Haddad","id":"10158142026600408"},"message":"Can someone help me with this question? I'd be really grateful.\n\n","caption":"stackoverflow.com","description":"I'm writing a program that will do high speed data acquisition. The acquisition card can run at up 6.8 GB/s (It's on PCIe3 x8). Right now I'm trying to stream to a RAM disk to see the max write spe...","created_time":"2016-11-18T08:53:06+11:00","total_likes":2,"total_comments":2},{"id":"172338516139198_1296936230346082","from":{"name":"Muhammad Negm","id":"10212131509466411"},"message":"That's nice!","caption":"aws.amazon.com","description":"New for Amazon Simple Queue Service – FIFO Queues with Exactly-Once Processing & Deduplication by Jeff Barr | on 17 NOV 2016 | in Amazon Simple Queue Service (SQS), Price Reduction | Permalink | Comments As the very first member of the AWS family of services, Amazon Simple Queue Service (SQS) has ce...","created_time":"2016-11-18T17:43:32+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1295362160503489","from":{"name":"Ibrahim Abdel Fattah Mohamed","id":"10155628438859041"},"message":"Morning, or evening wherever you are :), I think that this is not the first implementation, but this one is different as it has currencies more than just USD :), Your comments and suggestions are highly welcome, the whole thing started with one call to a couple of banks and it now turned 15+..One more thing, updates are *really* automatic with *no* refreshes..\nhttps://eldollarbkam.com/","caption":null,"description":null,"created_time":"2016-11-17T06:03:32+11:00","total_likes":25,"total_comments":9},{"id":"172338516139198_1297225190317186","from":{"name":"Mohamed Osman","id":"10155346413617448"},"message":"Very interesting","caption":"youtube.com","description":"A quick introduction to Node-RED - the visual tool for wiring the Internet of Things, created by IBM Emerging Technologies. http://nodered.org","created_time":"2016-11-19T01:37:15+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1296714350368270","from":{"name":"Omar Wagih","id":"1672065966426661"},"message":"Hello, geeks! I started learning web dev (nodejs specifically) a few months ago, i had minimum C programming experience with some little php on the side prior, i want to get better at node, does anyone know of open source projects i can contribute to/learn from?","caption":null,"description":null,"created_time":"2016-11-18T11:48:43+11:00","total_likes":1,"total_comments":3}]}