{"posts":[{"id":"172338516139198_1154535424586164","from":{"name":"Samuel A. Wilson","id":"10212234222876436"},"message":"Okay, this is a bit irritating. I'm subscribed to Etisalat ADSL, this morning my Internet was not working. The ADSL line was working okay and the router showed correct upstream and downstream readings. However, the Internet was not working because the PPPoE interface was down (not connected). I filed a complaint and after a couple of hours the PPPoE was working fine. The irritating part is now whenever I try to open a page on any browser (on any device) it shows a notification from Etisalat that I can't discard (the continue button call a JS function that should redirect me back to the page I wanted but it doesn't work). I called tech support and spent 40 minutes trying to explain to some Frontline idiot that my Internet connection is fine (I even download router config files from Etisalat's website) but with no avail. \nSo is there any way to bypass this redirect mess? \nOr since this is PPPoE it is not possible? \n\nThe interesting part is that the only webpage that instead of being redirected to the notification page shows connection timeout is Facebook. I ran tracert to different Web pages and Facebook seems to have weird hops. The rest just kept being directed to the same host (the notification page).","caption":null,"description":null,"created_time":"2016-06-02T19:38:35+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1154578971248476","from":{"name":"Muhammad El-Hennawy","id":"10210432517001560"},"message":"All I know that we are living with a phenomena in businesses that I can easily call it the Cambrian era. Huge numbers of Companies are created and reproduced and evolving(or dissolved) very fast that can really lost their purposes that bring it into the live in first place. Again, MBA's holders mentality are mostly more alluring to spit out jargon and wishful ideas without test against reality.","caption":"qz.com","description":"It's a \"know how and synergy platform.\"","created_time":"2016-06-02T21:43:42+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1154625931243780","from":{"name":"Muhammad Atef","id":"10154310824515849"},"message":null,"caption":"emilyinamillion.me","description":"I've mentioned this before, but I really love emoji. I spend so much of my time communicating with friends and family on chat, emoji bring necessary animation to my words that might otherwise look flat on the screen.  Another thing I love is data science. The more I learn about machine learning alg....","created_time":"2016-06-02T23:15:59+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1154151391291234","from":{"name":"Amr ELsaqqa","id":"10155181258139701"},"message":"تعالى جنب اخواتك يا teamviewer \nالناس اللى عاملة permanent password ومثبتة الـ ID \nالـ teamviewer فيه سم قاتل","caption":null,"description":"If you use #TeamViewer, read this urgently to protect your PCs","created_time":"2016-06-02T03:34:05+10:00","total_likes":7,"total_comments":1},{"id":"172338516139198_1154816961224677","from":{"name":"Taha Amin","id":"10154850341220590"},"message":"http://blog.udacity.com/2016/06/6-new-udacity-courses-beginner-advanced-free.html","caption":"blog.udacity.com","description":null,"created_time":"2016-06-03T05:39:56+10:00","total_likes":7,"total_comments":0},{"id":"172338516139198_1154808084558898","from":{"name":"Muhammad SA El-Zahaby","id":"10158316024235486"},"message":"One of the biggest IT Security vendors is developing a training program for Communications engineering and Computer Science graduates.\n\nMy friend Hassan Mostafa is in charge of selecting some candidates from 2015 or 2016 graduates. \n\nThe vendor will hire the first 3 or 4 trainees immediately after the training program.\n\nHassan is looking for those who are doing well in CS courses and are interested in IT field.\n\nIf interested, please send him your CV to hmostafa@uwaterloo.ca with subject \"IT Security Position\"","caption":null,"description":null,"created_time":"2016-06-03T05:18:57+10:00","total_likes":1,"total_comments":2},{"id":"172338516139198_1154844541221919","from":{"name":"Sameh Saeed","id":"10154266644607344"},"message":"There is no system secure 100% , always there is a security vulnerability somewhere","caption":"thenextweb.com","description":"WhatsApp and Telegram have both billed themselves as secure alternatives to phone, text or email correspondence. For the most part, that's true, the two ar","created_time":"2016-06-03T06:56:58+10:00","total_likes":16,"total_comments":3},{"id":"172338516139198_1155108804528826","from":{"name":"Ahmad Abdel-Halim","id":"1933903146842707"},"message":"I like this grid.","caption":"github.com","description":"pills - A simple responsive CSS Grid for humans. View Demo -","created_time":"2016-06-03T19:18:31+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1155163567856683","from":{"name":"Muhammad Salem Elhady","id":"1016971585071771"},"message":"does any one who use team viewer facing connection problem ?","caption":null,"description":null,"created_time":"2016-06-03T21:16:05+10:00","total_likes":1,"total_comments":5},{"id":"172338516139198_1155251387847901","from":{"name":"Mohamed Abdel Aty","id":"10212491964880718"},"message":"I had doubts about the accuracy of the TeamViewer hack news that spread out this week, it had no real reliable source beside the company denied it and the fact it was timed with major passwords breach all play in favor of the doubt \n\nUsually when a company get breached and user accounts stolen what the hackers do is offering to sell the accounts in black market which we did not see in this case \n\nNothing can be certain and because of how critical to security running a compromised TeamViewer service could be people have every right to panic, i myself stopped the TeamViewer service on any critical machine i had ( better safe than sorry ) but as it been couple of days now with no further updates i wonder if it would be safe to use the service again now \n\n","caption":"windowsitpro.com","description":"We've seen a lot of companies genuinely hacked lately and a lot of false claims too. It's really important to get the facts straight.","created_time":"2016-06-04T00:05:39+10:00","total_likes":4,"total_comments":1}]}