{"posts":[{"id":"172338516139198_911248162248226","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":"manshar.com","description":"الشغف هو أن تعمل ليل نهار ولا تشعر بأي تعب، الشغف هو ان تترك جزءاً من عمل أنت مستمتع به لليوم التالي حتى تبدأ به صباحك، الشغف هو أن تقرأ كتاباً يتعلق بمجال عملك وتضعه تحت وسادتك ليلاً لكي تحفظه أو ربما لكي تحلم بفكرة جديدة تفتح لك آفاقاً كثيرة،…","created_time":"2015-03-18T23:56:12+11:00","total_likes":8,"total_comments":1},{"id":"172338516139198_911113582261684","from":{"name":"Bassam Abd Elhamid","id":"1811475205784288"},"message":"بمناسبة مقال احمد عبد الغنى انا عاوز افضفض شوية معاكو\nفى نقطتين\nالاولى\nانا من اوئل الناس الى انضمت للجروب وحسيت بالفرق بينو وبين اى جروب تانى\nولم ارد ان يذيد عدد الاعضاء عن 200 عضو لانى اعرف بذيادة الاعضاء سيصبح كاى جروب اخر\n\nالنقطة الثانية\nاسمحو لى ان اتحدث عن نفسى قليلاً\nفى قرية صغيرة فى ريف مصر وفى الصف الثانى الثانوى درست GWBaisc\nمفيش مصادر لاكمبيوتر ولا كتب ولاحتى حد تسالو\nواخيراً وجدت كتاب فى مكتبة المدرسة\nالناس كلها بتذاكر وانا ماليش غير التفكير والكلام عن البيسك والبرمجه والكمبيوتر\nكانو بيسمعونى الاول بعدين حسيت مصدعهم ع الفاضى\n-تفاصيل كتير مالهاش لازمة-\nتمر الايام واسافر القاهرة واشترى كمبيوتر واتعرف على المنتديات, ايه ده دا فى ناس ذاييى :D\nوالفيس بوك بقى, ووجدت ناسى كتير من سنى والى لو كنا اتقابلنا من ايام ثنوى كنا هنبقى اصحاب \nالنهارده انتو اصحابى - عافية بقى :)\nمن الناس الى كنت اتمنى اقابلهم حتى قبل الجروب محمد مليجى ومن الناس الى قابلتهم \nمحمد سامى, احمد فتح الله, محمد تيسير, ورامى محروس - اظن هنا بس مختفى - \nفى ناس عرفتهم من الاوف لاين كومينتيز مش جامدين ولاحاجه -ذايى كده- بس طيبين ويتصاحبو :)\n\nالى عاوز اقولو الاستفادة مش كل حاجه - ماكلنا بنستفيد من استاك اوفر فلو وكلنا بنكرهو :) - اهم حاجه الروح الى اتمنى ان الكل يحافظ عليها :)","caption":null,"description":null,"created_time":"2015-03-18T15:28:32+11:00","total_likes":19,"total_comments":11},{"id":"172338516139198_911188955587480","from":{"name":"Mosab Ibrahim","id":"10154868571206047"},"message":"Nice song by programmers for programmers :)","caption":"youtube.com","description":"a group of choir programmer","created_time":"2015-03-18T20:25:12+11:00","total_likes":11,"total_comments":6},{"id":"172338516139198_911333962239646","from":{"name":"Hesham Mohamed Eladawy","id":"10154309434427452"},"message":"السادة الزملاء\nالرابط المرفق لأستبيان حول اسباب نجاح او فشل الشركات الناشئة في مصر\nارجو ممن لديه شركة ناشئة او شركة صغيرة او متوسطة في مصر في مجال البرمجيات ان يشارك في ملئ هذا الأستبيان\nالأستبيان يأتي في اطار دراسة ماجستير\nشكرا لكم","caption":"docs.google.com","description":"Dear valuable Respondent, This study aims to explore the degree of influence of various factors on Success or Failure of Technology Companies in Egypt. Many thanks for your valuable time and participation that hopefully add value to Technology Companies' Entrepreneurs. Who should answer this questio…","created_time":"2015-03-19T03:06:35+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_910645555641820","from":{"name":"Eslam Hamouda","id":"10210277573008432"},"message":"صديقنا العزيز أحمد عبدالغني كاتب مقال جميل وفيه فقرة كاملة منه بيتكلم فيها عن الجروب بتاعنا ده وذكر بعض المواقف والأشخاص اللي ساعدته.","caption":"manshar.com","description":"ترددت كثيرًا قبل كتابة هذا المقال، فـ إيماني التام بحرية المرء في إختياراته الخاصه وحياته بضوابط إنسانية - تخصه وحده أيضًا - منعتني كثيرًا من كتابته، لكن ليس هناك من بدّ خلاص، صار لزامًا علينا التنويه أن ما يفعله البعض في الأوساط التقنية المصرية - على وجه الخصوص - والأوساط…","created_time":"2015-03-17T19:08:11+11:00","total_likes":25,"total_comments":18},{"id":"172338516139198_911402212232821","from":{"name":"Mosab Ibrahim","id":"10154868571206047"},"message":"So this is how the maintainer of Git rolls :)","caption":"junio.c.hamano.usesthis.com","description":"Developer (git)","created_time":"2015-03-19T05:44:36+11:00","total_likes":3,"total_comments":2},{"id":"172338516139198_910986612274381","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"عادت ظاهرة السؤال بكثرة هذة الأيام ... ليست المشكلة في مستوى الأسئلة فنحن نرحب بالمساعدة للكل المبتدئين قبل المحترفين ... المشكلة ان البعض اعتاد الاستسهال ... فبدلاً من أن يذهب الفرد الى Google ويبحث عن حل للمشكلة التي تواجهه ويقرأ ويجرب يأتي الى هنا ويسأل السؤال بدون حتى أن يتعب نفسه في توفير المعلومات الكافية حول المشكلة ... إسمحوا لي أن أسرد قصة حدثت لي متذ سنتان تقريباً ...\nكنت أبحث في أمر  دقيق جداً لإعدادات خادم Apache ليعمل على Windows ... قرأت في الـ Documentation الخاصة بـ Apache وموقع آخر خاص بـ Apache لـ Windows يدعى (ِApache Lounge) وبحثت في StackOverflow لم أجد اجابة فقمت بطرح السؤال على Stackoverflow وجائت أربعة اجابات لم تكن تحديداً ما أبحث عنه ...\nأثناء البحث لفت انتباهي اجابات تنم عن معرفة قوية جداً لمصري على Stackoverflow ... طالعت اجاباته فوجدت انه متخصص في اعدادات الخودام فبحثت عنه ووجدته على Github و Twitter ووصلت إلى بريده الإليكتروني الشخصي. أرسلت إليه رسالة تعريفية أعرفه بنفسي وأطلب منه المساعدة ... شرحت له في الرسالة كافة الروابط التي عثرت عليها والحلول التي جربتها ولم تساعدني في حل مشكلتي والسؤال الذي سألته على Stackoverflow و Serverfault. ذيلت الرسالة بأنها ليست عادتي أن أسأل أحد على بريده الشخصي وانني متفهم تماماً اذا اختار عدم الرد واننا احترم ذلك ... جائني الرد بعد نصف ساعة وسأقتبس كلماته:\n\" I usually don't give private consultation for free, but I would probably hate myself if I didn't offer help after you have put some obvious effort in research and in understanding and writing about your problem\"\nوقام هذا الشخص العزيز بالرد على استفساري وساعدني في حل المشكلة. أصبحنا بعدها أصدقاء وتطورت العلاقة بيننا وعملنا سوياً.\nما أريد ان أقوله للزملاء الجدد أنه طالما لم تقم بشرح المشكلة التي تواجهها بشكل كامل وأظهرت المجهود الذي بذلته لمحاولة الوصول الى حل لن يهتم أحد لمساعدتك لأنه ببساطة \"احنا فينا اللي مكفينا\" ... من أجل أن نصل الى نقاشات مثمرة يجب أن تظهر المجهود الذي تبذله.","caption":null,"description":null,"created_time":"2015-03-18T10:19:19+11:00","total_likes":25,"total_comments":25},{"id":"172338516139198_911446118895097","from":{"name":"Mohamed Emam","id":"1313679302027332"},"message":"First blog post of Integrating Cortana ;)\nStay tuned for the next blog post :D \n\nLink: http://wp.me/p4cKPM-6g\n\nYour feedback is appreciated :D\n#Cortana #WindowsPhone #Developer #Blog #MSP","caption":"mohammedemam.wordpress.com","description":"In this blog, you will learn How to integrate Cortana into your Windows Phone 8.1 Runtime App. But, before you integrate Cortana, you have to know Who is Cortana? So, let me introduce Cortana to yo...","created_time":"2015-03-19T07:37:29+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_911373105569065","from":{"name":"Ahmed Mohsen","id":"781978161955237"},"message":"حاليا انا شغال علي database \"مش انا اللي عاملها\" \n1- في solution php شغال عليها اللغة العربية فيها ببتحول للشكل ده : \nØªØ·Ø¨ÙŠÙ‚ Ø´ÙÙˆÙŠ\n2- في mobile app شغال عليها اللغة العربية بتتحول للشكل ده :\n%D8%A7%D9%87%D9%84%D8%A7\n\nالمشكلة ان المويبل مش قادر ي convert او يفهم الداتا اللي جاية من ال php solution \nالمشكلة الاكبر اني مش عارف المفروض اعرف اه علشان ابتدي في حل المشكلة\nجربت تقريبا كل طرق ال encoding ,decoding علي ال notepad ++ بس مش قادر اوصل لاي حاجة\ncolumn character set =  utf8\n column collation = utf8_unicode_ci","caption":null,"description":null,"created_time":"2015-03-19T04:32:28+11:00","total_likes":3,"total_comments":23},{"id":"172338516139198_911760512196991","from":{"name":"Meligy","id":"10154884040385170"},"message":"Food for thought مش بالضرورة تتفق مع كل الكلام","caption":"storify.com","description":"أكثر 10 أخطاء يقع فيها أصحاب المشاريع الناشئة قد تتسبب في فشل مشاريعهم","created_time":"2015-03-19T23:45:08+11:00","total_likes":11,"total_comments":1}]}