{"posts":[{"id":"172338516139198_1290157664357272","from":{"name":"Babayega Linux","id":"617625178429378"},"message":"السلام عليكم ..\nاولاً انا عندي 16 سنه ومهتم بالمجال دا \nبس مشكلتي اني مش عارف اتعلم ازاي اكتب كود او افهم الكود نفسو \nبقضي اغلب الوقت في قرايه كام bolg وكام كتاب \nاي نصايح ؟","caption":null,"description":null,"created_time":"2016-11-12T13:46:14+11:00","total_likes":2,"total_comments":8},{"id":"172338516139198_1290375301002175","from":{"name":"Abdelrahman Serag","id":"10154232214840703"},"message":"http://vmob.me/DE1Q17VL?vl=rJk9qPV-e3","caption":"s.developereconomics.com","description":"The State of the Developer Nation survey is an independent survey tracking all trends on development, across tools, platforms, developer skills, salaries & more!","created_time":"2016-11-12T21:19:38+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1289607701078935","from":{"name":"Mohamed M. Abdel Aty","id":"10154608791854092"},"message":"I need to split DOC  & DOCX files by page not paragraph using java , \nAny recommendations ?","caption":null,"description":null,"created_time":"2016-11-12T02:48:00+11:00","total_likes":0,"total_comments":4},{"id":"172338516139198_1284782061561499","from":{"name":"Hosam G. Zewain","id":"10212617052122854"},"message":"بمناسبة تعويم الجنية واختلاف اسعار العملات في البنوك المختلفه وان في ناس كتير بتحب تتابع اسعار العملات اول بآول وبدل ما يقعدوا يدرورا علي مواقع البنوك عملت موقع بسيط بيجيب اسعار العملات اوتوماتيكيا من مواقع ٤ بنوك مبدئيا وجاري اضافة بنوك اخري قريبا.\nالموقع بيتحدث اول بآول بالاسعار الي في مواقع البنوك يعني مفيش اي تآخير في الاسعار والاسعار المكتوبة في الاسعار الفعليه واللحظية في المواقع.\nwww.egp-price.com\nاحفظوة .. هتحتاجوه ;)\n\n*تعديل: تم اضافة البنك المركزي المصري ليكون المجموع ٥ بنوك","caption":null,"description":null,"created_time":"2016-11-08T01:31:40+11:00","total_likes":25,"total_comments":9},{"id":"172338516139198_1290387734334265","from":{"name":"Mohammad Helal","id":"419061701779054"},"message":"What kind of knowledge needed or what should I know to build a monitoring system?\nThis system should do the following:\n1. Real time employee' computer monitoring.\n2. Manager computer must have an access to employees' computers.\n3. Block specific web sites (ex. YouTube, Facebook, Twitter, online shopping web, and other messenger programs for chat conversation).\n4. Multiple employees' screens need to be on manager's screen.\n5. Need to provide a screenshot automatically as every second, or minute for a manager, when he/she wants to look. All the screenshots needs to save to the main server with time stamp.\n6. Tracking service that a manager can check how much employees have spent their time for.\n7. Tracking service what employees get download, upload, or moving files to portable device (USB, Portable hard disk).\n8. Employees must not have access, or delete the program by themselves (Key code).\n9. Website visited.\n10. Block games.\n11. Block apps.\n12. Block music players.\n\nI got these specs from a project posted in freelance.com, and I am very curious to learn how to build such thing.\n\nSo please anyone has the knowledge on how can I start in this direction, I will be very happy.\n\nYou can provide me with the name of subjects to study and why to study it.\n\nThanks,","caption":null,"description":null,"created_time":"2016-11-12T21:43:47+11:00","total_likes":1,"total_comments":2},{"id":"172338516139198_1289858094387229","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"just saw a previous post about fraud jobs and among the comments i saw a comment from Mohamed Alaa El Din and another member talking a bout building a review platform for the tech companies in Egypt (as fraud tech jobs are a phenomenon in the time being). I thought i might be a page where people can send their reviews and evidence to the fraud case (might be screenshots or even documents) and the admins post those reviews when they make sure of a real fraud case. I've created a facebook page before. I wish to have some trusted people like the admins of Egyption geeks that can make sure of the posted content.\n\nso guys what do you think? cc Ahmad Alfy\n\nhttps://www.facebook.com/techno.com.review/","caption":null,"description":"Techno review is a page where you can send us the review of a tech company where you've worked at/with and we will share it anonymously to help others.","created_time":"2016-11-12T09:38:20+11:00","total_likes":13,"total_comments":9},{"id":"172338516139198_1289894581050247","from":{"name":"Hesham Watany","id":"10211830164526211"},"message":"رجالة ال javascript اللي جربت ECMA script 6 و angular 2 \n1-هل فيه داعي اني اتعلمهم و انقل شغلي ليهم ولا الفرق ما بينهم مش محتاج التعب ده كله؟\n2-خدت وقت قد إيه عشان تبقى في نفس ال Level بعد ما نقلت ؟ \n3- عشان تنقل angular application كبير وفيه شغل 4 شهور ل angular 2 ممكن ياخد وقت قد إيه ؟ (من غير وقت مذاكرة angular 2)","caption":null,"description":null,"created_time":"2016-11-12T10:56:41+11:00","total_likes":3,"total_comments":4},{"id":"172338516139198_1290480934324945","from":{"name":"Amir Abou Eesa","id":"1353018234756623"},"message":"Someone asked me couple of days ago to find a piece of code from my archive and i promised i will do in a day , actually i can't remember what it was about or which person was contacting me , can you ping me please if you still need it.","caption":null,"description":null,"created_time":"2016-11-13T00:38:13+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1290023631037342","from":{"name":"Muhammad Al Rabbani","id":"436443206686932"},"message":"Why is the posting denied in the fraudulent tech company post?","caption":null,"description":null,"created_time":"2016-11-12T11:33:50+11:00","total_likes":1,"total_comments":5},{"id":"172338516139198_1290783990961306","from":{"name":"محمد عرفة","id":"10154943779149651"},"message":"Anybody know of any good kodi plugins for Arabic channels? Shahid isn't great all the time","caption":null,"description":null,"created_time":"2016-11-13T06:35:20+11:00","total_likes":0,"total_comments":0}]}