{"posts":[{"id":"172338516139198_805864422786601","from":{"id":"628227451","name":"Hesham Mohamed Eladawy"},"message":"مشاريع البرمجيات تثير جدلا كبيرا في تسعيرها وتقييمها، ولا يختلف هذا الأمر بين شركة كبيرة وشركة صغيرة ... هي -ان صح فيها الوصف- ملحمة.\nفي ثلاث تدوينات نتحدث تفصيلا عن هذه المحلمة.\n\nفي التدوينة الأولى: نتحدث عن كيفية الأعداد لهذه الملحمة، ما هي المعتقدات التي يجب عليك تبنيها قبل ان تخوض في هذه الملحمة.\nhttp://heshameladawy.blogspot.com/2014/07/softwarepricing1.html\n\nفي التدوينة الثانية: نتناول بعض وسائل وطرق التعامل مع هذه الملحمة، حيث نشرح اهم وانجح طرق التسعير لهذه النوعية من المشاريع.\nhttp://heshameladawy.blogspot.com/2014/08/softwarepricing2.html\n\nفي التدوينة الثالثة: نتناول بعض التكاليف التي يغفل عنها المسئولون عن عملية التقييم والمتعلقة بتفاصيل دقيقة في المنظومة الأدارية للشركة.\nhttp://heshameladawy.blogspot.com/2014/08/softwarePricing3.html\n\nثلاث تدوينات تعرض خلاصة وعصارة خبرة اكثر من 14 عاما في مجال المشاريع البرمجية.","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-08-28T11:46:32-07:00","total_likes":0,"total_comments":0},{"id":"172338516139198_805491519490558","from":{"id":"595125669","name":"Ahmad Alfy"},"message":"ما رأيكم: هل اتقان اللغة الإنجليزية مطلوب لكي تصبح مبرمج قوي؟ (عذراً فأنا أكره كلمة محترف!)\nأنا شخصياً مع هذا الرأي لعدة أسباب:\n1- معظم المصادر المحدثّة في هذا المجال هي بنسبة 99% باللغة الإنجليزية ... لا أقصد أنه لا يوجد مصادر عربية. هي قليلة وان وجدت لا تكون على نفس المستوى المطلوب ولا تكون محدثة.\n2- معظم الأخبار التي تنشرها المواقع التقنية عن تحديثات الأنظمة واللغات البرمجية وما الى ذلك تكون باللغة الإنجليزية\n3- للتواصل مع عتاة البرمجة من خلال منصات التواصل الإجتماعي كـ Twitter و LinkedIn الغير عرب (وهم الرائدون بالطبع) تحتاج إلى اللغة الإنجليزية.\n4- مجموعات النقاش ومواقع الأسئلة مثل Stackoverflow وغيرها تتطلب اتقانك للغلة الإنجليزية. لن أخوض في أمور مثل أننا كعرب قليلا ما نساعد بعضنا وصعوبة وجود مجتمع مثل Stackoverflow ناجح عربي ... هناك محاولة رائدة هي Arabia.io ولكن ينهال عليها كل يوم الاخوة المحبين للمنتديات بالأسئلة التي تعكس الكسل والشخصنة والردود من نوعية مشكوووووووور وتسلم وطلبات البعض حذف مشاركاتهم عندما يضايقهم أحد الأعضاء.\n5- اتقانك للغة الإنجليزية يساعدك على فهم الـ Code الذي تكتبه بشكل أبسط. فمعظم اللغات البرمجية تكتب بإنجليزية بسيطة حتى تكون مفهومة.\n6- 100% من وثائق استخدام المكتبات المختلفة (Documentation) هي باللغة الإنجليزية! كيف ستستخدم هذا المكتبات ولغتك ضعيفة؟\n\nعندما نصبح نحن من نصدر العلوم وقتها نستغنى عن اللغات الأخرى ... أما الأن فلا بديل عنها.","caption":null,"description":null,"created_time":"2014-08-27T17:07:48-07:00","total_likes":13,"total_comments":14},{"id":"172338516139198_805826939457016","from":{"id":"1335906613","name":"Muhammad Negm"},"message":"If anyone here is coding in nodejs, angular and any javascript.\n\nGive this a try \nhttp://www.jetbrains.com/webstorm/whatsnew/\n\nworth every penny","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-08-28T09:53:51-07:00","total_likes":0,"total_comments":9},{"id":"172338516139198_806057356100641","from":{"id":"100002045429029","name":"Mohamed Alaa El Din"},"message":"Is your responsive design working? Google Analytics will tell you: http://www.smashingmagazine.com/2014/08/28/responsive-web-design-google-analytics/","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-08-28T22:45:37-07:00","total_likes":4,"total_comments":0},{"id":"172338516139198_805436682829375","from":{"id":"652024918","name":"Amr Eldib"},"message":"هل فيه خبراء ممكن تساعد؟\n\nمعلهش خلوني أعبر عن رأي شخصي .. في الكام يوم اللي فاتوا .. أغلب الأسئلة بقت علي طريقة: هل فيه خبراء من مجال كذا علشان يجاوبوا سؤال؟\nالسؤال بالطريقة ديه ليه عيوب كتيرة:\nأولا: بيطول الحوار بشكل ملهوش لازمة لأن أول خمسين رد هم \"أيوه أنا بأفهم في الموضوع ده\" و\"والله .. من إمتي\" و\"طب وبتشتغل فين\" ونتعرف ونعمل قهوة وحوارات .. التعارف كويس وكل حاجة بس الهدف هنا هو سؤال وإجابة\nثانيا: السؤال بالطريقة ديه بأمانة (وبكل إحترام) بيعكس كسل صاحب السؤال في إنه يضع أي مجهود في طرح السؤال .. وغالبا في محاولة الإجابة عليه. لو مش عندك الوقت إنك تسأل سؤال كامل يطرح خلفية الموضوع والهدف المطلوب والبحث اللي عملته في الموضوع يبقي بصراحة السؤال لا يستحق إن حد يضع وقته عليه. الناس اللي بتساعدني في إجابة سؤالي بتتكرم عليا من وقتها علشان تساعدني .. وقت كان فيه تكون بتشتغل أو تقضي وقت مع أسرهم أو حتي تساعد شخص تاني .. أقل حاجة ممكن أعملها هي أني أساعدهم علشان يساعدوني\nثالثا: بيعطي إنطباع إن صاحب السؤال مش جاد في سؤاله .. وبعد كده محدش هيتهم بأسئلته .. مش عيب أبدا إن حد يبقي مبتدئ في أي حاجة أو يسأل سؤال سهل أو بسيط .. لكن مش مقبول إني أسأل سؤال عام لدرجة إن إجابته ممكن تبقي أي حاجة وفي نفس الوقت ولا حاجة\nرابعا: بينزل بمستوي النقاش في المجموعة إلي حوارات عامة ملهاش معني بصراحة\n\nأنا مش هأقول للناس إزاي تسأل سؤال بشكل كويس لأن المكان هنا مفتوح لكافة \nأنواع النقاش .. لكني فقط هأقول أنا بأحاول أعمل إيه:\nفي أول سطر أذكر كل المعلومات المهمة اللي تخلي الناس اللي مش مهتمة تتجاهل السؤال\nأشرح خلفية سريعة عن الموضوع علشان يكون فيه سياق لسؤالي\nأحدد إيه الهدف المطلوب بالضبط .. يعني سؤال في جملة كاملة وليها علامة إستفهام في الأخر\nوأخيرا أشرح الحاجات اللي عملتها في البحث لغاية دلوقتي (بشكل مبسط وسريع) .. ديه نقطة مهمة لأن الناس هتجاوب بإقتراحات مبدئية المفروض أكون أنا جربتها بالفعل\n\nنقطة جانبية: اللغة الرسمية في جمهورية مصر العربية هي العربي .. لو سألت \nسؤالي بالعربي الناس هتأخده بجدية زي لو سألته بأي لغة تانية .. لكن لو سألت السؤال بلغة تانية أنا مش بأعرفها لدرجة إن محدش فهم حاجة من السؤال يبقي أنا لا هألاقي إجابة وهأبقي بس ضيعت وقت الناس\n</rant>","caption":null,"description":null,"created_time":"2014-08-27T13:36:14-07:00","total_likes":22,"total_comments":10},{"id":"172338516139198_806154339424276","from":{"id":"100000896233663","name":"Mohamed Nageh"},"message":"السلام عليكم كنت عايز برنامج يحول من Jar لـ .exe ياريت لو حد جرب قبل كده برنامج كويس يفدني","caption":null,"description":null,"created_time":"2014-08-29T04:53:53-07:00","total_likes":0,"total_comments":13},{"id":"172338516139198_806340999405610","from":{"id":"627907956","name":"Emad Elsaid"},"message":"إيه هايكون الجديد فى ECMAScript 6 ؟ \nالبريزنتيشن موضح فيتشرز جديد ةفى الsyntax و فى حاجات جاية منلغات مختلفة زى الmultiple assignment فى بايثون و روبى و الScope reservation فى كوفى سكريبت.","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-08-29T09:34:40-07:00","total_likes":11,"total_comments":1},{"id":"172338516139198_806363669403343","from":{"id":"652024918","name":"Amr Eldib"},"message":"[The mastermind behind ICREACH Keith] Alexander wrote, would “allow unprecedented volumes of communications metadata to be shared and analyzed,” opening up a “vast, rich source of information” for other agencies to exploit.\nJust to be clear: The first image is a mockup and not real.\nhttps://firstlook.org/theintercept/2014/08/25/icreach-nsa-cia-secret-google-crisscross-proton/","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-08-29T10:40:00-07:00","total_likes":0,"total_comments":8},{"id":"172338516139198_805697296136647","from":{"id":"100008341922852","name":"Omar Ehab"},"message":"Hi \ni am a beginner in html/css and i want some challenges for them either websites or forums or any challenges?\nThank you","caption":null,"description":null,"created_time":"2014-08-28T05:59:21-07:00","total_likes":0,"total_comments":9},{"id":"172338516139198_806697529369957","from":{"id":"500847388","name":"Hadi Salem"},"message":"Anyone?\n\nhttp://stackoverflow.com/questions/25576637/elasticsearch-rails-gem-timeout-when-saving-a-document-after-changing-index-nam","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-08-30T01:46:32-07:00","total_likes":1,"total_comments":0}]}