{"posts":[{"id":"172338516139198_1241314782574894","from":{"name":"Bassam Abd Elhamid","id":"1811475205784288"},"message":"مرحبًا جيكس,\n لكسر الملل وتشغيل الجمجمة فى حاجه جيكى كده\n\nانا قرارت اتعلم 30 لغة برمجة فى 30 يوم\n\nبداً من الشهر القادم ان شاء الله كل يوم الصبح هختار لغة واتعلمها وعلى اخر ايوم هعمل بلوج بوست عنها.\n\nانا فاهم ان اللغة مش مجرد سينتاكس , لاكن انا هتعلم السينتاكس فقط حالياً.\n\nوعشان الموضوع يكون ممتع وتحدى فعلاً, هحاول اختار لغات معرفش عنها حاجه ومن برديمز مختلفة.\n \nاتمنى يكون الموضوع ممتع واكمل فيه للآخر :)\n\n-------------\nتحديث:\n\nشكراً للناس الى بتشجعنى ابداء , وشكراً للناس الى اقتراحت طرق اخرى لتشغيل الدماغ او الى وصوا بلغة معينة.\n\nحبيت بس اوضح ان استفادتى هنا تشغيل الدماغ ليس اكثر, كذلك انا هتعلم السينتاكس فقط وبمعرفة بكثير من مبادئ البرمجة والبراديمز المختلفة تعلم السينتاكس قد يستغرق ساعة تقريباً فى حالة وجود ملف جرامر للغة بالتعليقات عليه\n\nالفكرة البديلة بالنسبالى, هى عمل تطبيق بسيط يقوم بانتاج سينتاكس جرامر بشكل عشاوائى مع بعض الملحوظات البسيط عن اللغة المخترعة ثم يطلب منى عمل امبلمنتنج لبعض الخوارزميات البسيطة باللغة الجديدة ثم يتاكد من صحتها, لاكن اظن تطبيق بالشكل ده هتكلف اكتر.\n\nفكرتى حاجه زى \"العاب العقل\" , انى ازرع فى دماغى مقدار معين من المرونة وسرعة التعلم والتكيف\n\nتخيل انك بتسوق بدركسويون على اليمين, او بتكتب بالشمال او راكب عجلة معكوس التروس عشان تمشى للخلف مش للامام.","caption":null,"description":null,"created_time":"2016-09-26T01:30:28+10:00","total_likes":8,"total_comments":21},{"id":"172338516139198_1242358385803867","from":{"name":"Ahmed Omar","id":"912933662143336"},"message":"السلام عليكم ورحمه الله وبركاته\nعايز تتعلم بجد برمجه ، تصميم ، شبكات وقواعد بيانات\n\nادخل علي #ويتروو \n\n","caption":"witroo.com","description":null,"created_time":"2016-09-27T03:25:22+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1242379109135128","from":{"name":"Yahya Sabry","id":"10154673962792886"},"message":null,"caption":null,"description":"الفيديو رقم ٣ مع واحد من اهم الناس في الوطن العربي ... جوزيف شوملي من الاردن من شركه play 3arabi ... بنتكلم عن ال Games KPIs ... فيديو فيه معلومات مهمه و مستني رآيكوا :)","created_time":"2016-09-27T03:48:21+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1242407899132249","from":{"name":"Mera Karam","id":"1526698790687793"},"message":null,"caption":null,"description":null,"created_time":"2016-09-27T04:28:58+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1242726909100348","from":{"name":"Muhammad El-Hennawy","id":"10210432517001560"},"message":"I can't believe people did that !!","caption":"fortune.com","description":"And they're killing the smartphone in the process.","created_time":"2016-09-27T13:46:12+10:00","total_likes":4,"total_comments":3},{"id":"172338516139198_1242476879125351","from":{"name":"Muhammad Essam","id":"1249354588513057"},"message":"Good evening GEEKS,\nI am working on an idea of a start up company (mobile app), i am looking for a mobile app programer so if there is any one who is willing to be part of it plz feel free to inbox me (students, fresher or experienced males or females are welcomed).","caption":null,"description":null,"created_time":"2016-09-27T06:23:37+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1239253222781050","from":{"name":"Mahmoud Elshafaey","id":"10210569174683682"},"message":"Is there any Chrome/FireFox extension, app or anything else can download photos album from facebook page?\n\n- I tried many extensions but nothing worked.","caption":null,"description":null,"created_time":"2016-09-23T14:43:40+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1242058952500477","from":{"name":"Mohamed M. Farag","id":"10158349980930711"},"message":"Guys, I'm developing a back-end web service to be consumed by diff. mobile applications and/or web clients. I'm evaluating between 2 alternatives: 1) PHP and 2) NodeJS. I know deciding is a pretty subjective topic, so let me tell you the criteria I'm basing off the decision and I'd love to hear your comments. I'm leaning towards NodeJS but there is nothing better than collective wisdom especially among such a group of GEEKS :)\n\nCriteria:\n1) Availability of Skill Set: PHP is more abundant especially in Egypt but NodeJS is growing rapidly\n2) Fit for application: NodeJS parallelism beats PHP on that front\n3) Market Presence: PHP is leading of course but NodeJS is growing pretty fast\n4) Ease of Coding: NodeJS is faster in the development cycle\n5) Cost to Outsource: NodeJS tend to be more expensive just because they are less. But I think prices will converge pretty soon and more importantly a developer updating his/her skill set to cope with the market is likely to deliver better results as he keeps developing him/her self so price for quality should be the same or NodeJS would exceed in that bit\n\nAs mentioned, It's a pretty subjective pick but I'd love to hear your feedbacks and please mention other criteria that I might have missed.\n(PS I'll post the requirement for someone to help build the codebase on EgyptianGeeksJobs when my membership is confirmed and I take the final decision)\n\nAwaiting replies (and sorry for the long post)","caption":null,"description":null,"created_time":"2016-09-26T20:59:04+10:00","total_likes":1,"total_comments":4},{"id":"172338516139198_1241309362575436","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":"السلام عليكم\n\nمن فضلكم سؤال: ممكن اعرف متوسط رواتب المبرمجين فى مصر كام خصوصا .net web developer\n\nومتوسط سعر الساعة ليهم واقصى عدد ساعات ممكن يشتغله يوميا لو بالساعة ؟\n\nبصراحة معرض عليا شغل اون لاين ب 2000 شهريا وانا شايف انهم قليلين جدا او بالساعة 15 جنيه 6 ساعات يوميا\n\nانا شغال بقالى 5 سنين","caption":null,"description":null,"created_time":"2016-09-26T01:22:27+10:00","total_likes":1,"total_comments":3},{"id":"172338516139198_1242846902421682","from":{"name":"Ibrahim Mohammed","id":"1726284604348944"},"message":"what does \" outstanding balance \" means in Prepaid cards ?\nwhenever i put balance in my card to purchase something it goes to the outstanding balance and the available balance is in minus ?!!","caption":null,"description":null,"created_time":"2016-09-27T17:58:33+10:00","total_likes":0,"total_comments":0}]}