{"posts":[{"id":"172338516139198_1230118603694512","from":{"name":"Muhammad Sabry Abdulwanis","id":"10212106739285334"},"message":"Happy programmers' day  :) \n#programmersday","caption":null,"description":null,"created_time":"2016-09-13T00:34:55+10:00","total_likes":6,"total_comments":0},{"id":"172338516139198_1230132950359744","from":{"name":"Ahmed Essam","id":"440145042983821"},"message":"دورة برمجة Python مع قواعد بيانات SQLite3","caption":"muslimdevelopertv.com","description":"مطوّر مسلم هو مشروع خيري بسيط يسعى لنشر علم هندسة البرمجيات مجانًا وبدون مقابل. إِذَا مَاتَ ابْنُ آدَمَ انْقَطَعَ عَمَلُهُ إِلا مِنْ ثَلاثٍ : مِنْ صَدَقَةٍ جَارِيَةٍ ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ","created_time":"2016-09-13T00:53:48+10:00","total_likes":2,"total_comments":1},{"id":"172338516139198_1230422593664113","from":{"name":"Mohamed Abu Galala","id":"1215961701856579"},"message":null,"caption":null,"description":"ساهمت مختبرات كاسبرسكي في القبض على مشتبهين كانوا يشكلون جزءًا من عصابة “لورك” Lurk الإلكترونية المشتبه بتورطها في عدة جرائم منها سرقة ما يزيد عن 45 مليون دولار من عدد من الشركات والمصارف في روسيا؛ حيث تعتبر لورك من أكبر عصابات القرصنة المالية التي ألقي القبض عليها في السنوات الأخيرة.\n\nووفقاً لنتائج تحليلات بنية تكنولوجيا المعلومات الكامنة وراء برمجية Lurk الخبيثة، كان مشغلو هذه البرمجية يقومون بوضع وتأجير هذه الأداة إلى مجرمي الإنترنت الآخرين، وهذه الأداة التي تعرف باسم Angler، وهي عبارة عن مجموعة من البرمجيات الخبيثة القادرة على استغلال الثغرات الأمنية في برامج الحاسوب المختلفة وزرع برمجيات خبيثة إضافية خلسة في أجهزة الكمبيوتر.\n\nوقد بقيت أداة Angler ولسنوات طويلة من أقوى أدوات القرصنة المتاحة لمجرمي الإنترنت من وراء الكواليس. ويعود تاريخ وجود الأداة إلى أواخر عام 2013، حيث قامت العديد من العصابات الإلكترونية باستخدامها لنشر البرمجيات الخبيثة المختلفة مثل البرامج الخاصة بالدعايات الإعلانية والبرمجيات الخبيثة المستهدفة للقنوات المصرفية وبرمجيات الفدية.\n\nوقد تم استخدام هذه الأداة بشكل فعال من جانب العصابة المسؤولة عن برنامج الفدية الخبيثة Cryptxxx الذي يعتبر أحد أخطر التهديدات على الإنترنت، فضلا عن استخدامها في برنامج Teslacrypt وغيرها. بالإضافة إلى استخدام الأداة  لنشر برمجية حصان الطروادة المصرفية الخبيثة المعروفة باسم، Neverquest والتي تم وضعها لمهاجمة ما يقارب من 100 بنك مختلف، إلا أنه قد تم تعطيل عمليات Angler مباشرة بعد القبض على عصابة لورك .\n\nوأظهر البحث الذي أجراه الخبراء في مختبرات كاسبرسكي، أنه قد تم بناء أداة Angler أساسا لهدف واحد وهو لتوفير قناة توصيل فعالة وموثوقة لعصابة لورك، ليمكّن برمجيتها المصرفية الخبيثة من استهداف أجهزة الكمبيوتر. ونظرا لأن Lurk هي نوع من العصابات التي تلتزم السرية الإنغلاق الشديد في أعمالها فقد حافظت على الهيمنة الكاملة على بنيتها التحتية بدلا من محاولة شراء برامج من عصابات أخرى كما يفعل الباقون. ولكن في عام 2013، تغيرت الأمور بالنسبة للعصابة، حيث قامت بفتح المجال لتأجير هذه الأداة لكل من يرغب في الدفع.\n\nوقال رسلان ستويانوف، رئيس إدارة تحقيقات حالات اختراق الحواسيب في مختبرات كاسبرسكي: “إن قرار عصابة Lurk لاتاحة المجال لاستخدام وتأجير أداة Angler قد كان ناتجاً عن الحاجة إلى سداد الفواتير المالية. ففي الوقت الذي أتاحت العصابة الأداة للإيجار، لوحظ تناقص أرباحها من الأنشطة الرئيسية المتمثلة في السطو الإلكتروني على أموال الشركات نتيجة الإجراءات الأمنية التي تم تطبيقها من قبل مطوري برامج التحكم بالأنظمة المصرفية عن بعد، وهذا جعل الأمر أكثر صعوبة على هؤلاء المهاجمين، ومع كثرة الالتزامات والمصاريف وتزايد عدد الموظفين، فقد قرر المهاجمون توسيع أعمالهم، واستطاع تحقيق النجاح في ذلك إلى حد ما. وفي حين كانت Angler بمثابة الأداة المستخدمة لنشر برمجية حصان الطروادة المصرفية الخبيثة تشكل تهديداً يقتصر فقط على المؤسسات الروسية، إلا أنه فيما بعد توسع نطاق تهديدها حيث استخدمت لشن هجمات ضد مستخدمين آخرين حول العالم”.\n\nتجدر الإشارة إلى أن أداة Angler ليست النشاط الوحيد الجانبي لعصابة لورك، فعلى مدى أكثر من خمس سنوات انتقلت العصابة من إنتاج البرمجيات الخبيثة الفاعلة في مجال سرقة الأموال تلقائياً عن طريق برامج نظام الخدمات المصرفية عن بعد إلى أنظمة السرقة المعقدة والتي تتضمن استخدام بطاقات SIM المزيفة ومختصي القرصنة الخبراء في البنى التحتية المصرفية","created_time":"2016-09-13T08:06:27+10:00","total_likes":2,"total_comments":1},{"id":"172338516139198_1226692564037116","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":"السلام عليكم\n\nسؤال بعيد عن المجال شوية بس عاوز الافادة - هل ممكن اسطب mac على اللاب توب بدل وبنوز 10 ؟\n\nهل ساعتها حقدر اشتغل ب vs 2015 و Sql 2016 زى ما كنت شغال ع الوينوز - يمعت من ناس كتير ان الماك رائع بس مجربتوش","caption":null,"description":null,"created_time":"2016-09-09T03:44:52+10:00","total_likes":0,"total_comments":8},{"id":"172338516139198_1226752470697792","from":{"name":"Mohamed Radwan","id":"10158356933185192"},"message":"في فكرة بمكن تفيد الجميع الي شغالين في مجالنا ونبقى متواصلين دائما .وهيا نعمل علىchannel Slack . \n لكل تكنولوجي مثلا  وكل الي مهتمين بالمجال ده يدخلوا وينشروا المواضيع الي مرتبطة بالمجال ده وهاكذا بمكن نبدأ ب  ","caption":"yalla-it.slack.com","description":null,"created_time":"2016-09-09T05:09:04+10:00","total_likes":15,"total_comments":17},{"id":"172338516139198_1230131457026560","from":{"name":"Ahmed Ali","id":"1243188289109905"},"message":"ف حد عنده خبره ف ال webgl ؟ ..","caption":null,"description":null,"created_time":"2016-09-13T00:51:30+10:00","total_likes":2,"total_comments":4},{"id":"172338516139198_1231249623581410","from":{"name":"Mohamed Abu Galala","id":"1215961701856579"},"message":null,"caption":null,"description":"وزى ما قالوا زمان :D \n\"we all know that photos can be animated but ..., walls animated ...!?!? that's cool.\"\nطبعا انا اللى قايل المقولة دى :D \n.....شركة  Büro Achter April الالمانية شغالة فى مشروع تقدر من خلاله انها تحول اى حائط ل animation والمشروع ده كان مجرد خيال وعشان يبرزوا تفكيرهم عملوا ال فيديو ده وهما شغالين فيه حاليا .\n#حيطة_ضد_الملل\n#Animated_wall","created_time":"2016-09-14T06:09:44+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1231285960244443","from":{"name":"Ahmed Essam","id":"440145042983821"},"message":"النهارده فيه شخص على الجروب دا أو جروب تاني تقريبًا سألني هل أقدر ببايثون إني ابرمج برامج سطح مكتب؟ ... لأنه شايف إني في دوراتي في بايثون مثلاً بستعرض البرنامج من خلال Command Prompt، فقولتله طبعًا وفيه أكتبر من مكتبة للكلام دا.\nحبيت اعرض برنامج صغير عملته النهارده بمكتبة PyQT وهو عبارة عن آلة حاسبة، وتقدروا تحملوا البرنامج من اللينك اللى في الـRepository\nhttps://github.com/lilessam/DumbPythonCalculator\nدا مثال بسيط عملته عشان هعمل دورة مجانية بإذن الله في برمجة الدسكتوب ببايثون وهيكون دا مشروع الدورة.","caption":"github.com","description":"DumbPythonCalculator - Dumb Calculator Made Just For Fun !!!","created_time":"2016-09-14T07:19:10+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1231482313558141","from":{"name":"Ahmad Sherbeny","id":"10209231351156930"},"message":"Hey guys,\nWhich companies provide [stable] wireless internet service for home and small office use now ?\nThx.","caption":null,"description":null,"created_time":"2016-09-14T13:19:41+10:00","total_likes":1,"total_comments":2},{"id":"172338516139198_1231633350209704","from":{"name":"Ahmed Kamal","id":"10206651440364620"},"message":null,"caption":"articles.microservices.com","description":"Monolithic Architecture","created_time":"2016-09-14T18:36:22+10:00","total_likes":6,"total_comments":0}]}