{"posts":[{"id":"172338516139198_729185633787814","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"http://blogs.msdn.com/b/oldnewthing/archive/2014/04/11/10516280.aspx","caption":null,"description":null,"created_time":"2014-04-12T15:26:46+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_729222113784166","from":{"name":"Ahmed Al-Amir","id":"10155179919799180"},"message":"A security breach on Google's own servers.","caption":"blog.detectify.com","description":"To stay on top on the latest security alerts we often spend time on bug bounties and CTF’s. When we were discussing the challenge for the weekend, Mathias got an interesting idea: What target can we...","created_time":"2014-04-12T18:00:21+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_729334473772930","from":{"name":"Abdelrahman M. Moez","id":"1615887465092802"},"message":"Egyptian python programmers are required, contact if you are interested.\nContact mail: abdelrahman.moez@gmail.com","caption":null,"description":null,"created_time":"2014-04-12T22:17:03+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_729465007093210","from":{"name":"Mohamed Elsherif","id":"10158483817400314"},"message":"رابط الهانجاوت, انضم لنا الآن على الهواء\nhttps://plus.google.com/hangouts/_/hoaevent/AP36tYcNWTOjg9kcpri8LFuB1Bn1WAzfbM5Rf9ZGwDj0rP4j_7ZikA?authuser=0&hl=en\n\nرابط اليوتيوب لو مش لاقي مكان \nhttp://youtu.be/eePN0j_V2Pw","caption":null,"description":"رابط الهانجاوت, انضم لنا الآن على الهواء\nhttps://plus.google.com/hangouts/_/hoaevent/AP36tYcNWTOjg9kcpri8LFuB1Bn1WAzfbM5Rf9ZGwDj0rP4j_7ZikA?authuser=0&hl=en\n\nرابط اليوتيوب لو مش لاقي مكان \nhttp://youtu.be/eePN0j_V2Pw","created_time":"2014-04-13T04:02:07+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_729468110426233","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"timkadlec.com","description":"— January 14, 2014 — Fast Enough How fast is fast enough? I’m asked this question a lot. Page weights and load times vary so much …","created_time":"2014-04-13T04:11:34+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_728098627229848","from":{"name":"Ahmed Tarek","id":"10211388252395873"},"message":null,"caption":null,"description":null,"created_time":"2014-04-10T19:04:14+10:00","total_likes":12,"total_comments":22},{"id":"172338516139198_729492347090476","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"Still have about 7 hours #CodeJam #Google","caption":"code.google.com","description":"Now eleven years strong, the infamous Google Code Jam returns to throw intense algorithmic puzzles at programmers from around the world. Of the 45,000+ coders who registered to compete last year, it was Ivan Miatselski (mystic) of Belarus who, at the end of it all, stood alone as the Code Jam Champi...","created_time":"2014-04-13T05:14:00+10:00","total_likes":1,"total_comments":2},{"id":"172338516139198_729617957077915","from":{"name":"Meligy","id":"10154884040385170"},"message":"ES6 REPL in Chrome Dev-Tools\n\n","caption":"plus.google.com","description":"ES6 Repl: a DevTools extension for authoring & evaluating ECMAScript 6 code using Traceur …","created_time":"2014-04-13T11:31:59+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_729700093736368","from":{"name":"Asmaa Matar","id":"1656465334382931"},"message":"Dear Geeks,\nPlease Don't miss this event , it will be great , I promise.","caption":"Embedded Systems Track | IEEE AlexSB","description":"IEEE AlexSB is pleased to announce the beginning of its first Track (series of seminars) this year, which will focus on Embedded Systems.\n\nEmbedded systems –in a very general sense– are simply systems that are responsible for controlling a certain process or a cluster of processes, which may vary in their complexity and overlapping. However, due to the electronics revolution that took over the world many decades ago, embedded systems now are computerized systems that mainly rely in its core on microprocessors or microcontrollers to organize and synchronize the execution of the processes they are in control of.\n\nEmbedded systems not only employ microprocessors to manipulate digital data, but also employ many peripherals and sensors that can interact with the physical world and implement physical quantities digitally so it would be more suitable for the operation of the microprocessors; these peripherals and sensors are digitally interfaced with the controllers and communicate with them via standard protocols like RS-232, SPI, I2C (I squared C)…and many more.\nMany devices and instruments that we use in our daily lives rely in their operation on embedded systems, such as: airplanes, cars, microwaves, digital watches, mobile phones, and air conditioning systems.\n\n--\n\nThe first session of our Embedded Systems Track will focus on two main topics; “The Internet of Things” (IOT), and The ARM Processors Architecture.\n\nThe Internet of Things (in a nutshell):\nThe term “Internet of Things” refers to uniquely identifiable objects and their virtual representations in an Internet-like structure. It simply aims to create a vast network structure like the internet, in which objects, buildings, services, means of transportation, and even people, would be interconnected and can communicate with each other, and everything connected to this network would have a unique identity. This will allow for an easier and faster exchange of information, and will facilitate and organize many of our everyday activities.\n\nARM Processors Architecture (in a nutshell):\nARM is the abbreviation of “Advanced RISC Machine”. It is a family of instruction set architectures for microprocessors, which is based on the reduced instruction set computing (RISC) developed by the British company ARM Holdings.\nARM processors are widely used in a variety of products and devices, such as smartphones, tablets, digital cameras…and a lot more.\nFor more information about ARM Processors, please visit this link: http://goo.gl/rpaZXT  \n\n\n\nHere’s the main outline of the session:\n\n• What is “The Internet of Things”?\n• What is meant by “Embedded Systems”?\n• Introduction to the basics of Embedded Systems Engineering.\n• What is ARM.\n• ARM Market Share and Applications.\n• ARM Products and families.\n• Arm Design Philosophy.\n• Arm Technologies.\n• Embedded System Hardware.\n• Embedded System Software.\n• ARM Core Developer Guide.\n\n--\n\nSession Date: Sunday 13th of April, 2014.\n\nSession Time: 3:00pm to 5:00pm.\n\nSession Place: Classroom (104), ground floor, Electrical Engineering Building, Faculty of Engineering, Alexandria University.\n\n--\n\nAbout the speaker: Mr. Mahmoud Sayed\n\nMr. Mahmoud Sayed received his Bachelor’s degree in Electronics and Communications Engineering In 2009 from Cairo University. \nHe is currently working as a Business Development Manager at PiTechnologies Inc. \nMr. Mahmoud is also the technical instructor for Embedded System Development Track at the Faculty of Computer and Information (FCI) at Cairo University, and also at Ain Shams University.\nMr. Mahmoud worked as a supervisor on a number of projects in the field of embedded systems such as: the Simulation of HSDPA/HSUPA Protocol (High Speed Downlink/Uplink Packet Access), the Simulation and implementation of ZIGBEE Protocol 802.15.4-20, and Objects monitoring through sensor-networks nodes.\nPrior to his current position, Mahmoud worked as a Senior Software Engineer at PiTechnologies.\n\n\n\n**********************************************************************************\nIEEE: The world's leading professional association for the advancement of technology\n**********************************************************************************","created_time":"2014-04-13T16:58:46+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_729848433721534","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"The missing art of exception handling\n\n","caption":"alaaattya.wordpress.com","description":"First I would like to start by a quote I've learnt from Dr.yasser farouk (one of the doctor I'm proud to learned from) 'as a developer it's a shame to let the OS throw your code out of CPU because ...","created_time":"2014-04-13T20:43:06+10:00","total_likes":3,"total_comments":0}]}