{"posts":[{"id":"172338516139198_920895281283514","from":{"name":"Riad Ricoz","id":"10154598328228871"},"message":"what are the best lenovo i5 laptops ??\nCost About : 4,000 EGP","caption":null,"description":null,"created_time":"2015-04-06T08:03:10+10:00","total_likes":0,"total_comments":25},{"id":"172338516139198_920715201301522","from":{"name":"Ahmad A. Elghany","id":"1766716286975105"},"message":"الجزء التاني من مقابلات عمل رشا في ال silicon valley","caption":"manshar.com","description":"كنت قد كتبت عن تجربة مقابلتي مع جوجل وفيسبوك ملاحظة: اتحدث بشكل عام عن لينكد ان وفيسبوك واسئلتهم، وبالتفصيل مع الأسئلة والحل عن أمازون مقابلتي مع لينكد إن قابلت فتاة في أحد الفعاليات التي أحضرها، وكانت تعمل في لينكد إن، ذكرت أنهم يقابلون الان بكثرة خصوصا لFront End ووظائف ويب.…","created_time":"2015-04-06T00:02:58+10:00","total_likes":25,"total_comments":0},{"id":"172338516139198_920894821283560","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":"codefights.com","description":"Test Your Coding Skills","created_time":"2015-04-06T08:01:29+10:00","total_likes":20,"total_comments":2},{"id":"172338516139198_921432347896474","from":{"name":"Ahmed Al Jabry","id":"1422451614480113"},"message":null,"caption":"thenextweb.com","description":"If you deliver presentations often, this is a neat trick to add to your arsenal and hold your audience's attention.","created_time":"2015-04-06T21:48:36+10:00","total_likes":5,"total_comments":1},{"id":"172338516139198_921510921221950","from":{"name":"Moataz Omr","id":"10154939533020569"},"message":null,"caption":null,"description":null,"created_time":"2015-04-07T01:06:18+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_920824374623938","from":{"name":"Mostafa Yahia","id":"10211945267005669"},"message":"شباب فى حد عنده اى معلومه عن جهاز يدينى باور لمدة ساعة او اتنين بالكتير \nعشان لما النور بيقطع الراوتر بيفصل فانا هشغل عليه راوتر بس \nبس طبعا مش لازم يكون مولد كبير هو حاجه بسيطة بس يشتغل عليه راوتر وشاحن الاب \nلو حد يعرف جهاز كده يريت يقوللى","caption":null,"description":null,"created_time":"2015-04-06T04:47:53+10:00","total_likes":2,"total_comments":25},{"id":"172338516139198_920848004621575","from":{"name":"Mohamed Atef Abd ElWahab","id":"10155220916862048"},"message":"السلام عليكم .. بما ان محدش هيفهمنى ألا الناس اللى هنا . ف انا هسأل سؤالى هنا  بعد أذنكم . \nانا حاليا شغال على سيستم \nفى جزء من السيستم مطلوب منى أستخدم جهاز Fingerprint Reader لفحص بصمة الشخص و أسمحله بالدخول او الخروج على  أساس الداتابيز اللى عندى فى السيستم مش اللى موجودة فى الجهاز  .. ف  أنا سئلت وعرفت ان الأجهزة المتوفرة حاليا ال output بتاعها Excel file .. أنا عايز اسئل بقا لو فى جهاز بيخرجلى داتابيز او معاه داتابيز اقدر اعدل عليها بحيث اربطها فى الداتابيز اللى عندى بسهولة .. و أيه الشركات الموجودة فى مصر اللى ممكن اسئلها ؟؟\n\nشكراً مقدماً","caption":null,"description":null,"created_time":"2015-04-06T05:53:27+10:00","total_likes":1,"total_comments":25},{"id":"172338516139198_921631647876544","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":"They sponsor work visas: TechMeAbroad Is A Job Board Where Foreign Devs Can Find Skill-Seeking Startups","caption":"social.techcrunch.com","description":"TechMeAbroad is a tech jobs startup specifically for developers looking to find work abroad -- be it in Silicon Valley or elsewhere -- helping them find..","created_time":"2015-04-07T06:02:37+10:00","total_likes":17,"total_comments":2},{"id":"172338516139198_921960391177003","from":{"name":"Ahmad Gamaleldin Hassanein","id":"10154942637951276"},"message":null,"caption":"theguardian.com","description":"Every year, 2 million people apply for a job at Google – and Laszlo Bock decides who gets in. So what’s the secret? Tom Lamont hears how to make a big impression","created_time":"2015-04-07T21:35:20+10:00","total_likes":4,"total_comments":0},{"id":"172338516139198_922127991160243","from":{"name":"Ahmed Bahnasy","id":"1270319029713569"},"message":null,"caption":null,"description":"هنتكلم النهارده عن الفرق بين المواقع المكونه من صفحه واحده والمواقع الطبيعيه المكونه من كذا صفحه\n\nالاول خلينا نتفق ان احنا عندنا نوعين من التصميم \n 1- موقع ذو صفحات متعدده وده الطبيعي اللي كلنا عارفينه\n2-موقع مكون من صفحه واحد بس \nطيب احنا كلنا عارفين النوع الاول ايه بقي النوع التاني ده ؟؟؟؟\n\nفي الفتره الاخيره ظهر فكره انك تعمل الموقع بتاعك كله في صفحه واحد بس بدل كذا صفحه\nوالصفحه دي بتبقي عباره عن مجموعه من السكاشن و كل سكشن فيه جزء معين بيخص موضوع معين انت عاوز تعرضه في الموقع بس بطبيعه الحال بيبقي كل الاجزاء دي ليها علاقه ببعض وكمان بتبقي مكمله لي بعض \nفا الموقع بتاعك بيبقي عباره عن قصه صغيره مكونه من مجموعه من الفصول \nزي الموقعين كده اللي هتلاقوهم في اول كومنت \n\nطيب امتي بقي استخدم ده وامتي اشتغل بالطبيعي اللي احنا عارفينه \nبص يا عم هو الاول انك تعمل الموقع في صفحه واحده ده ليه مميزات كتيير اوي هنتكلم عليها في بوست تاني ان شاء الله \nبس مش معني كده انك اي موقع تعمله يبقي في صفحه واحده \nلان الاختيار ده هيتحدد علي حسب طبيعه الموقع اللي انت عاوز تعمله \nلو الموقع ده بيتكلم عن فكره واحده او منتج واحد سواء منتج مادي او فكري يبقي يستحسن انك تخليه موقع مكون من صفحه واحده \nاو لو كان موقع بيمثل شخصيه معينه او منظمه معينه مثلا \n\nانما لو الموقع فيه كميه معلومات كتيير و اجزاء مختلفه عن بعضها \nزي مثلا ان تعمل متجر الكتروني في الحاله دي هيبقي الاحسن ليك انك تعمل موقع ذو صفحات متعدده\n\nتابعونا في البوست الجاي هنزل مميزات الموقع ذو الصفحه الواحده\n\n#شير_في_الخير","created_time":"2015-04-08T05:09:16+10:00","total_likes":4,"total_comments":0}]}