{"posts":[{"id":"172338516139198_1002214359818272","from":{"name":"Ahmed Refaey","id":"1471343682885337"},"message":null,"caption":"sitepoint.com","description":"Peter Bengtsson discusses how to measure the performance of your JavaScript functions and how to avoid some common pitfalls.","created_time":"2015-09-06T06:55:39+10:00","total_likes":6,"total_comments":0},{"id":"172338516139198_1002423496464025","from":{"name":"Mohamed Abdeljalil","id":"10154140768066222"},"message":"Greetings!\n\nThis a last and final call to join Dubai Smart City App Hack competition.  The application closing date is September 20th. The submissions will be judged during the period September 23rd to October 3rd.  Ten shortlisted applications will be announced on 6th October and invited to pitch at GITEX on 20 October.  The winning team will win all paid trip to Barcelona and a slot to pitch at the Smart City Word Expo 17-19 November.\n\nSteps to submit your final app?\n1. Join the Appcircus community by creating a user account.\n2. Create a public profile of your app. Remember it is important to have a clear and concise description.\n3. Submit at least 3 cool screenshots and a demo video showing your app in action (especially if your app is not yet available at a store). This is where the judges will base their score so do your best!\n4. Once you have the app profile ready, you can submit it at the Dubai SCAH Online Competition\n\nWho can participate?\nAnyone (a startup or an existing early stage company) with a finished app on the theme of one of the 5 areas of the Dubai Smart City App Hack are eligible to join. For more information regarding prizes, rules, T&Cs please visit our updated website at dubai.smartcityapphack.com\n\nFeel free to email/inbox me for any clarifications...\n\nHave a great day!\nMohamed Abdeljalil","caption":null,"description":null,"created_time":"2015-09-06T17:28:40+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1001463299893378","from":{"name":"MohAmed HAmada","id":"734288583412841"},"message":"السلام  عليكم.... \nانا شغال ف بروجكت بال MVC و بستخدم MVC.Grid عشان اعرض الداتا المشكله ان ال Photo الخاصه بال Employee مش بتظهر بتظهرلي String \nممكن اعرف ازاي اقدر اخليها  تظهر Image في Grid \nولا هو اصلا مينفعش عشان اناا عملت سيرش عليها و مش لاقي حل ليها \nدول Captures  للكود و لما بتظهر ع ال Browser","caption":null,"description":null,"created_time":"2015-09-05T01:57:36+10:00","total_likes":1,"total_comments":4},{"id":"172338516139198_1002580596448315","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"NATS comparison between Kafka and RabbitMQ is HUGE! Worth trying it.","caption":"nats.io","description":"NATS was created by Derek Collison, Founder/CEO of Apcera who has spent 20+ years designing, building, and using publish-subscribe messaging systems. Unlike traditional enterprise messaging systems, NATS has an always-on dial tone that does whatever it takes to remain available. This forms a great b…","created_time":"2015-09-07T02:12:47+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1002581139781594","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"A curated list of amazingly awesome PHP libraries, resources and shiny things.","caption":"github.com","description":"awesome-php - A curated list of amazingly awesome PHP libraries, resources and shiny things.","created_time":"2015-09-07T02:13:33+10:00","total_likes":10,"total_comments":1},{"id":"172338516139198_1002581389781569","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"A curated list of amazingly awesome open source sysadmin resources inspired by Awesome PHP.","caption":"github.com","description":"awesome-sysadmin - A curated list of amazingly awesome open source sysadmin resources inspired by Awesome PHP.","created_time":"2015-09-07T02:14:17+10:00","total_likes":8,"total_comments":1},{"id":"172338516139198_1002816036424771","from":{"name":"Ashraf Abdel Aleem","id":"1809964769326531"},"message":"هل تعتقدون أن تحول \"Duppizle\" إلى \"OLX\" بعد سلسلة الإعلانات ده كلها كان غلطة أم ماذا؟","caption":null,"description":null,"created_time":"2015-09-07T14:30:21+10:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1002979943075047","from":{"name":"Anas Emad","id":"10154264552927478"},"message":"Hi All, if i install another Android for nexus 4 like CyanogenMod are that will handle battery better ? \nare people recommend an app or trick to manage battery better .. please","caption":null,"description":null,"created_time":"2015-09-08T00:00:34+10:00","total_likes":0,"total_comments":4},{"id":"172338516139198_1002927546413620","from":{"name":"Amani Salah Khalifa","id":"10154540938681298"},"message":"I need a good Arabic morphology API.\nWhat I need exactly is to input an Arabic word, and the result would be if this word a verb or a noun or if it's a dual or a single  ... etc.\nI'm not looking to do anything from the start, I need an API to do this, or at least help me to reach this.\nI found a lot of tools when I search, but I'm not sure which ones are good, anyone tried anything related to this before?","caption":null,"description":null,"created_time":"2015-09-07T21:37:05+10:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1002599869779721","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":"I was searching for some blog posts to convince someone to start developing a new service in Go when I found this blog post from Parse. It's three month old but nice and may start a good discussion :D","caption":"blog.parse.com","description":"The first lines of Parse code were written nearly four years ago. In 2011 Parse was a crazy little idea to solve the problem of building mobile apps. Those first few lines were written in Ruby on Rails. Ruby on Rails Ruby let us get the first versions of Parse out the door quickly. It let a small te…","created_time":"2015-09-07T03:05:07+10:00","total_likes":9,"total_comments":1}]}