{"posts":[{"id":"172338516139198_653243264715385","from":{"id":"538395486","name":"Dody Gunawinata"},"message":"My company is looking for web engineers. We have been working on interesting problems lately and need some extra manpower(e.g. how to keep track of a billion dollars month, how to efficiently organize and distribute 737 pilots' flight schedule, etc). We are mainly working with .NET stacks although nowadays our infrastructure stacks are pretty diverse.  Send me your resume (or even better, github profile) to dodyg@silverkeytech.com.","caption":null,"description":null,"created_time":"2013-11-14T13:27:51+03:00","total_likes":3,"total_comments":0},{"id":"172338516139198_653310054708706","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"https://github.com/LearnBoost/Socket.IO/wiki","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2013-11-14T17:00:37+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_651577798215265","from":{"id":"621729918","name":"Mohamed El Kerdany"},"message":"Dears,currently we are creating a form generation for medical application and sure data and schema is very dynamic , so we are thinking to work with NoSQL database to store the information as it is document based and schemaless , what do you recommend MongoDB or CouchDB ? is server management for these dbs is complex as the deployment could be over intranet or shall i go for Amazon Dynamodb and force them to work over internet (Which in some cases could be hard )? your recommendations are highly appreciated","caption":null,"description":null,"created_time":"2013-11-11T12:54:57+03:00","total_likes":0,"total_comments":14},{"id":"172338516139198_653033698069675","from":{"id":"544815169","name":"Mohamed Meligy"},"message":".NET to native\n\n\"@maryjofoley: Microsoft shows a glimpse of its mysterious 'Project N' compiler technology http://t.co/DkcPoMYm6P","caption":"www.zdnet.com","description":"Microsoft execs quietly showed off new compiler technology under development at the company that aims to compile .Net code to native code directly.","created_time":"2013-11-14T03:06:52+03:00","total_likes":4,"total_comments":3},{"id":"172338516139198_653678844671827","from":{"id":"683805169","name":"Mohamed El Sayed"},"message":"دا فريق العمل المسئول عن برنامج جميل جداً من فئة البرامج المتخصصه في إدارة ميزانية البيت ومتابعة النفقات إسمه YNAB.\nالملاحظ فى الصفحه (واللى ممكن يكون غريب عند بعض الناس) إن أعمار أغلب المبرمجين فى الفريق شكلهم فوق ال 35 او يمكن كمان فوق ال 45 سنة, والبرنامج ناجح, والناس عاملين شغل ممتاز.\nطيب ليه انا بعمل شير لحاجه زى دى؟ علشان أحاول أصحح الصورة المغلوطه اللى بتصور انك لو عندك 30 ~ 35 سنة ولسه بتكتب كود, أو لسه مبقتش Senior, أو Team Leader لحد دلوقتى تبقي فاشل, إلى أخر النماذج اللى على نفس الشكل, يفهموا إن الموضوع مش كدا خالص.\nالموضوع كله متعلق بخبراتك المتراكمه وبمهاراتك وبحبك وفهمك للبرمجه.\n\nإشتغل وبطل التفكير الحكومي بتاع سنتين من التخرج يبقي لازم ابقي Senior, يعدى كمان 3 سنين أبقي Team Leader, بالشكل دا لما يبقي عندك 40 سنة المفروض تبقي رئيس حكومه.\nالدليل على كلامي فى الجزئية الأخيره إن الواحد صادف العديد من المبرمجين أصحاب المناصب إشي دا Senior ودا team lead ودا بقي يقولك انا technical lead  والأخير دا يخضك ويقولك انا Architect, وبالنقاش معاهم بتبان الصوره وهى إنهم من أصحاب الفكر الحكومي اللى وجدوا شركات ضعيفة المستوي ممكن يقنعوهم بأنهم مؤهلين للمناصب دي, وخبراتهم لا يمكن أبداً أن تؤهلهم لتلك المناصب لو كانوا فى شركات بتعرف إزاى تختبر الناس قبل ما توظفهم.\nالشيء الأخر اللى بيلعب دور كبير فى خلق النماذج دى هى المحسوبيه والوساطه فى الشغل. ودا شيء بيدمر أى شخص مجتهد لما يلاقي اللى جنبه علشان بيمسح جوخ (مصطلح مصري أصيل, دور عليه :) ) او بيطاطي للمدير, إترقي واتمريس عليه, والتاني ياعيني لسه فى مكانه لأنه مجتهد بس, من غير حتة المحلسه دي.\nالخلاصه: إشتغل وإجتهد لنفسك, وبإذن الله ربنا هيوفقك وسيبك من وهم المناصب اللى بالسنة وسنتين دى.\nعنوان الصفحه: http://www.youneedabudget.com/company/team","caption":"www.youneedabudget.com","description":"The YNAB Team hails from Australia to Austin, Texas — from Massachusetts to Maine — and a tiny hop from Arizona to Utah. Did we mention Switzerland?","created_time":"2013-11-15T11:08:55+03:00","total_likes":7,"total_comments":0},{"id":"172338516139198_653007254738986","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Microsoft #VisualStudio in the browser? Yes, for real, look for the word \"Monaco\":\n\nhttp://www.visualstudio.com/en-us/news/2013-nov-13-vso","caption":"www.visualstudio.com","description":"Today we take a very significant step in the evolution of our developer services. There are many pieces to it so bear with me while I get to them all. And please read all the way to the end for some exciting announcements.","created_time":"2013-11-14T02:14:15+03:00","total_likes":5,"total_comments":12},{"id":"172338516139198_653846227988422","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2013-11-15T20:49:24+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_653876817985363","from":{"id":"794574128","name":"Ahmed Adel"},"message":null,"caption":"www.huffingtonpost.com","description":"CAIRO -- A new project planned for downtown Cairo has techies and entrepreneurs buzzing.","created_time":"2013-11-15T22:07:46+03:00","total_likes":2,"total_comments":0},{"id":"172338516139198_654017364637975","from":{"id":"1020538858","name":"Ahmed Abdelrahim M. Jadelrab"},"message":"A new IDE with amazing concept....","caption":null,"description":"Light Table is now on kickstarter! http://www.kickstarter.com/projects/306316578/light-table Light Table is a new kind of IDE built on principles of simplicity…","created_time":"2013-11-16T04:20:27+03:00","total_likes":1,"total_comments":1},{"id":"172338516139198_653842821322096","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2013-11-15T20:39:29+03:00","total_likes":2,"total_comments":1}]}