{"posts":[{"id":"172338516139198_1200547623318277","from":{"name":"Islam Khalil","id":"10155095959654187"},"message":"Question to geek friends, has anyone recently been having difficulty accessing your overseas servers?\nWe suddenly got cut-off from some of our severs (we still can access the rest). The weird thing is that we cannot reach them over any encrypted port (ssh, VPN, etc) even on different non-standard port numbers.\nWe got this response from a provider.\nMoreover, when we tried to access them from outside Egypt everything worked fine.\nWhen we troubleshoot the thing we find out that the connection is established but certificate negotiation fails. It seems out a####le government is installing something that messes up certificates on the way.\nDoes anyone know if this is a temporary situation or if they will incrementally cut-off services ?","caption":null,"description":null,"created_time":"2016-08-11T01:41:35+10:00","total_likes":3,"total_comments":8},{"id":"172338516139198_1201289129910793","from":{"name":"Abdullah El-menawy","id":"10202808632734302"},"message":"Guys\nI want to ask about the middle ware technologies like TIBCO and MuleSoft (.NET)\nIs it promising?\nIs there any ability for self development based on development using them?","caption":null,"description":null,"created_time":"2016-08-11T18:17:57+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1199233896782983","from":{"name":"Mostafa Elsayh","id":"1417211125005592"},"message":"عايزين نشوف الجوده المصرية فى البرمجة وأهمية جودة الكود بالنسبة للناس المبرمجين اللى فى الجروب مين هنا بيعمل اختبار للكود Unit Testing أو بمعنى اخر Automated Testing وليه ده مهم جدا؟","caption":null,"description":null,"created_time":"2016-08-09T07:09:27+10:00","total_likes":6,"total_comments":3},{"id":"172338516139198_1200512909988415","from":{"name":"Muhammad Sabry Abdulwanis","id":"10212106739285334"},"message":"Hello geeks, I am learning TDD and I have a question here in stackoverflow if you would help me I would be grateful\nThank you.","caption":"stackoverflow.com","description":"I have a unit Test where I want to test different input and make sure the output is correct. I created a Unit test for all of the test cases as follow [TestMethod] public void CountInversion...","created_time":"2016-08-11T00:46:35+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1199724393400600","from":{"name":"Basem Mostafa","id":"10212154827376546"},"message":"ياجماعه ناخد بالنا من ال CV شويه مش كده :D","caption":null,"description":null,"created_time":"2016-08-09T23:35:09+10:00","total_likes":25,"total_comments":15},{"id":"172338516139198_1201387543234285","from":{"name":"Mohamed Nady","id":"10154387282503733"},"message":"Question Title : \"From Your Experience Perspective\" Which Database is the best choice for large data volume.\n\nProblem Info   : \n                 - We are about to start a new project which in the future should have a massive large database, Millions of recordes\n                 - SQL Server Can Handel this scenario in appropriate way ?\n                 - Actually We are hesitated in our Decision \n\nConsecrations : \n                - We will use  ( .Net WebApi ) For The Data Interactions.\n                - Data Will be ( On premise  ) in the organisation Servers (No Payed Cloud).\n                - We will Execute a Complex Data Operations ( Query , Insertion , Data Analysis , etc ..) \n\n#NoSQL #SQL #BigData #mongodb #SqlServer","caption":null,"description":null,"created_time":"2016-08-11T21:34:14+10:00","total_likes":3,"total_comments":15},{"id":"172338516139198_1202057333167306","from":{"name":"محمد كرم","id":"10212597400354974"},"message":"السلام عليكم\nعندي مشكلة في التابلت لفيت عليها مواقع و منتديات كتير و مش لاقي الحل\nالتابلت lenovo ideatab A3500-HV كان اتقفل و اتفتح وقف عند اللوجو و مرضيش يكمل، دخلت على الـRecovery mode وعملت له Factory reset، بس حصلت حركة غبية مني انه جاب شاشة سوداء (الشاشة منورة بس سوداء) رحت قافله و فتحته تاني. بقى بعد كده بيدخل على الـRecovery mode على طول و يطلع لي error بيقول :\nMount /data error, force format /data\nMount /data error.\nو لما بعمل factory reset بيجيب لي error : Cannot get to phone encrypt state\nرحت منزل الـfirmware تاعته من هنا : http://www.needrom.com/download/lenovo-a3500-hv-kk بس المشكلة انه مش راضي يعمل setup سواء بالـflashing tool لأن الجهاز مش راضي يقراه لأنه في الـrecovery mode و مش عارف اشغل الـUSB debugging و لما بحط الـROM على SD card بيقولي installation aborted و بيعمل نفس الحكاية في الـADB sideload\nفلو حد عنده حل للمشكلة هكون شاكر جدًا","caption":"needrom.com","description":"ROM Lenovo A3500-HV - ROM Android 4.4.2 Based Official ROM Lenovo A3500-HV Version: Lenovo_A3500-HVPRC_A442_01_S013 - KOT49H Gapps","created_time":"2016-08-12T19:15:33+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1202162086490164","from":{"name":"Ahmed Osama","id":"1636336903048750"},"message":"شكل الفيس بوك اتفحت بسبب ال ad blockers =D\n\nحرب الإعلانات بين فيسبوك وبرامج الحجب\n","caption":"aljazeera.net","description":"أشعل إعلان شركة فيسبوك أنها ستواصل إظهار إعلانات لمستخدمي برامج حجب الإعلانات في نسخة سطح المكتب من موقعها، حميّة الشركات المطورة لبرامج الحجب التي أكدت أنها ستتخطى هذا الأمر.","created_time":"2016-08-12T22:34:49+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1199982063374833","from":{"name":"Ali Bedaer","id":"1143367152438781"},"message":"هو انا ازاى يا جماعه اقدر اقيس ال performance بتاع فانكشن معينه فى php بتاخد وقت قد ايه مثلا او ال query فى mysql اخد وقت قد ايه ازاى اقدر اعمل كدا ؟؟؟","caption":null,"description":null,"created_time":"2016-08-10T06:50:12+10:00","total_likes":1,"total_comments":6},{"id":"172338516139198_1202031919836514","from":{"name":"Omar Ibrahim","id":"10113230069002554"},"message":"Building applications that require data sync can be a hassle if you are trying to build it from scratch. I just ran into https://simperium.com/ by Automattic, makers of WordPress,  and it seems like an awesome solution free to up to 2500 users monthly active users. \n\nIf anybody knows a similar service, please mention it as well.","caption":"vimeo.com","description":"This is \"Simperium: a new data layer for developers\" by on Vimeo, the home for high quality videos and the people who love them.","created_time":"2016-08-12T18:06:46+10:00","total_likes":4,"total_comments":1}]}