{"posts":[{"id":"172338516139198_1105515599488147","from":{"name":"Mohamed Elnagar","id":"10212736613196934"},"message":"Good to learn algorithms and data structures\n","caption":"interviewbit.com","description":"Learn and Practice on almost all coding interview questions asked historically and get referred to the best tech companies","created_time":"2016-03-24T08:35:47+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1105172472855793","from":{"name":"Ahmed Badawy","id":"1285105998248677"},"message":"ده للناس إلى عايزة تدخل جديد فى الروبى...\nبذاكر الروبى و الريلز. قابلتنى مجموعة مشاكل و عندى حبة نقد للفرامورك...\n \nالبوست ده بيتكلم عن الريلز فقط لأنى حاليا معنديش الخبرة الكافية أنى أتكلم عن الروبى نهائى...\n \nبالنسبة للـ db أضطريت أستخدم الـ mysql لأنى معديش أى خلفية للتعامل مع الـ sqlite وهو الديفلت.... قابلتنى مجموعة مشاكل فأضطريت استخدم ال mysql installation من الـ xamp لأنه كان متسطب عندى أصلا...\n \nأما جيت أشغل الـ cmd و أبنى الـ gemfile لقيته طلعلى خطء بصيت عليه لقيت لازم أكتب الأمر chcp 1252 كل مرة أفتح cmd جديد. تقريبا مشكلة فى الـ windows 10...  \n\nو لقيت الريلز بطئ أوى أوى فبصيت عل نت قالى المشكلة فى الديفلت سرفر WEBrick \nو قالولى أستخدم الـ thin بدلا منه. والحمد لله تمام شغال دلوقتى... \n\nالمهم أخيرا كله أشتغل تمام...\n\nبصة مبدئية الـ rails مطابق فى كل أفكاره للـ laravel بكل تفاصيلها فبالتالى مش هيبقى صعب عليا أتعلمه... فى حبة حاجات ملهاش لزمة هم حطينها آختيارى... \nزى مثلا: الـ compiler بتاع الـ scss و الـ coffie script ملهوش لزمة خالص بعد ظاهرة الـ node بالـ compilers بتاعته (انا بستخدم الـ gulp تحديدا)... و ثانيا الـ coffee script عندى مشكلة معاه أصلا لأنه بيعودك على كتابة الكود بشكل معين و مع الوقت هتعود عليها و مش هتعرف تكتب js عادى... \n\nأما بالنسبة للـ versioning control ملهوش لزمة لأنك بمنتهى البساطة مش محتاجة غير فى الـ production مع أنك قليل أما تعمل تعديلات style , js فى البرودكشن و كمان تقدر تعدل الـ version بمنتهى البساطة بإضافة ?v=رقم    فى نهاية الـ file المراد تحميله. ليه بقى كل السواد إلى هم عاملينه ده ؟؟؟ \nكل مشكلة الـ version control تتحل برقم صغير جلوبال يتخط فى آخر كل ملف يتم أستدعائة فى الـ production... \n\nو كمان الـ html helpers و الـ form helpers زيهم زى الـ coffee script  كم الوقت إلى هتضيعه تتعلمهم و تكتب بيهم نفس الوقت إلى هتكتب فيه html عادى و يمكن تستهلك وقت أطول كمان ومتنساش ان مهمتهم الأصلية أصلا هى (تلخيص الوقت)... وكمان معظمنا كاتب snippets للـ html فى الـ editor إلى بتستخدمه و متعود عليها. ليه تغيرها طالما أسهل و مفهومة أكتر... \n\nبالنسبة لدوال التلاعب بالزمن مش كافية و محتاجة إضافات و تعديلات كتيرة.. انا كنت بستخدم carbon فى الـ php بس هنا شكلى هضطر أكتبهم فى الروبى أو جايز ألاقى مكتبة بالحاجات إلى محتاجها... \n\nالـ debuging مش حلو نهائى و ضعيف جدا جدا جدا فى الريلز و حاسس إنى ضايع فيه ومش لاقى خيط تعرفنى إيه المشاكل إلى ممكن تحصل فى الكود بالظبط... تايه أوى فيها... \n\nبس أنا حاسس أن الريلز محتاج حاجات كتيرة تتعمل فيه و نقاصه حبة حاجات... مثلا محتاج orm أفضل من كدة شوية لأنه ملخص حبتين عن الـ elequent و كمان عاوزين دوال itirations معدلة شوية عشان الـواحد أخد على نظام الـ collections فى الجافا و اللارافيل فمحتاج حبة تعديلات على ده شوية... \n\nبالنسبة الـ unit testing , data validation , migrations , seeding , الريلز رهيب فيهم و مقدرش أقول حاجة عنه...\nوطبعا ال روبى متفوقة على الـ php فى سرعة الكتابة و سهولة اللغة بكتير... فدى نقطة مهمة فى صالح الـ rails...\n\nو من تعليقات ناس كتير استنتجت أن الـ الروبى أفضل من الـ php فى الـ security كمان...","caption":null,"description":null,"created_time":"2016-03-24T01:46:21+11:00","total_likes":0,"total_comments":4},{"id":"172338516139198_1094032480636459","from":{"name":"Abdelrhman Safwat","id":"10158380020640341"},"message":"My brother came to me yesterday wanting me to teach him programming and I want to do it the right way. I was asking him how should I start with a simple programming language like javascript or with the programming concepts like data structures and algorithms ?? also if there are beginners courses that are available in Arabic or with Arabic translations that would be very helpful.","caption":null,"description":null,"created_time":"2016-03-09T19:32:06+11:00","total_likes":2,"total_comments":11},{"id":"172338516139198_1105344099505297","from":{"name":"Amir Abou Eesa","id":"1353018234756623"},"message":"Anyone facing the same Windows 10 Wifi , Search and menu problems \"I know there is a lot !\", will new updates solve it or it will make it worse :S\n----------------------- Updates\nHowever i think anyone  has Windows 10 now will know what im talking about :) but this is what im facing \n\n1- Occasionally disconnecting from Wifi\n2- When you try to click Wifi Icon Nothing  happen\n3- When You Open Start Menu \"If it opened\" will not allow you to search \nBesides all of Windows Store Apps are not functioning any more after trying the famous fix of re-installing all Store Packages","caption":null,"description":null,"created_time":"2016-03-24T04:28:00+11:00","total_likes":2,"total_comments":6},{"id":"172338516139198_1106014412771599","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"For beginners and experts, this is a good read for both.","caption":"github.com","description":"HowToBeAProgrammer - A guide on how to be a Programmer - originally published by Robert L Read","created_time":"2016-03-24T20:59:13+11:00","total_likes":25,"total_comments":1},{"id":"172338516139198_1105608446145529","from":{"name":"Mohamed Tarek El Haddad","id":"10158142026600408"},"message":"Geeks,\n\nOut of mere curiosity, I'd like to know your thoughts on the Apple iOS backdoor story. \n\nI personally think it's purely a trust building feat more than anything else. Especially because most of the companies that backed Apple in the backdoor issue, are involved in PRISM: https://en.wikipedia.org/wiki/PRISM_(surveillance_program) - Microsoft, Fb, and Google were among the first to back Apple's position against the FBI, and they're all in there, including Apple of course.\n\nI understand that a backdoor would be a whole other level of wtf, but I would still not be very trusting of them from a privacy POV, if at all.\n\nThoughts?","caption":"en.wikipedia.org","description":"PRISM is a clandestine[1]surveillance program under which the United States National Security Agency (NSA) collects internet communications from at least nine major US internet companies.[2][3][4] Since 2001 the United States government has increased its scope for such surveillance, and so this prog…","created_time":"2016-03-24T10:47:10+11:00","total_likes":2,"total_comments":1},{"id":"172338516139198_1106021316104242","from":{"name":"Rafael Adel","id":"10155242150027122"},"message":"لما بدور على الوظايف المتاحة فى مجال ال IT فى مصر بلاقي بعد asp.net و php developers بلاقي ساعات java developers.. كنت عايز اعرف اغلبية شغل الجافا فى مصر بيبقي ويب برضو ولا حاجة تاني ؟","caption":null,"description":null,"created_time":"2016-03-24T21:12:07+11:00","total_likes":2,"total_comments":3},{"id":"172338516139198_1106132292759811","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"1.15 Million requests served per second !\n#AspNet_Core #Improvments","caption":"ageofascent.com","description":"Congratulations to ASP.NET Core and .NET Core teams and the Open Source .NET community for quite a milestone in performance!","created_time":"2016-03-24T23:41:53+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1106479029391804","from":{"name":"Amr Ali Tealeb","id":"10155204265056336"},"message":null,"caption":"citusdata.com","description":"Citus Unforks From PostgreSQL, Goes Open Source","created_time":"2016-03-25T06:17:04+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1104982699541437","from":{"name":"Ahmad Abdel-Halim","id":"1933903146842707"},"message":"The node.js left-pad story.","caption":"www.theregister.co.uk","description":"left-pad pulled from NPM – which everyone was using","created_time":"2016-03-23T21:52:31+11:00","total_likes":25,"total_comments":10}]}