{"posts":[{"id":"172338516139198_1262735530432819","from":{"name":"Ahmed Aswani","id":"10158476825265637"},"message":"He Is 69 and still coding :)\nnever say I'm old to write code\n","caption":"quora.com","description":"Bob Jones's answer: I will be 69 in a week. I have been programming since 1967. That's 48 years that cover COBOL to jQuery. I have forgotten more programming languages than most programmers will ever encounter. I work now as a contractor because I am so \"over\" working as an employee that even if ...","created_time":"2016-10-19T23:27:00+11:00","total_likes":8,"total_comments":1},{"id":"172338516139198_1263528653686840","from":{"name":"Sameer Al-Salous","id":"1306665049412730"},"message":"طلب مساعدة يا شپاب\nقدمت في شركة امريكية عايزة واحد junior php developer \nExperienced in core php \nGood in Ajax - jquery\nFamiliar with XML - json\nالمطلوب\nMaintains our systems \nالسي في اتقبلت لكن فيه \n15 minute Technical interview\n\nمش عارف طبيعة الانترفيو و أسئلتها بتكون معاهم ازاي خاصة حتة 15 minute\nنصيحتكم أراجع أيه و استعد ازأي\nطپعا الڜغل from home","caption":null,"description":null,"created_time":"2016-10-20T20:20:34+11:00","total_likes":1,"total_comments":7},{"id":"172338516139198_1263848326988206","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"I can't get some python modules to install on Windows. Help? (Note: I'm on Python 2.7.11 now, same problems)","caption":null,"description":null,"created_time":"2016-10-21T04:23:46+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1263853233654382","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"I can't get some python modules to install on Windows. Help? (Note: I'm on Python 2.7.11 now, same problems)","caption":"stackoverflow.com","description":"so I'm on Python 3.5.2, I'm trying to install scrapy, it throws an error saying Failed building wheel for lxml Could not find function xmlCheckVersion in library libxml2. Is libxml2 installed...","created_time":"2016-10-21T04:32:50+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1263803476992691","from":{"name":"Omar Beshary","id":"10206446555601987"},"message":"- محتاج مساعده من Android Developer \n- أنا بذاكر كورس Developing Android Apps من Udacity و في جزئية إن أربط API عشان يظهر داتا علي الأبلكشن بس لما أعمله RUN بيظهر ERROR مش فاهمه , فعايز أعرف إيه الغلط اللي موجود بالظبط \nده ForecastFragment Class اللي منه هظهر الداتا http://ideone.com/Fqexro\n - ده build.gradle عايز أعرف هل فيه خطأ في build.each ?\nhttp://ideone.com/CN0IaO\n- وده error اللي بيظهر , وبعد البحث إتضح إنه Network error بس مش عارف للأسف إيه الحل ؟ ؟ \nhttp://ideone.com/CN0IaO\nشكراا","caption":null,"description":null,"created_time":"2016-10-21T03:17:15+11:00","total_likes":5,"total_comments":8},{"id":"172338516139198_1263773843662321","from":{"name":"Ahmed Zain Mohammed","id":"10155252594718081"},"message":"مساء الخير،\n\nعارفين قاعدة don't reinvent the wheel في العالم بتاعنا، منطقية أوي و بالإعتماد عليها المنتج النهائي بيكون أفضل و الإنتاجية بتكون أعلي و أسرغ. \n\nطول عمري و انا منفضلها، من البداية و انا مقتنع إني لازم أكتب كل سطر بإيدي و بإسلوبي، ممكن أبدأ مشروع من الأول و جديد لأني و انا شغال فيه إتعلمت إسلوب أو design pattern جديدة و إتضح إنها \" اشيك \"! حتي لو أخدت snippet من علي موقع لازم أكتبها بإيدي، مفيش حاجة إسمها copy paste عندي. إشتغلت علي مشروع إسمه تمكين ( tamkeenlms.com ) 3 سنين لأني كنت كل ما أتعلم حاجة جديدة عايز المنتج بتاعي يكون أفضل ف كنت بكتبه من الصفر، ... و حرفيا من الصفر ( عملتها 3 مرات مع المشروع ده)!\n\nبعد 10 سنين من نفس الطريقة و بعد ما أخيراً إستخدمت Laravel إكتشفت إني ضيعت سنين من عمري و انا بحاول أعمل كل حاجة بإسلوبي. حبيت أقول لأي حد بيفكر زيي كده : بلاش، الأمر مش مستحيل. \n\nمن 3 سنين و انا كل شوية أبدأ مع Laravel ( و سعات مع CI أو Zend و أخيراً Phalcon ) و لكن دايماً كان ب يقف معايا تفاصيل عمل ال tool نفسها ، مش صعوبة إستخدامها أو تعلمها. ممكن أفصل من آداة زي Laravel أو أي باكيج تانية عشان ال naming conventions بتاعة الكلاسز بتاعتها، أو إستخدامها لتوزيع ال folders أو أي حاجة تاني. انا مش مجنون، في ناس كتيرة زي كده و أكيد في مني كتير هنا. \n\nالخلاصة إني ضيعت فرص كتير و وقت كتير و انا مع كل مشروع جديد بكتب ال framework الخاص بيه، مرة Rhino و مرة Unique و مرة مش عارف إيه, أكيد فيهم أفكار حلوة ، لكن قوة ال open-source أقنعتني إن الي كنت بعمله ده غلط. و إن الأفضل إني أساهم في مشروع موجود بالفعل.\n\nانا دلوقتي عايز أقول لكل واحد بيفكر زي : عارف إنك عايز تعمل كل حاجة زي ما إنته شايفها صح، لكن ده هاياخد منك وقت و مجهود كبير هاتندم عليه بعدين، آختار أكتر آداة تحس إنها ماشية مع إسلوبك و إستخدمها و صدقني مع الوقت ( و زي أي حاجة تاني ) هاتتعود عليها و دماغك هاتتقبلها ، و وقتها هاتحس براحة مش هاتكون جربتها قبل كده.","caption":null,"description":null,"created_time":"2016-10-21T02:36:12+11:00","total_likes":25,"total_comments":6},{"id":"172338516139198_1264023780303994","from":{"name":"احمد رأفت","id":"738833149617517"},"message":"ايه channels لطيفة اقدر اتعلم منها اساسيات تطوير الـ android apps  ؟","caption":null,"description":null,"created_time":"2016-10-21T08:50:46+11:00","total_likes":2,"total_comments":2},{"id":"172338516139198_1263918526981186","from":{"name":"Muhammad El-Hennawy","id":"10210432517001560"},"message":null,"caption":null,"description":null,"created_time":"2016-10-21T06:18:26+11:00","total_likes":25,"total_comments":2},{"id":"172338516139198_1263627620343610","from":{"name":"Sameh Magdy","id":"1390728197650488"},"message":"Guys, I need some advice.\nI'm 19 and attending the Faculty of Arts, Spanish Department at Cairo University (2nd year) and I absolutely hate it. I generally like languages, arts, and being exposed to different cultures and so on but here it's like everybody's job is to drive you insane and I don't think I'll be able to take it anymore.\nI've been a geek for as long as I can remember, and about 2 years ago I started taking it seriously by learning web development/design on Codecademy, Udemy, and the Coder Manual Bootcamp (never finished that one because I didn't quite like Ruby). So to cut to the chase, I know I can't just drop out and rely on self-learning without any kind of college certificate because unfortunately we're in Egypt, so I'm wondering if there's some kind of school I can transfer to that has anything to do with programming, not crazy expensive, and gives an equivalent of a college certificate.","caption":null,"description":null,"created_time":"2016-10-20T22:41:21+11:00","total_likes":2,"total_comments":6},{"id":"172338516139198_1263494067023632","from":{"name":"Osama Soliman","id":"709206249239999"},"message":"I want to scale my app to include more cites dynamically any api could help ?\n\"Sit-Down where\" tells u where to sit at bus to avoid direct sun and heat at summer\nThe Idea of the app that :\n1. It knows where the sun \n2. where you \n3. and what the time :) !\nso it tells u to sit at the right of the bus or the left to feel better and avoid sun ^_^ !","caption":null,"description":null,"created_time":"2016-10-20T19:21:51+11:00","total_likes":25,"total_comments":17}]}