{"posts":[{"id":"172338516139198_735423389830705","from":{"name":"Dina Adel","id":"753236568165013"},"message":"Hi,\nwe have a new company ...decided using openerp and we look for sombody used openerp in any projects before .somebody has experience in dealing with openerp helps us with hire (hiring)...\nPlease if any openerp developer can join us in our company even online ... show us any project has done before via this e-mail:\n\nd.elziny@click-group.com.kw\n---------------------------------------\nor in my account on facebook :\n\nhttps://www.facebook.com/profile.php?id=100004360301052\n----------------------------------------\n- our click company in Kuwait .\nThank you","caption":null,"description":null,"created_time":"2014-04-23T18:11:50+10:00","total_likes":1,"total_comments":3},{"id":"172338516139198_735888233117554","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":"cicnews.com","description":"On Wednesday, April 23, 2014, the Government of Canada announced new occupations and caps for the popular Federal Skilled Worker (FSW) program. Additional important information has been announced for the Federal Skilled Trades (FST) and Canadian Experience Class (CEC) programs.","created_time":"2014-04-24T16:15:08+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_735491909823853","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"ده مقال لDHH بيشرح فيه وجهة نظره عن ليه الTDD based on unit testing كان مشكلة بالنسبة للديزاين بتاع السيستيمز عندهم و ليه هو بيفضل يعمل High level system testing بحاجة زى Capybara","caption":"david.heinemeierhansson.com","description":"Test-first fundamentalism is like abstinence-only sex ed: An unrealistic, ineffective morality campaign for self-loathing and shaming.It didn't start out like that. When I first discovered TDD, it was like a courteous invitation to a better world of writing software. A mind hack to get you going wit…","created_time":"2014-04-23T22:17:04+10:00","total_likes":5,"total_comments":4},{"id":"172338516139198_735966683109709","from":{"name":"Mahmoud Abd El-Fattah","id":"10155412942040288"},"message":null,"caption":"css-tricks.com","description":"Me, for the last year or so: \"rem's are so cool! I'm gonna size everything with them, that way I can adjust the font-size on the root element and everythin","created_time":"2014-04-24T21:05:06+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_736059236433787","from":{"name":"Waleed Youssry","id":"10154333239591198"},"message":"Guys, I'm looking for a powerful iOS developer (for a full-time job @ webkeyz). Anyone in mind?","caption":null,"description":null,"created_time":"2014-04-24T23:15:36+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_736084569764587","from":{"name":"Ahmed PiTech","id":"1202168943213892"},"message":"We Will start a free course \"Introduction to programming using JAVA \" on Rwaq platform\njoin us.\n","caption":"rwaq.org","description":"رواق - منصة عربية للتعليم المفتوح تهدف لنشر المعرفة -مقدمة للبرمجة بلغة جافا Java - المادة تقدم مدخل للبرمجيات عموما و تحتوي على مقارنات بسيطة بين الأنواع المختلفة للغات البرمجة. كما ان المادة تحتوي على شرح مبسط للمفاهيم الأساسية للبرمجة الشيئية OOP و كيفية تطبيق هذه المفاهيم بلغة الجافا. ثم يتم تقد…","created_time":"2014-04-25T00:01:09+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_736084029764641","from":{"name":"Fatma EL-Sayed","id":"10208468400656545"},"message":"Guys ,plz i'm searching for how to add Facebook custom tab tutorials,, any one can help ?? \nthnx in advance ..","caption":null,"description":null,"created_time":"2014-04-25T00:00:17+10:00","total_likes":0,"total_comments":10},{"id":"172338516139198_736183696421341","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"smashingmagazine.com","description":"In this post, we’ll look at why many common tutorial patterns are ineffective and how you can leverage game design principles to increase user engagement.","created_time":"2014-04-25T02:39:32+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_736202873086090","from":{"name":"Mosab Ibrahim","id":"10154868571206047"},"message":"A friend just emailed me this, and I was like waaaat! o.O\n\nReptyr helps you move a process to a screen AFTER you have started it!","caption":"maketecheasier.com","description":"The Reptyr tool, as the name suggests, is a command line utility that takes a running process form one terminal and migrates it to another.","created_time":"2014-04-25T03:24:36+10:00","total_likes":9,"total_comments":0},{"id":"172338516139198_736226203083757","from":{"name":"Ahmed Al-Amir","id":"10155179919799180"},"message":"In light of a previous discussion about \"trivial\" posts, and because this particular issue is a common occurrence, please allow me to introduce the XY Problem to those who are unaware of it.\n\nGenerally, it goes like this:\n- User wants to do X.\n- User doesn't know how to do X, but thinks it is achievable via Y.\n- User doesn't know how to do Y either.\n- User asks for help with Y.\n- Others try to help user with Y, but are confused because Y seems like a strange problem to want to solve.\n- After much interaction and wasted time, it finally becomes clear that the user really wants help with X, and that Y wasn't even a suitable solution for X.","caption":"mywiki.wooledge.org","description":"The X-Y Problem, as it is sometimes called, is a mental block which leads to enormous amounts of wasted time and energy, both on the part of people asking for help, and on the part of those providing help. It often goes something like this:","created_time":"2014-04-25T04:01:39+10:00","total_likes":4,"total_comments":0}]}