{"posts":[{"id":"172338516139198_1155283317844708","from":{"name":"Kha Dija","id":"403126083376030"},"message":"How to record video and upload it using php or laravel?","caption":null,"description":null,"created_time":"2016-06-04T01:01:50+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1153340668038973","from":{"name":"Taghreed Mohammed Kamel","id":"1522640774413656"},"message":"لو أنا رافعة أبليكشن على hostgator وكل ما أعمل login يطلعني ويخليني أعمل login تاني\n\nفي حين نفس الموقع لما برفعه على cpanel من نوع تاني بيشتغل يبقى المشكلة فين ف إعدادات ال hostgator ??","caption":null,"description":null,"created_time":"2016-05-31T19:10:47+10:00","total_likes":1,"total_comments":5},{"id":"172338516139198_1154624844577222","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":null,"caption":"blog.penjee.com","description":null,"created_time":"2016-06-02T23:14:23+10:00","total_likes":25,"total_comments":2},{"id":"172338516139198_1155499137823126","from":{"name":"Ahmed Whisper","id":"1309184995824743"},"message":"بعد أذن الادمن, كنت عاوز اخد راى الناس اللى شغاله للعمل كمبرمج فى سوق العمل المصرى ؟ما هى اللغات والمهارات المطلوبه حاليا ومستقبلا ( توجهات الشركات) , و شكرا لكل حد يقدر يفيدني او لاء :)","caption":null,"description":null,"created_time":"2016-06-04T08:26:14+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1155167064523000","from":{"name":"Mohamed Ahmed Ali","id":"1379392582081920"},"message":"مساء الخير.. ونخلي بالنا!","caption":null,"description":"الإدارة العامة لتكنولوجيا المعلومات: \n( الأجهزة الأمنية تتمكن من ضبط أحد الأشخاص بحوزته 13 ألف دولار وقيامه بالإتجار فى العملات النقدية الأجنبية وتحويلات نقدية بإستخدام عملة \" بيتكوين \" مقابل الدولار )\n \nأكدت معلومات وتحريات الإدارة العامة لتكنولوجيا المعلومات إنتشار عملة إلكترونية فى الأونة الأخيرة يتم التداول بها عبر شبكة الإنترنت تسمى \" البيتكوين \" وهى عبارة عن عملة مشفرة يتم إستبدالها بالعملات الرسمية كالدولار واليورو  ويتم التعامل بها عبر شبكة الإنترنت من خلال محفظة مالية يمتلكها المتعامل بهذه العملة ويكون له السيطرة الكاملة عليها عن طريق إسم مستخدم ورقم سرى خاص وبذلك يضمن عدم قدرة الأخرين على التعامل بها أو التحويل منها إلا عن طريق هذا الرقم وبالتالى هو الوحيد القادر على التعامل مع هذه المحفظة من خلال التحويل منها كما أنه هو من يسمح للآخرين بالتحويل إليها ويتم تحويل عملة \" بيتكوين \" من وإلى تلك المحافظ بالتنسيق بين مالكها والمتعاملين معه بإستخدام الهاتف حيث يقوم صاحب المحفظة بوضع رقم هاتفه الخاص على حساب خاص به على المواقع التى يتم من خلالها التعامل بعملة \" بيتكوين \" ويتم تسليم العملات الرسمية كالدولار واليورو عن طريق اليد وليس إلكترونيا  عبر تلك المحافظ عقب الإتفاق على الصفقة عن طريق الهاتف .\nومن خلال المتابعة والفحص تلاحظ وجود حساب باسم ( btc2okpay ) بموقع تداول العملات الإلكترونية \" لوكال بيت كوينز\" عبر شبكة المعلومات الدولية \"الإنترنت \" والذى يتيح للمترددين عليه التعامل بعملة (بيتكوين)  فضلا عن قيامة بالإعلان عن قدرته على تحويل العملات المختلفه من خلال أحد المواقع، وقد تبين قيام مستخدم ذلك الحساب بنشر رقم هاتف محمول للتواصل معه من قبل الراغبين فى بيع أو شراء تلك العملات الإلكترونية .. وقد أكدت التحريات والمعلومات أنهما خاصين بالمدعو/ أحمد . أ . ح– سن 30 - طبيب أسنان – مقيم بدائرة قسم شرطة ثان القاهرة الجديدة بالقاهرة .\nبإستكمال الفحص الفنى تبين قيام المذكور بالإتجار فى العملات النقدية الأجنبية والقيام بتحويلات نقدية بإستخدام عملة \" بيتكوين \" مقابل الدولار .\nعقب تقنين الإجراءات بالتنسيق مع قطاع مصلحة الأمن العام ومديرية أمن القاهرة تم الاتصال بالمتهم والإتفاق معه على شراء عدد من عملات البيتكوين مقابل مبلغ مالى وقده (13900دولار) امريكى بما يعادل (570) دولار للبيتكوين الواحد ، وهو سعر متغير يوميا .. ومن خلال أحد الأكمنة المعدة له بدائرة قسم شرطة القاهرة الجديدة تم ضبطه حال قيامه بشراء بعض عملات البيتكوين ، وبحوزته المضبوطات الآتية : \nمبلغ مالى قدره ( 13900 ) دولار .   \nصور لتحويلات وإيداعات بمبالغ مختلفة .\nجـــهاز كمبيوتر لوحى \" تاب ليت \"  .\nبمواجهته إعترف بإرتكابه الواقعة وممارسته ذلك النشاط مستخدماً جهاز الكمبيوتر اللوحى المضبوط بحوزته ، والمبلغ المالى المضبوط بحوزته لشراء عمله البيتكوين  .\nتم إتخاذ الإجراءات القانونية والعرض على النيابة العامة.","created_time":"2016-06-03T21:27:01+10:00","total_likes":7,"total_comments":8},{"id":"172338516139198_1154954884544218","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":null,"caption":null,"description":null,"created_time":"2016-06-03T11:52:36+10:00","total_likes":1,"total_comments":6},{"id":"172338516139198_1155526941153679","from":{"name":"Ahmed Van Mostafa","id":"10155038428386081"},"message":"Send me your CV if you are interested and think you fit:\nMicrosoft is looking for a Software Engineer who is passionate about designing and building advanced analytics solutions using big data technologies. \nAs a member of the Data Science Solutions team, you will work closely with data scientists and software engineers in several organizations at Microsoft as well as external partner organizations. You will also participate in architecting, designing, developing and deploying software components on Azure, in addition to developing solutions used by our partners.\nRequirements:\n· 4+ years’ experience with C/C++, C#, Java, or .NET frameworks\n· 4+ years’ experience with JavaScript, HTML 5, CSS, AJAX, ASP.NET, MVC or other common UI patterns\n· 4+ years of experience as a software developer working on industrial strength production software\n· Passion and empathy for customers. You should LOVE building solutions and experiences that make their lives easier and deliver measurable business value\n· A strong background in Data Structures, Algorithms, Analysis of algorithm complexity and efficient implementation of complex algorithms\n· Good understanding of analytical & statistical concepts\n· Strong knowledge of SQL is required\n· Hands on experience with one or more of the following: Hadoop/MapReduce, Hive, Hbase, HDFS or other distributed file systems\n· Understanding of cloud development principles and patterns such as loose coupling and clean separation of services\n· Knowledge of machine learning concepts and data mining is a plus\n· Experience with AWS or Azure is a plus\n· Experience with software development tools such as source control systems, automated build systems, compilers, software validation systems, test harnesses etc.\n· Excellent communication skills and ability to collaborate in a multi-disciplinary team consisting of Software Engineers, Data Scientists, UX designers and Program Managers.\n· BS or higher degree in Computer science, similar STEM field or equivalent industry experience","caption":null,"description":null,"created_time":"2016-06-04T09:37:05+10:00","total_likes":4,"total_comments":6},{"id":"172338516139198_1154669441239429","from":{"name":"Ashraf Kaabi","id":"10155206502385921"},"message":"وده اسمه ايه بقى ؟","caption":null,"description":null,"created_time":"2016-06-03T00:49:05+10:00","total_likes":13,"total_comments":10},{"id":"172338516139198_1153657351340638","from":{"name":"Mohamad Emad","id":"1118459391596579"},"message":null,"caption":"blog.penjee.com","description":null,"created_time":"2016-06-01T06:50:29+10:00","total_likes":25,"total_comments":4},{"id":"172338516139198_1156073001099073","from":{"name":"Abdelrahman Y. El-Fiky","id":"10154763290933941"},"message":"A searchable collection of the most frequently asked Git questions.","caption":"firstaidgit.io","description":"Quickly find the answers and commands to the most frequently asked git related issues.","created_time":"2016-06-05T06:33:47+10:00","total_likes":6,"total_comments":0}]}