{"posts":[{"id":"172338516139198_1017352418304466","from":{"name":"Bassam Abd Elhamid","id":"1811475205784288"},"message":"Hi guys,\n    As a side project I intend to download source codes from sites like github, bitbucket, codeplex, code.google, codeproject even code snippets from SOF, msdn and any well-known blog (Yes, I am intend to load a very big amount of codes) and then I will try to index them and try to learn something from them, and my question is\n   What a machine can learn from parsing billions of code blocks, I already have some ideas but I need more\n Thank you","caption":null,"description":null,"created_time":"2015-10-09T19:07:05+11:00","total_likes":2,"total_comments":3},{"id":"172338516139198_1017994704906904","from":{"name":"Adel K. Khalil","id":"10158375948495584"},"message":"What do you think?","caption":null,"description":null,"created_time":"2015-10-11T07:38:16+11:00","total_likes":9,"total_comments":1},{"id":"172338516139198_1016498335056541","from":{"name":"Shady M. Najib","id":"10154838763611066"},"message":null,"caption":null,"description":null,"created_time":"2015-10-08T07:43:19+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1017933718246336","from":{"name":"Ahmed Yousry Ebrahim","id":"10154919785242481"},"message":"Hello all\nif you are using hipchat or slack this might be interesting\n\nI have spent sometime to build and customize an instance of github's Hubot https://hubot.github.com/ . Hubot is a nodejs application that has various set of coffee scripts developed by the open source community that adds both fun and business oriented feature set to the Bot just by typing a keyword into hipchat (like a command).\n\nI named the instance Jarvis (if you watched iron man you will get it :) ) and I hosted it on heroku and integrated it with hipchat which we use in my company and works like a charm (you can change the adapter from hipchat to slack)\n\nJarvis can make reminders, add trello cards in the order list for the food ordering search at google or just learn all sort of stuff from normal question answers to HR policies and vacation days\n\nJust type @jarvis help and it will display a list of all the stuff he can do\n\nType (@jarvis learn x=y) and Jarvis will learn it as it have a postgres DB for data persistence. Ask him for what he learned just type (@jarvis tell x) and it will type y\n\nOr just type (@jarvis talk) for an open chat with the minimized Jarvis AI engine and when you are finished type (@jarvis stop talking) to return to the normal commands triggered Jarvis\n\nJarvis code is on this public repository on github https://github.com/ahmed-yousry-ebrahim/jarvis and hosted at heroku so you are more than welcome to explore its code base or even to contribute writing a coffee script to make some interesting new thing and share it with all of us","caption":"github.com","description":"Contribute to jarvis development by creating an account on GitHub.","created_time":"2015-10-11T04:22:19+11:00","total_likes":17,"total_comments":1},{"id":"172338516139198_1018298694876505","from":{"name":"Zeyad Kenawi","id":"1865899380356786"},"message":"you gonna teach your kids programming ? \nif yes, from your opinion what's the right age for kids to learn to code?","caption":null,"description":null,"created_time":"2015-10-12T02:53:27+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1018081014898273","from":{"name":"Ahmad A. Elghany","id":"1766716286975105"},"message":"صباح الخير يا جماعة، أنا عارف ان الكتابة هتقعدني في البيت إن شاء الله.\nيا ريت نركز في المقال ومنركزش في أسامي الشركات علشان هنختلف في اذا كان يجوز كتابة إسم الشركة في النقد ولا ﻷ.\nP.S وحشتوني والله.","caption":"manshar.com","description":"أخال نفسي محظوظًا للغاية، كنت في فترة انتقالية في حياتي؛ أنتقل من بلدتي للقاهرة سعيًا لملاحقة أحلامي مترامية الأطراف، كل طرف في حتّه شكل. فجأة وقبل أن أبدأ البحث عن عمل، قمت بالالتحاق بوظيفة مطور برمجيات -rails- عن طريق تويتر. نوع من أنواع الإصطياد الإليكتروني. رغم النهاية الدراماتيكية للوظيفة، وﻷن…","created_time":"2015-10-11T12:47:17+11:00","total_likes":25,"total_comments":25},{"id":"172338516139198_1018230608216647","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":null,"caption":null,"description":null,"created_time":"2015-10-11T23:32:11+11:00","total_likes":9,"total_comments":2},{"id":"172338516139198_1018226991550342","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":null,"caption":null,"description":null,"created_time":"2015-10-11T23:18:41+11:00","total_likes":8,"total_comments":1},{"id":"172338516139198_1018328911540150","from":{"name":"Alfy Amr","id":"1108898075905450"},"message":"لو سمحت ممكن حد يقولى على كورس للغة بايثون بس يكون يبدا من الاول لحد مستوى كويس اقدر من بعده اتعمق فى اللغة انا ناوى استمر وياريت يكون بالعربى .\nانا كنت باخد الكورس دا وعارف الاساسيات بس مكنتش اعرف حلو ولا لأ ولا اخره ايه :https://www.youtube.com/user/ehabnbd/videos :D","caption":null,"description":null,"created_time":"2015-10-12T04:23:04+11:00","total_likes":0,"total_comments":11},{"id":"172338516139198_1019287718110936","from":{"name":"Carima McDwyer B Sc","id":"10212035755026004"},"message":null,"caption":null,"description":"Happy Ada Lovelace Day -- an international celebration of women in science and technology! English mathematician Ada Lovelace is widely considered the world's first computer programmer for her invention of the computer algorithm. Born in 1815 to the poet Lord Byron and Anne Isabella Byron, Lovelace's mathematical talents led to an ongoing collaboration with mathematician Charles Babbage, who called Lovelace the \"Enchantress of Numbers.\" While translating an article by an Italian engineer on Babbage's Analytical Engine, a proposed early version of a mechanical general-purpose computer, Ada added her own set of notes which contained a tremendous breakthrough -- the first computer program or algorithm.\n\nAda Lovelace Day was started in Britain in 2009 as a day for creating new role models for girls and women in technical fields by raising the profile of today’s female STEM leaders. The event's founder, Suw Charman-Anderson, described the significance of this special day as follows: \"Ada Lovelace Day is not only about raising Ada’s profile, but also shining a spotlight on the achievements of all women in STEM, both historic and modern. It’s about drawing inspiration from all women, not just the famous ones, and supporting women at every stage of their career, from the choice of what to study at school and university through too often challenging professional milestones.\" \n\nIn honor of Ada Lovelace Day, please tell us about a historical or modern day woman in STEM who inspires you -- and, if it's someone you know personally, you can also tag her in the comments below. To learn more about Ada Lovelace Day, visit their website at http://findingada.com/\n\nIf you'd like to introduce your children to Ada Lovelace's incredible story, there's a brand new picture book biography, \"Ada Byron Lovelace and the Thinking Machine,\" for ages 5 to 9 at http://www.amightygirl.com/ada-lovelace-thinking-machine\n\nThis trailblazer is one of the 52 female scientists profiled in the recently released “Headstrong: 52 Women Who Changed Science – and The World,\" which is highly recommended for teens and adults alike at http://www.amightygirl.com/headstrong-52-women \n\n11-year-old Ada Lovelace is also the star of the fictionalized mystery novel for ages 8 to 12, “The Case of the Missing Moonstone,” at http://www.amightygirl.com/the-case-of-the-missing-moonstone\n\nFor adult readers who would like to learn more about Ada Lovelace and her contributions to computing, check out \"Ada's Algorithm: How Lord Byron's Daughter Ada Lovelace Launched the Digital Age\" at http://amzn.to/1R9d6Up\n\nIf you'd like to inspire your Mighty Girl's interest in science, you can introduce her to many stories of girls and women in science -- both in fiction and real-life -- with the titles featured in our \"Science & Technology\" book section at http://www.amightygirl.com/books/general-interest/science-technology \n\nAnd, for more fun ways to encourage your Mighty Girl's interest in technology and computer programming, check out our blog post, \"Inspiring Invention: 25 Engineering, Technology, & Math Toys for Mighty Girls\" at http://www.amightygirl.com/blog?p=7896\n\nThanks to the WomenRockScience Tumblr page for sharing this image!","created_time":"2015-10-14T11:13:55+11:00","total_likes":0,"total_comments":0}]}