{"posts":[{"id":"172338516139198_1206058309433875","from":{"name":"سامح دعبس","id":"1873036762957490"},"message":"A series of conversations between 3 geeks: Kent Beck, David Heinemeier Hansson, and Martin Fowler on the topic of Test-Driven Development (TDD) and its impact upon software design.\n\nMUST READ if you are interrested in TDD. The nice in these conversations is that it shows different perspectives of TDD; it has drawbacks, and it doesn't fit for all situations.\n\nEnjooy ;) \n","caption":"martinfowler.com","description":"A series of conversations between Kent Beck, David Heinemeier Hansson, and Martin Fowler. We discuss Test-Driven Development (TDD) and its impact upon software design.","created_time":"2016-08-17T05:03:47+10:00","total_likes":10,"total_comments":0},{"id":"172338516139198_1205847169454989","from":{"name":"Ahmed Said","id":"10154947686536550"},"message":"I have a domain on name.com. I've changed its nameservers on 13th August, 3 days ago. Unfortunately the old cached addresses are still used by DNS servers. It's very rare for a NS cached record to last for 3 days. Any clue? \n(Note that I use DNS lookup tools not only the local browsing)","caption":null,"description":null,"created_time":"2016-08-17T00:02:53+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1205019219537784","from":{"name":"Ahmed Mozaly","id":"10154444669171313"},"message":"من وقت للتاني بحب أخد جولة سياحية -عميقة شوية- في المشاريع مفتوحة المصدر اللي ليها أهمية وفي نفس الوقت مكتوبة بشكل نضيف\nمن فترة كنت خدت جولة ممتعة في Discourse\nجولتي السياحية حالياً في Hangfire \nهل حد يقدر يشارك مشاريع حلوة ومفيد ان الواحد يعرفها عموما ويعرف هي مبنية ازاي؟","caption":"github.com","description":"Hangfire - An easy way to perform background processing in your .NET and .NET Core applications","created_time":"2016-08-15T23:07:52+10:00","total_likes":10,"total_comments":4},{"id":"172338516139198_1206058442767195","from":{"name":"سامح دعبس","id":"1873036762957490"},"message":"A series of conversations between 3 geeks: Kent Beck, David Heinemeier Hansson, and Martin Fowler on the topic of Test-Driven Development (TDD) and its impact upon software design.\n\nMUST READ if you are interrested in TDD. The nice in these conversations is that it shows different perspectives of TDD; it has drawbacks, and it doesn't fit for all situations.\n\nEnjooy ;) \n","caption":"martinfowler.com","description":"A series of conversations between Kent Beck, David Heinemeier Hansson, and Martin Fowler. We discuss Test-Driven Development (TDD) and its impact upon software design.","created_time":"2016-08-17T05:03:58+10:00","total_likes":6,"total_comments":3},{"id":"172338516139198_1205446602828379","from":{"name":"Mohab Mohamed","id":"10208065696791189"},"message":null,"caption":null,"description":null,"created_time":"2016-08-16T09:21:54+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1206151409424565","from":{"name":"Ramy Allam","id":"10211430371857131"},"message":"Dears,\nRsyncHero is one of my opensource projects for Linux servers backup based on ( Python + Django + SQLite)\nhttps://github.com/RamyAllam/RsyncHero\n\n[Core Features]\n1. Free and OpenSource project licensed under GPLv3.\n\n2. Threaded backup solution as it works on speeding and optimizing the backup process of Rsync by running parallel pool of workers for Rsync.\n\n3. Simple Web console to manage the whole backup process and manage your clients.\n\n4. Users and Authentication system.\n\n5. Template of files/folders names and extensions to exclude during the backup process such tmp and cache files to speed up the backup process and to save disk space and bandwidth.\n\n6. Email notifications system to send a health report of the backup process whether it's successful or there are any failed process.\n\n7. Logs for the backup process which stores the stdout and stderr and display the contents from the web console.\n\n8. List and Restore backup option from Web Console to review or restore. You still have the ability to manage your data from the backup server using SSH.\n\n9. Pre-defined list of common paths to backup for cPanel servers.\n\n10. View current running backup process for each server from the web console.\n\n11. Kill all running backup process for each server from the web console.\n\n12. Test SSH connectivity to the server.\n\n13. Light-weight SQLite database which stores all the backup configuration. So that you can backup your backup configurations and it will be simple for migratation across multiple servers.\n\n[Why?]\nI'm not sure if I'm reinventing the wheel, But i had a long journey with ( I/O, Kernel Crash, HIGH TTR ) issues with both free and enterprise backup solutions. So, I came along with my own code with the help of the great and powerful Rsync utility and there are still too much work to be done on the roadmap. \n\nI'm sharing it here and hope this might be useful for SysAdmins or Python developers who may be interested in such projects.\n\n[Request]\n- Professionals, There is always a better way to do!\nYour feedback and contributions are highly appreciated. It's licensed under GPLv3. So, feel free to fork and spread the world.\n\n- Frontend developers, I need your help in the webpages design. The current design is a slow suicide but this is what it looks like when a sysAdmin holds a painting brush :D\n\n- Users, Despite the fact that I'm using RsyncHero on a production system with +200 machines with different purposes. It's your environment and your choice to use it with no single line of warranty. YOU WILL encounter bugs and YOU WILL have recommendations So, GitHub issues is your friend.\n\nThanks!","caption":"github.com","description":"RsyncHero is a threaded backup solution, It works on speeding and optimizing the backup process of rsync by running parallel pool of workers for the backup process.","created_time":"2016-08-17T07:55:39+10:00","total_likes":13,"total_comments":0},{"id":"172338516139198_1206176636088709","from":{"name":"Ahmed M. Araby","id":"10154630737934263"},"message":null,"caption":null,"description":"Are you a teacher? Then join the new GitHub Education Community before next semester begins. Discuss current trends in technology education with your peers from around the world. Not a teacher but know one? Encourage them to visit, introduce themselves, and request a swag bag full of GitHub educational materials and goodies for their classrooms.","created_time":"2016-08-17T08:49:29+10:00","total_likes":3,"total_comments":1},{"id":"172338516139198_1206232406083132","from":{"name":"Mohamed Rashed","id":"10154887093460568"},"message":"ASP.NET MVC, Core 1, brought a number of changes. Some were additions, but others were removals.The structure is similar and will be mostly familiar to anyone who has worked with ASP.NET MVC, but a few stuff is very different. simple comparison, in a lightweight way.","caption":"weblogs.asp.net","description":"IntroductionThe new version of ASP.NET MVC, Core 1, brought a number of changes. Some were additions, but others were removals.The structure is similar and will be mostly familiar to anyone who has …","created_time":"2016-08-17T10:31:24+10:00","total_likes":6,"total_comments":0},{"id":"172338516139198_1204679759571730","from":{"name":"Ahmed Ebn El-Haj Ramzy","id":"1238084806298364"},"message":"كنت سمعت من دكتور عندنا ان ال Facebook عنده algorithms يقدر بيها يعرف انت متابع ايه بظبط و يجبلك حاجات تبع الحاجات دى \nيعنى مثلا لو انت بتتكلم عن الساعات هتلاقى طلعلك فى ال Suggestions حاجات عن الساعات .\nو لو مثلا بتأييد تيار سياسى معين هيظهرلك على ال wall الناس الى نفس التيار بتاعك و عدد اقل من التيار المعاكس يعنى عشان ميخنقكش .\nو ان مثلا لو انت و واحد فاتحين نت فى نفس المكان ف ممكن يطلعلك فى ال Suggestions اول مبتروح \nوهكذا\n\nالسؤال هل ده فعلا الكلام صحيح ولا مجرد استنتاجات منه ؟ و هل حد معاه Articles كويسه بتتكلم عن الكلام ده بشكل مفصل او مثلا جايبين امثله اكتر و كده ؟\n\nشكرا","caption":null,"description":null,"created_time":"2016-08-15T11:36:02+10:00","total_likes":10,"total_comments":13},{"id":"172338516139198_1206396509400055","from":{"name":"Anas Rabei","id":"621823724675667"},"message":null,"caption":"infoq.com","description":"On the second day of the SpringOne Platform conference in Las Vegas, project lead Juergen Hoeller gave an update to attendees on the Spring framework roadmap.","created_time":"2016-08-17T16:10:27+10:00","total_likes":0,"total_comments":0}]}