{"posts":[{"id":"172338516139198_653033698069675","from":{"id":"544815169","name":"Mohamed Meligy"},"message":".NET to native\n\n\"@maryjofoley: Microsoft shows a glimpse of its mysterious 'Project N' compiler technology http://t.co/DkcPoMYm6P","caption":"www.zdnet.com","description":"Microsoft execs quietly showed off new compiler technology under development at the company that aims to compile .Net code to native code directly.","created_time":"2013-11-14T00:06:52+0000","total_likes":4,"total_comments":6},{"id":"172338516139198_653036704736041","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"2 شباب فى أمريكا كانو عايزين يعملو ستارت أب Startup من أيام الجامعة ، فقررو إنهم يعملو خدمة بتسمحلك إنك تطلب دليفرى بالموبايل (Otlob) إلا إن الموبايلات ساعتها سنة 2005 كانت لسة مش بالذكاء دة ومكانش فى إنتشار واسع للإنترنت عالموبايل ، بعد ما اشتغلو عالفكرة لمدة سنة كاملة سمعو إن بول جراهام (مؤسس أول مسرع للشركات فى العالم Y Combinator واللى بعد كدة ناس كتير عملت زيه ومنهم فلات 6 فى مصر) هيدى محاضرة فى بوسطن عن بناء شركتك الخاصة ، اشترو تذكرتين قطر وراحو حضرو المحاضرة وبعدها راحو قالوله إحنا عايزين نحكيلك فكرتنا وإحنا ركبنالك قطر 6 ساعات مخصوص عشان نقابلك ، الراجل أعجب بحماسهم وفعلا إداهم معاد عشان يتقابلو ، شرحولو اللى هما بيعملوه وهو كان ساعتها لسة بيبدأ أول دورة ل Y Combinator فقال لهم ماتقدمو؟ إحنا بندور على شركات نستثمر فيها. قالوله ماشى فقدمو وعملو مجموعة إنترفيوهات.\n\nبعدها بشوية إتصل بيهم بول وقالهم للأسف إنتو مش هينفع تدخلو معانا وإنتو ماتقبلتوش.\n\nالخبر نزل عليهم كالصاعقة وأحبطو جدا لدرجة إنهم راحو البار وقعدو يسكرو للصبح مع صحابهم بتوع الجامعة ، وكان كل شوية واحد منهم عمال يتمنظر بالشغلانة اللى جاتلو وبالمرتب اللى بيقبضه لدرجة إن من كتر الإحباط واحد من الشابين كدب وقال لهم دة إحنا إتقبلنا فى أول مسرع للشركات التكنولوجية فى العالم Y Combinator فى محاولة فاشلة إنه مايبينش إنه أقل منهم.\n\nتانى يوم ركبو القطر وهما لسة مافاقوش من ليلة إمبارح ، الموبايل رن ، ردو ، طلع بول جراهام! قالهم بصو ، إنتو شباب كويسين ، بس فكرتكم مش هتنجح دلوقت ، عندكم إستعداد تسيبو الفكرة اللى إشتغلتو عليها سنة كاملة وتدورو على واحدة غيرها وتخشو Y Combinator ؟.. قالوله فى نفس اللحظة عالتليفون ماشى موافقين!\n\nالشابين دول هما أليكسس أوهانيان ، وستيف هوفمان اللى أسسو موقع Reddit وهما جوة Y Combinator ، الموقع دلوقتى عليه 80 مليون مستخدم نشط شهريا ، وبعد ما بدأو فيه ب18 شهر تم بيعه مقابل 30 مليون دولار!","created_time":"2013-11-14T00:16:06+0000","total_likes":10,"total_comments":3},{"id":"172338516139198_653105768062468","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"RT @DotNet: Never had any intention to make Mr. @haacked upset. ;) http://t.co/ZD2IGsLdBH","caption":"haacked.com","description":"Not long ago I wrote a blog post about how platform restrictions harm .NET . It looks like most of the interesting PCL packages are now licensed without platform restrictions.","created_time":"2013-11-14T03:26:35+0000","total_likes":1,"total_comments":0},{"id":"172338516139198_653125611393817","from":{"id":"100003633641895","name":"ツ ツ"},"message":"Is there a way to install Windows Mobile on PC ?","created_time":"2013-11-14T04:36:57+0000","total_likes":0,"total_comments":2},{"id":"172338516139198_653177944721917","from":{"id":"100002623936802","name":"Ahmed PiTech"},"message":"Visit Us to Get 10% discount about all training services during November","created_time":"2013-11-14T07:23:39+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_653243264715385","from":{"id":"538395486","name":"Dody Gunawinata"},"message":"My company is looking for web engineers. We have been working on interesting problems lately and need some extra manpower(e.g. how to keep track of a billion dollars month, how to efficiently organize and distribute 737 pilots' flight schedule, etc). We are mainly working with .NET stacks although nowadays our infrastructure stacks are pretty diverse.  Send me your resume (or even better, github profile) to dodyg@silverkeytech.com.","created_time":"2013-11-14T10:27:51+0000","total_likes":3,"total_comments":0},{"id":"172338516139198_653310054708706","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"https://github.com/LearnBoost/Socket.IO/wiki","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","created_time":"2013-11-14T14:00:37+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_653678844671827","from":{"id":"683805169","name":"Mohamed El Sayed"},"message":"دا فريق العمل المسئول عن برنامج جميل جداً من فئة البرامج المتخصصه في إدارة ميزانية البيت ومتابعة النفقات إسمه YNAB.\nالملاحظ فى الصفحه (واللى ممكن يكون غريب عند بعض الناس) إن أعمار أغلب المبرمجين فى الفريق شكلهم فوق ال 35 او يمكن كمان فوق ال 45 سنة, والبرنامج ناجح, والناس عاملين شغل ممتاز.\nطيب ليه انا بعمل شير لحاجه زى دى؟ علشان أحاول أصحح الصورة المغلوطه اللى بتصور انك لو عندك 30 ~ 35 سنة ولسه بتكتب كود, أو لسه مبقتش Senior, أو Team Leader لحد دلوقتى تبقي فاشل, إلى أخر النماذج اللى على نفس الشكل, يفهموا إن الموضوع مش كدا خالص.\nالموضوع كله متعلق بخبراتك المتراكمه وبمهاراتك وبحبك وفهمك للبرمجه.\n\nإشتغل وبطل التفكير الحكومي بتاع سنتين من التخرج يبقي لازم ابقي Senior, يعدى كمان 3 سنين أبقي Team Leader, بالشكل دا لما يبقي عندك 40 سنة المفروض تبقي رئيس حكومه.\nالدليل على كلامي فى الجزئية الأخيره إن الواحد صادف العديد من المبرمجين أصحاب المناصب إشي دا Senior ودا team lead ودا بقي يقولك انا technical lead  والأخير دا يخضك ويقولك انا Architect, وبالنقاش معاهم بتبان الصوره وهى إنهم من أصحاب الفكر الحكومي اللى وجدوا شركات ضعيفة المستوي ممكن يقنعوهم بأنهم مؤهلين للمناصب دي, وخبراتهم لا يمكن أبداً أن تؤهلهم لتلك المناصب لو كانوا فى شركات بتعرف إزاى تختبر الناس قبل ما توظفهم.\nالشيء الأخر اللى بيلعب دور كبير فى خلق النماذج دى هى المحسوبيه والوساطه فى الشغل. ودا شيء بيدمر أى شخص مجتهد لما يلاقي اللى جنبه علشان بيمسح جوخ (مصطلح مصري أصيل, دور عليه :) ) او بيطاطي للمدير, إترقي واتمريس عليه, والتاني ياعيني لسه فى مكانه لأنه مجتهد بس, من غير حتة المحلسه دي.\nالخلاصه: إشتغل وإجتهد لنفسك, وبإذن الله ربنا هيوفقك وسيبك من وهم المناصب اللى بالسنة وسنتين دى.\nعنوان الصفحه: http://www.youneedabudget.com/company/team","caption":"www.youneedabudget.com","description":"The YNAB Team hails from Australia to Austin, Texas — from Massachusetts to Maine — and a tiny hop from Arizona to Utah. Did we mention Switzerland?","created_time":"2013-11-15T08:08:55+0000","total_likes":7,"total_comments":1},{"id":"172338516139198_653801371326241","from":{"id":"794574128","name":"Ahmed Adel"},"message":"Can I ask you guys a question, How many developers here practiced scientific computing (developing for scientific purposes)... I mean professionally ??","created_time":"2013-11-15T15:30:37+0000","total_likes":1,"total_comments":8}]}