{"posts":[{"id":"172338516139198_1387892197917151","from":{"name":"Ahmed Hashem","id":"1786709881592928"},"message":null,"caption":"quora.com","description":"Answer: This...This exact assumption behind the question is what holds people in software industry back : The idea that Computer science is just programming is a myth. Calling a computer scientist/software engineer a programmer is like calling a medical scientist a microscope looker, or a calling...","created_time":"2017-02-14T19:47:00+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1387900431249661","from":{"name":"Shady Selim","id":"1272947866123820"},"message":"تتشرف مجموعة جوجل للبرمجة بأستقبالكم في حلوان يوم السبت 25 من فبراير\nOur Google Developer Group will be more that happy to have you joining our event in Helwan on the 25th of February.\n\nhttps://www.facebook.com/events/697466320413076/","caption":"TensorFlow Dev Summit 2017 Extended","description":"We're happy to announce that Google Developer Group Helwan is hosting the very first TensorFlow Dev Summit Extended Show. \n\nIn this meetup we will watch the recorded event, discuss it, have sessions, learn and code !! (up to 40 seats) ! Spots are limited, please feel the official registration form soon!\n\nhttps://goo.gl/forms/NC1oCU8Qjm0bRBn43\n\n -Like always here were be free snacks and drinks, during between the sessions This would be good opportunity to socialize, communicate, and get to know each other. \n\nAgenda:\n12:30pm - 1:00pm: Registration\n1:00pm - 1:30pm: Welcome\n1:30pm - 2:30pm: TensorFlow Dev Summit Keynote - Recorded\n2:30pm - 2:45pm: Coffee Break\n2:45pm - 3:00pm: TensorFlow & Machine Learning\n3:00pm - 4:45pm: Python Codelab\n4:45pm - 5:00pm: End & Networking\n\nLocation: https://www.google.com.eg/maps/place/29%C2%B051'06.5%22N+31%C2%B020'00.9%22E/@29.8521032,31.3328212,18z \n\nWe look forward to meeting you in person! #TensorFlow #MENATF﻿\n\nDon't forget to follow our G+ page for more events: https://plus.google.com/106965438900407084336\n\n Happy coding! - Google Developer Group Helwan Team﻿","created_time":"2017-02-14T20:02:34+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1379782352061469","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"انا عندي مشكلة غريبة جدا وتجارب مع موضوع التقديم في الشركات الكبيرة\nمبدائيا كده انا senior .net lead developer وتقريبا بشتغل full stack وعندي experience في الموبايل ابلكيشنز عملت اكتر من ابلكيشن بالفون جاب..\nبقدم علي شغل في شركات كتير في الخارج عن طريق linkedIn\nمعظم الشركات بترد عليا ان الـ سكيلز بتعتي مش بتماتش اللي مطلوب, برغم اني بقرأ الـ job description كويس جدا وبتأكد ان هي نفس السكيلز الي عندي واللي محطوطة في الـ CV \nبصراحة مش عارف ومش فاهم ايه المشكلة ؟؟ هل الـ CV بتاعي مكتوب بطريقة مش عجباهم ؟ مش متأكد من النقطة دي... طيب بجد الموضوع ده مضايقني جدا يعني انا لو بوصل لمرحلة الانترفيو وبعدين يقولولي انت مكنتش تمام اقول ماشي لكن مبدأياً الموضوع مبيوصلش للمرحلة دي اصلا !\nممكن حد يرد عليا يكون فاهم وده لينك الـ CV https://drive.google.com/file/d/0B4HSOs3L9trUMWVCZnFaZnptYWM/view?usp=sharing \nياريت حد يكون فاهم يتكرم يبص كده بصة سريعة ولو في حاجة مش مظبوطة يديني feedback \nممكن البوست ده يضايق بعض الناس بس اعتقد اني مش لاقي حل تاني الجأله غير اني استفيد من خبرتكم في الموضوع ده !","caption":"drive.google.com","description":null,"created_time":"2017-02-06T09:28:58+11:00","total_likes":24,"total_comments":25},{"id":"172338516139198_1388027234570314","from":{"name":"Mahmoud Tantawy","id":"10155099548114764"},"message":null,"caption":"aws.amazon.com","description":"If you ask 100 people for the definition of “artificial intelligence,” you’ll get at least 100 answers, if not more. At AWS, we define it as a service or system which can perform tasks that usually require human-level intelligence such as visual perception, speech recognition, decision making, or tr...","created_time":"2017-02-14T23:41:51+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1387882344584803","from":{"name":"Noha Ahmed","id":"10158496004445107"},"message":"Morning peeps .. Would you please help me report this profile? He's been spamming our company's facebook page (WBN) for a while now by checking in and sharing it, although I've banned him (I don't know how he's still able to do that!).\nhttp://www.facebook.com/pop.khaled.319\n\nIf there is ANY way I can prevent him from doing that, please #HELP!!!","caption":null,"description":null,"created_time":"2017-02-14T19:26:20+11:00","total_likes":0,"total_comments":7},{"id":"172338516139198_1388167307889640","from":{"name":"Muhammad Saleh","id":"10155634469686002"},"message":"Amazon released a Skype competitor called Amazon Chime\nI find it a bit pricey\n","caption":"chime.aws","description":"Looking for frustration-free online meetings? Try Amazon Chime for simple and secure online meetings.","created_time":"2017-02-15T02:41:17+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1387205691319135","from":{"name":"Mohamed Moshrif","id":"1235868066468537"},"message":"فيه حد هنا بيستعمل مايكروسوفت azure كتير؟! علشان من شوية حصلت معانا اغبي experience ممكن حد يقابلها في التاريخ!!\nببساطة احنا كنا على ال S1 plan وكان فيه requests كتير وحولنا ننقل على ال S2 plan.\nعلى حسب ما أنا كنت متعود في environment محترمه زي ال AWS, كنت فاكر إني مجرد هختار ال new plan و ادوس على select وخلاص على كده. يعني اقصي مشكلة ممكن تواجهني هتكون down time كام دقيقة وخلاص وخصوصا إن ال apps بتاعتنا مش معقده ولا حاجة!\nلكن إزاي؟!\nفجأة كل حاجة ضربت, وكل حاجة مش بتشتغل, وندور مهما ندور, مفيش حاجة!\nنحاول نعمل restart لل apps كلها, مفيش فايدة. مفيش instance أصلا موجودة ولا شغالة ومع ذلك ال application مكتوب إنها running و ال health بتاعها تمام!!\nإيه ال experience الزبالة ديه بجد؟!\n\nMicrosoft\nMicrosoft Azure","caption":null,"description":null,"created_time":"2017-02-14T00:19:53+11:00","total_likes":1,"total_comments":4},{"id":"172338516139198_1387094537996917","from":{"name":"Mohamad Emad","id":"1118459391596579"},"message":"كل ما احس ان انا غبي بقراء السؤال دا و احمد ربنا\n","caption":"serverfault.com","description":"A security auditor for our servers has demanded the following within two weeks: A list of current usernames and plain-text passwords for all user accounts on all servers A list of all password cha...","created_time":"2017-02-13T21:39:41+11:00","total_likes":25,"total_comments":4},{"id":"172338516139198_1388279874545050","from":{"name":"Ahmed M. Araby","id":"10154630737934263"},"message":null,"caption":null,"description":"Learn how to make your first open source contribution, launch a new project, and build a welcoming community https://opensource.guide","created_time":"2017-02-15T05:12:36+11:00","total_likes":18,"total_comments":0},{"id":"172338516139198_1388303307876040","from":{"name":"Ahmed Mahmoud Elma'zon","id":"1605678829449818"},"message":"التكنولوجيا بتشهد كل يوم إبتكارات جديدة ويعتبر وصلنا ابهي عصور البرمجه ..زي مامتعودين ان IEEE ZSB دايمآ بتنمي وتفيد المفكرين والمبدعين عشان كده عملت ايفنت (Mutex (CS Opening \nهيكون موجود في الايفنت 3 من أكبر الشركات الموجودة في مصر والي لآول مره هتتواجد في الزقازيق ..الشركات الي معانا هم IBM و Oracle وMicrosoft .\nالمجالات الي هتكون معانا في الايفنت :\n- Artificial Intelligence (AI).\n- Big Data.\n- Cloud Computing.\n- Internet Of Things (IOT).\n- Security\nهنعرف كل مجال فيهم تطبيقاته و ازاي نقدر نستفيد من كل مجال فيهم وننمي افكارنا ب مشاريع تقدر تفيدنا .. \nومش بس كده لأ كمان هيكون في ووركشوبس على المواضيع دي عشان تستفيد بأكبر قدر ممكن من الإيفنت\nوالمفاجئة الأكبر إن الإيفنت مجاني بالكامل هو والووركشوبس\nشوفوا الإيفنت من هنا عشان تعرفوا باقي التفاصيل : https://goo.gl/UZzx4h\nولو لسه ماسجلتوش في الفورم سجلوا من هنا : http://ieee-zsb.org/events/mutex\n\n#Mutex \n#CS_Openning\n#IEEE_ZSB","caption":null,"description":null,"created_time":"2017-02-15T05:55:07+11:00","total_likes":6,"total_comments":0}]}