{"posts":[{"id":"172338516139198_1259568144082891","from":{"name":"Kareem Badawy","id":"1206517932798772"},"message":null,"caption":null,"description":"مجرد طالب جامعي ؟ \nكتير من الطلبه بيدخلوا الكليات و يتخرجوا و ميعرفوش ان عندهم مفتاح سحري بيقدملهم مميزات كتيره و خدمات مجانا قد تصل قيمتها لالاف الدولارات و بس علشان انت طالب جامعي !\n\nشركات كتير بتقدم منتاجتها بالكامل مجانا و خصومات كبيرة عشان أنت طالب جامعي. \n\nطيب انت المفروض تعمل ايه علشان تاخد خصومات و حجات ببلاش ؟ \n\nكل الي عليك تعمله انك تعمل الايميل الجامعي بتاعك علشان تتمتع بالمميزات ديه.\n \nطب عايز تعرف اكتر عن ايه هي الحجات الي تباخدها من الايميل الجامعي؟\n\n1- الـoffice 365. شركه ميكروسوفت بتوفرهولك  مجانا و دا عباره عن الاوفيس كامل بالاضافه لمميزات الكلاود انك ممكن تقدر تفتح ملفاتك الي شغال عليها من اي مكان و أي جهاز.\n\n2- ممكن تعمل اكونت Microsoft Imagine.و دا الي بيتيحلك انك تحمل كل منتجات ميكروسوفت مجانا بما فيهم الويندوز.\n \n3- منتجات Autodesk.ممكن تحمل منتجات اوتوديسك زي 3d max و مايا و اوتو كاد ببلاش.\n\n4- ممكن تحصل علي منتجات تساعدك علي تطوير التطبيقات زي ال IDEs الي بتقدمها شركه jetbrains .\n\nطيب أنت متحمس دلوقتي إنك تعمل الميل الجامعي بتاعك. ممكن تعمله ازاي ؟ \nتقدر تسجل من هنا علشان الايميل يتعملك : https://aka.ms/getoffice365alex\n\nطب هو مين له الحق إنه يعمل الايميل الجامعي ؟\nلازم تكون طالب او دكتور جامعي او طالب ماجستير او معيد علشان تقدر تعمل الايميل الجامعي.\n\nمتخليش المعلومه تقف عندك و عرف زمايلك في الجامعه عن الايميل الجامعي!\n\nA college student you are and like a college student you shall be treated. Lots of students graduate college missing a magic key that unlocks lots of privileges that are worth of thousands of dollars. You can get this key because you are a college student!\n\nLots of companies offer free products and major discounts, just because you are college student.\n\nSo, here lies the question: what should you do to aquire the free products and the discounts?\n\nAll you have to do is to get an educational email. Simple as that!\n\nAnother question: what are some products that I can get using the educational email?\n\n1- Office 365. Microsoft gives you access for free to all office software plus some cloud services that you can use to access your files from any device.\n\n2- Microsoft Imagine account, an account that gives you the access to download many Microsoft products for free.\n\n3- Autodesk products. You can download for free any Autodesk product like 3D max, Maya and AutoCad.\n\n4- jetbrains IDEs.\n\nNow, you are excited to create your own educational email. How can you do that?\nPlease, fill the form in this link: https://aka.ms/getoffice365alex\n\nWho can create an educational email?\nYou should be a college student, college professor, masters student or a college teaching assistant.\n\nDon't forget to share this post so that your friends can know too about the educational email!\n\n#MSPTC #MSP #MSP_Alex #Microsoft #Office365","created_time":"2016-10-16T22:02:32+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1259627634076942","from":{"name":"محمد عرفة","id":"10154943779149651"},"message":"anybody here interested in openstack?\n","caption":"linkedin.com","description":null,"created_time":"2016-10-16T23:30:24+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1258236050882767","from":{"name":"Ahmad Abubakr","id":"10211135002706823"},"message":"Any suggestions for workarounds to bypass these limits in order to pay for hosting at least ?!","caption":null,"description":null,"created_time":"2016-10-15T10:30:10+11:00","total_likes":4,"total_comments":13},{"id":"172338516139198_1259679104071795","from":{"name":"Muhammad Saleh","id":"10155634469686002"},"message":"Just like jsfiddle and codepen but with boilerplates for React and Angular apps\nBecomes handy if you need to focus on learning these frameworks without having to deal with all of the configurations and setup\n[It also allows you to download the project]","caption":"webpackbin.com","description":null,"created_time":"2016-10-17T00:27:21+11:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1259165957456443","from":{"name":"Marwan Abdel Moneim","id":"271984173243601"},"message":"i just want to say this\n\nthe situation in Egypt became very boring\nwhy we are \"small\" people?\nmost companies do BS work, you rarely find a company that do serious computer science related stuff, or just do what they do right\n\nwhat should new programmers do?, work for this companies and then just move to similar one that just bigger?\n\ni have been in companies that have so called \"seniors\" that know nothing about computer science\n\ni have a lot to say on this, but i know that no benefits from writing it, i would just be happy if i don't feel this alone","caption":null,"description":null,"created_time":"2016-10-16T09:54:44+11:00","total_likes":19,"total_comments":9},{"id":"172338516139198_1259731787399860","from":{"name":"Muhammad Saleh","id":"10155634469686002"},"message":"I have a simple question (maybe with some bad intentions ?)\nIt's about Yarn (the new Facebook package manager)\nWhy didn't Facebook simply contributed to NPM ? Isn't it the whole idea of OSS ?\nWhich lead to another question: When should OSS contributors/devs decide to contribute to an existing projects or to start their own ?","caption":null,"description":null,"created_time":"2016-10-17T01:34:13+11:00","total_likes":1,"total_comments":3},{"id":"172338516139198_1259857430720629","from":{"name":"Muhammad El-Hennawy","id":"10210432517001560"},"message":null,"caption":null,"description":"Don’t lose sight of reality while being charmed by our culture’s Silicon Valley romance.","created_time":"2016-10-17T03:39:51+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1260363024003403","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"medium.com","description":"Few things are guaranteed to increase all the time: Distance between stars, Entropy in the visible universe, and Fucking business…","created_time":"2016-10-17T17:10:36+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1259589337414105","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"an alternative to github's travis\n\n","caption":"bitbucket.org","description":"Bitbucket Pipelines brings continuous delivery to Bitbucket Cloud, empowering teams with full branching to deployment visibility and faster feedback loops","created_time":"2016-10-16T22:28:34+11:00","total_likes":9,"total_comments":3},{"id":"172338516139198_1258573674182338","from":{"name":"Ali Zawahry","id":"770108719813462"},"message":"What's all time favourite retro/oldish game ?\nDoom Here","caption":null,"description":null,"created_time":"2016-10-15T20:30:47+11:00","total_likes":1,"total_comments":14}]}