{"posts":[{"id":"172338516139198_864301306942912","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":null,"caption":null,"description":null,"created_time":"2014-12-21T05:31:29+11:00","total_likes":7,"total_comments":3},{"id":"172338516139198_864703370236039","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":"medium.com","description":"On an architectural level, the way we craft large-scale applications in JavaScript has changed in at least one fundament…","created_time":"2014-12-21T19:36:01+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_864730433566666","from":{"name":"Hassan Ibrahim","id":"10210217197578897"},"message":null,"caption":"toptal.com","description":"Are you joining the growing group of developers who want to know more about Deep Learning? This introductory tutorial covers it all.","created_time":"2014-12-21T21:05:57+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_864410896931953","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"Another funny story I have heard about developing a POC and innovation\n\nSS: We need to develop a POC for a new product idea.\nTA: So what is the idea?\n\nSS: We want to build an engine that analyzes what people say on social media\nTA: Analyze what exactly?\n\nSS: Analyzie if they are saying good things or bad things about a specific topic\n\nTA: But that requires research and knowledge of lingusitics as far as I know\n\nSS: No, it's been done.\nTA: by who?\n\nSS: by 5 big multinational companies\nTA: and we are supposed to compete with them?\n\nSS: Yes, we  need to do our own implementation.\nTA: And how much time do we have to do this?\n\nSS: One month.\n\nTA: But what languages are we targetting?\n\nSS: English and Arabic, we can add more languages later.\n\nTA: In one month, you want an algorithm and an interface that shows graphs of the analyzed data?\n\nSS: Yes.\n\nTA: But what about the Algorithm? We need to do research, we could need computing and storage and bandwidth.\n\nSS: This guy in IT says there are 2 guys who implemented this on the internet.\nTA: What 2 guys?\n\nSS: 2 guys in MIT for their masters thesis.\nTA: So 2 guys in MIT spent maybe 2 years working on something like this, and you want me to understand and implement and compete with other coompanies in a month?\n\nSS: It's not that complicated, I am sure there is code on the internet that does it.\nTA:And I suppose the MIT guys only handled English, so in 1 month I am supposed to do Arabic as well?\n\nSS: That is our deadline.\n\nTA researches for a day.\n\nTA: I did some research, obviously this is extremely complicated and even the most basic algorithm to do this would have like 10% accuracy.\n\nSS: No we need to say that it is 70%.\nTA: Excuse me, how on earth are we gonna do that?\n\nSS: We can do a POC and keep improving, nothing is impossible.\n\nTA: Impossible and unfeasable in timeframe are pretty close.\nSS: No, we must burn the midnight oil and do whatever it takes.\n\nTA: But what your asking makes no sense whatsoever. Couldn't we just integrate with an engine that does that? and sell the customer a solution that actually works instead of doing something we know will be very low quality and will never meet his expectations.\n\nSS: No the solutions are expensive, it will be cheaper to develop ourselves.\nTA: But in 1 month we will have a very low quality solution with very low accuracy if we have anything at all.\n\nSS: No, if we focus and work hard we can have something.\n\nTA: But only  5 companies do this all over the world with any reasonable accuracy and 2 guys at MIT did a Masters thesis in 2 years. If working hard for 1 month could have achieved that, wouldn't that make the multinational companies and guys at MIT stupid?\n\nSS: We have a customer request and a deadline.\n\nTA: If the customer asked for a ladder to climb to the moon, would that make it possible?\n\nSS: We have a dream and we need to pursue it.\n\nTA: You have a dream to make a sale, I want to actually have a realistic goal, otherwise this sounds like a disaster.\n\nSS: You need to be innovative and brave. \n\nTA: And smart? And realistic? \n\nSS: bla bla bla","caption":null,"description":null,"created_time":"2014-12-21T09:02:47+11:00","total_likes":8,"total_comments":10},{"id":"172338516139198_864423616930681","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"The design review from hell:\n\nThe TA does a design review on a small application that does surveys and saves them to the database.\n\nTA: I was looking at your database design, You have a list of questions for each survey. The wierd thing is that you have each question as a column in your table and each survey as a separate table.\n\nTL: That is correct.\n\nTA: But that means to add another question to a survey, you need to add another column to the table and to add another Survey you need to add another table.\n\nTL: That is correct.\n\nTA: But shouldn't we be doing basic database normalization and actually be able to add a question as a row? Shouldn't surveys have their own table with each survey having it's own row? Wouldn't that make adding an extra question or survey very easy and simple.\n\nTL: The customer only asked for 5 surveys.\n\nTA: And what happens when he wants to add a question to a survey or a new survey?\n\nTL: He will create a change request and we will do it for him.\n\nTA: Yeah, but if you had tables and rows like I said you would just have to add some rows in each table.\n\nTL: The time it wil take me to add a row, is the time it will take me to add a new table with columnns as questions.\n\nTA: But you can just build a page so the customer can create his own surveys and add questions to them.\n\nTL: That is not in our scope or in the requirements, we will be the ones adding the questions.\n\nTA: Are you kidding me? Why am I wasting my time like this? I'm not here to explain basic database design. Why do you even ask for a design review?\n\nTL: Because the process says so. If you want to complain, talk to the PM.\n\nTA: PM, this is basics of computer science here, what are we arguing about?\n\nPM: I don't have time for design, and I don't have time to do the right thing","caption":null,"description":null,"created_time":"2014-12-21T09:36:37+11:00","total_likes":8,"total_comments":6},{"id":"172338516139198_864863263553383","from":{"name":"Ahmed Ezz","id":"10154919378101955"},"message":"Cloud Computing Presentation,\nBy my friend Ahmed Said he is a senior SharePoint consultant if any one wants to ask him anything","caption":"youtube.com","description":"Do you know what is cloud computing? Are you business user or technical consultant? Watch this animation video to watch the answer! عايز تعرف يعني ايه الحوسب...","created_time":"2014-12-22T00:51:12+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_864715340234842","from":{"name":"علي جاد الرب","id":"10158370908270710"},"message":"I need help\n\nHow to shield a house from a nearby mobile cell towers  ?","caption":null,"description":null,"created_time":"2014-12-21T20:14:11+11:00","total_likes":0,"total_comments":21},{"id":"172338516139198_865002166872826","from":{"name":"Ben Othman","id":"1386880034707570"},"message":"A list of things to read or watch that address these two questions: What is scalable CSS? and How do we create scalable CSS?","caption":"github.com","description":"scalable-css-reading-list - Collected dispatches from The Quest for Scalable CSS","created_time":"2014-12-22T07:30:16+11:00","total_likes":2,"total_comments":3},{"id":"172338516139198_864984193541290","from":{"name":"هاجر عبدالغفار","id":"10155181443463658"},"message":"للموبايل ديفلوبر والux ديزاينر \nسمعت عن برنامج او بلجين تقدر تحول بيه السكرينز لكود ؟؟\nدلوقتى كودلى @Codlyيقدر يحولك اى شاشات من جوه الفوتوشوب لبرنامج كامل الديزاين\nالخطوات بسيطة جدا وتستحق بجد التجربة \n1- الديزاينر هيرسم الشاشة فوتوشوب علشان يطلع السكرينز \n2-تعمل generate للكود باستخدام Codly plugin \n3-هتعمل داونلود للبروجكت كامل فيه android classes+layout+mainfist \nيعنى هيجيلك برنامج كامل بكل الtransactions بين الscreens \nومتنساش بقى تحضر بكرة الايفنت علشان تجرب وتسال فى اى مشكلة ممكن تكون واجهتك \nومتنساش تمنشن الناس المهتمة :)","caption":null,"description":"يوم الاتنين اونلاين على ال hangout \nهنتكلم عن ازاي تستخدم كودلي في انك تعمل  موبايل prototype من جوا الفوتوشوب \n\nلينك الافنت : \nhttp://bit.ly/ArCodlyHangout\n\nمستنينكم :)","created_time":"2014-12-22T06:37:30+11:00","total_likes":3,"total_comments":1},{"id":"172338516139198_865030803536629","from":{"name":"Mohammad Mahmoud","id":"10158492633135533"},"message":null,"caption":null,"description":null,"created_time":"2014-12-22T09:01:28+11:00","total_likes":0,"total_comments":4}]}