{"posts":[{"id":"172338516139198_1310046385701733","from":{"name":"Walid Ashraf","id":"10158243586520176"},"message":null,"caption":null,"description":"For all people interested in cloud and business innovative solutions. I have found this website that contains a comparison between different solutions to the same task. \nComparison items includes supported platforms, pricing, user ratting and much more.\nI checkout out different comparisons including Finance,Agile Management, CRM, HR and Much more and its amazing.\n\n#Compare_before_you_buy\n#Innovative_Marketing\n#Info_that_worth_time_and_money\n#Checkout_your_competitors","created_time":"2016-12-03T03:26:03+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1309355875770784","from":{"name":"Kirolos Louis Saad","id":"10209996073712380"},"message":"الناس العظيمة البتعمل GUI من غير drag & drop\nدلوقتي الoverride method دي بتخلي الwindow يتحرك معايا من غير ما يكون الcursor علي الtitle bar\nكل الفهمته بعد ما دورت ان الobject m بيتبعت فيها الevents البتحصل للwindow\nو Msg بيبقي فيها الID بتاع الmessage البعتتها الoperating system\nمش فاهم WM_NCHITTEST و HT_CAPTION و Result دول ايه هما او فيهم ايه\nشكراً","caption":null,"description":null,"created_time":"2016-12-02T06:34:44+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1310239415682430","from":{"name":"Ehab Alsharkawy","id":"1216722635112241"},"message":"#Amazon latest innovation is... a truck.","caption":"youtube.com","description":"AWS Snowmobile is an exabyte-scale data transfer service used to move extremely large amounts of data to AWS. You can transfer up to 100PB per Snowmobile, a ...","created_time":"2016-12-03T08:57:07+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1310278089011896","from":{"name":"Maged Eladawy","id":"1220459164735315"},"message":"من فترة قررت احاول ابعد عن الماركت فى مصر كا فري لانسر و احاول ادور على بوزيشن Remotely تخليني Financial Independent عن الهبل اللى بيحصل فى مصر ده...\n.\nهعملكوا شير للأكسبيرينس بتاعتي مع Toptal لأي حد حابب ياخد نفس التجربة و لأني كمان ملاقيتش Resources كتير هنا بتتكلم عن الموضوع ده...هحاول الخص الكلام فى أسالة و أجوبه...\n.\nأيه هوا Toptal \n \nتوبتال هوا Freelancing Plateform  بس الفرق بينه و بين Odesk و Freelancing أو اي Plateform تاني إن Toptal بيعمل  Tough Filteration لأي ديفيلوبر بيقدم عليه...كأنك داخل Job Interview بالظبط...بتمبر بأكتر من مرحلة و لو فلحت و نجحت بتوصل فى الآخر إن بيبقى عندك بروفايل فى توبتال...يعنى انت مش هيبقى عندك بروفايل فى توبتال إلا لو انت كويس جداً فى حاجه معينه...و ده معناه إن مفيش هنود هيعملو Bidding ب ٢ أو ٣ دولار فى الساعة مثلا....كل اللى موجودين بروفيشنال...كل اللى موجودين الريت بتاعهم عالي...الكلاين أو الشركات الكبيرة بتروح ل Plateform زي Toptal لأنه More Reliable عن أى plateform تاني \n.\nأيه هي مراحل الأنترفيو فى Toptal ؟ \n\n١- بتملي البروفايل بتاعك فى موقع toptal.com \n\n٢- بعديها بفترة طويلة (أنا كنت ناسي أصلا اني قدمت علي توبتال) حد بيكونتاكت معاك و بيحدد معاك معاد علشان تعمل سكايب كول...اللى بيعمل معاك سكايب كول بيتأكد ان الـ Communication skills بتاعتك كويسه و معندكش مشكله فى ال Language..الخ و كمان بيفهم انت كويس فى أيه بالظبط علشان المراحل اللى جايه كلها هتبقى ليها علاقة باللى انت كويس فيه...يعنى مثلا انت \nFront-end Developer, Back-end Developer, Full-stack...etc\n\n٣- لو عديت المرحلة اللى فاتت بتلاقى Senior Software Engineer فى التخصص بتاعك بيعمل Contact معاك على الأميل و بيطلب يحدد معاك انترفيو...دي تعتبر أهم مرحلة...فى المرحلة دي بتاخد Live Exercises مش سهل خالص...و بيديك أكسس على Online Editor و كمان بيطلب منك انك تعمل Share screen  و بيديك وقت معين (ربع ساعة) تحل المشكلة دي...لو حليتها بيديك مشكله كمان و ربع ساعة كمان...المشكلة دي بتبقى Advanced بالنسبه للمجال بتاعك...و طبعا مينفشع تستعمل جوجل غير فى حالات محدودة...\n\n٤- لو نجحت فى المرحلة اللى فاتت بتاخد two weeks task فى المجال بتاعك...بيبقى ابليكيشن محطوط كويس قوي و بيقدر يقيس عن طريقة الـشخص ده عارف ال APIs كويس و بي Follow the Standard ولا لأ...بيديك اكسس على Online git repository و بيطلب منك تعمل push طول ما انت شغال\n\n٥- بعد اسبوعين بتعمل ميتينج مع الـ Senior Engineer و بيشوف الأبلكيشن على جهازك و بيتأكد ان مفهوش أى مشاكل و بيحقق كل ال Critiria المطلوبه...لو نجحت في المرحلة دي...بيبقى عندك بروفايل فى Toptal \n\nhttps://www.toptal.com/top-3-percent\n\n.\n.\nفى رأيي ان البروسس كلها منظمة جداً و مدروسه كويس...حتي لما بتيجي تعمل البروفايل لازم يتراجل قبل ما بتنشر على الموقع علشان ال Quality of content...\nلو حد عنده أي اساله ممكن يقرا الفايل اللى عامل له attachement لو ملقاش إجابه لسؤاله يتفضل يسألني","caption":null,"description":null,"created_time":"2016-12-03T10:15:01+11:00","total_likes":25,"total_comments":25},{"id":"172338516139198_1309979902375048","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"Debugging.","caption":"media.giphy.com","description":null,"created_time":"2016-12-03T01:33:57+11:00","total_likes":25,"total_comments":4},{"id":"172338516139198_1310365925669779","from":{"name":"Muhammad SA El-Zahaby","id":"10158316024235486"},"message":"http://www.aljazeera.com/indepth/inpictures/2016/11/iran-silicon-valley-161130094759722.html","caption":"aljazeera.com","description":"Young Iranians are creating startups with unprecedented success.","created_time":"2016-12-03T12:51:04+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1310515048988200","from":{"name":"Andrew Raafat","id":"10155013194864286"},"message":"that entrance thou","caption":"mashable.com","description":"Seriously.","created_time":"2016-12-03T17:02:51+11:00","total_likes":6,"total_comments":0},{"id":"172338516139198_1310461325660239","from":{"name":"Ahmad Nazmy","id":"10154268924640143"},"message":"I started this open source project a while ago,I'm working on it in my free time so I think it needs more contributions, if you're interested and think you can help, please let me know","caption":"github.com","description":"Aker - SSH bastion/jump host","created_time":"2016-12-03T15:36:35+11:00","total_likes":4,"total_comments":2},{"id":"172338516139198_1309948035711568","from":{"name":"Osama Soliman","id":"709206249239999"},"message":"Productivity part 2 in which we will talk about devices and hardware ... Please share with us some or more of your hardware productivity acceleration secrets","caption":null,"description":null,"created_time":"2016-12-03T00:44:14+11:00","total_likes":2,"total_comments":13},{"id":"172338516139198_1310683372304701","from":{"name":"Muhammed Hatem Abdu","id":"904943756275214"},"message":"Could any one guide me how can i perform SQL \"LIKE\" operation on Firebase?. \n\nI googled and all results are talking about integrating search engine with Firebase (i.e ElasticSearch).\n\nI wonder Is there a solution provided by google to do such this search operations on Firebase ?","caption":null,"description":null,"created_time":"2016-12-03T22:13:42+11:00","total_likes":0,"total_comments":2}]}