{"posts":[{"id":"172338516139198_1333522346687470","from":{"name":"Ahmed Shawky El-faky","id":"10210082325758741"},"message":"منحة وزارة الاتصالات الكورسات الاونلاين Next Technology leader\nممكن اخلصها قبل الوقت المحدد لو قدر ولا القواعد ايه \nممكن اللى يعرف تفاصييل اكتر يقول ؟؟؟\nشكرا ^_^","caption":null,"description":null,"created_time":"2016-12-21T23:21:31+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1332440816795623","from":{"name":"Mohamed Salah","id":"707865049374879"},"message":"سلام عليكم \nمحدش يا جماعة يعرف لو سمحتوا اجيب الموديل دة منين \nبس يكون الاصلى منه \nعلما بان الاصلية الماك بتاعها يبدا بالرقم دة \n00:C0:CA \nلقيت منه تقليد بس مش هينفع بصراحة =D \n","caption":"alfa.com.tw","description":"ALFA is a leading global provider of IP-based networking products and solutions for SMB, Enterprises, and SOHO markets.","created_time":"2016-12-20T19:20:17+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1333576833348688","from":{"name":"Ahmed Mozaly","id":"10154444669171313"},"message":"مقال محترم للي عايز يتابع ليه الفريق القائم على Redis خد بعض القرارات الأخيرة فيه","caption":"oldblog.antirez.com","description":null,"created_time":"2016-12-22T00:30:58+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1333648613341510","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"\"In a nutshell: they don’t\"","caption":"hub.zhovner.com","description":"In a nutshell — they don't. This post describes my fruitless effort to convince Microsoft employees that their service is vulnerable, and the humiliation one has to go through should one's account be blocked by a hacker. This is a story of ignorance, pain, and despair.","created_time":"2016-12-22T01:35:36+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1333739713332400","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"httpbin(1): HTTP Request & Response Service","caption":"httpbin.org","description":"Testing an HTTP Library can become difficult sometimes. RequestBin is fantastic for testing POST requests, but doesn't let you control the response. This exists to cover all kinds of HTTP scenarios. Additional endpoints are being considered.","created_time":"2016-12-22T03:48:47+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1333582683348103","from":{"name":"Abdallah Hodieb","id":"10154911720956083"},"message":"I require help representing Prayer names (Asr, Magrib .. etc) in ipa or x-sampa phonetic alphabet. \n\nI'm working on a personal project, An Amazon Alexa skill to tell me the prayer times, and i only get data from the Local mosque for now. \n\nI have a problem with making Alexa pronounce the prayer names correctly. The only way to do it in a decent way is by using SSML (https://en.wikipedia.org/wiki/Speech_Synthesis_Markup_Language), (https://developer.amazon.com/public/solutions/alexa/alexa-skills-kit/docs/speech-synthesis-markup-language-ssml-reference) using the ipa (https://en.wikipedia.org/wiki/International_Phonetic_Alphabet) or x-sampa (https://en.wikipedia.org/wiki/X-SAMPA) alphabet. \n\nMy problems is that i have no idea how to pronounce the names correctly using any of those alphabets, and i haven't found any resource for that online. \n\nI'd appreciate any help, specially if any one has experience with phonetic alphabets.","caption":null,"description":null,"created_time":"2016-12-22T00:37:21+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1333760863330285","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"hackernoon.com","description":"To explain this, I’m going to have to recap on some old work with a particular focus on co-evolution.","created_time":"2016-12-22T04:21:22+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1332776473428724","from":{"name":"Amr Ragab","id":"1882836905297081"},"message":"السلام عليكم, عايز أسأل على حاجة بخصوص Unity Development , عشان مش عارف بالظبط أبحث عنها إزاي.\nالفكرة ببساطة إني بعمل لعبة, اللاعب فيها بيتحكم بحركة الطيارة, وفيه صاروخ بيطارد الطيارة, الصاروخ الإحداثيات بتاعته بتتحسب بناء على مكان الطيارة في كل Frame, هو المعادلات الرياضية لسأ فيها حاجات هتتعدل, بس فيه مشكلة مقابلاني ومش عارف أحلها إزاي!\nنظراً لإني كل frame بحسب مكان جديد للصاروخ, والإحداثيات مش طالعة بشكل نقط متواصلة, فلما بشغل اللعبة بتبان إن في نفس اللحظة في كذا صاروخ ف الشاشة, مع إني لو عملت pause - كـ development - بيبان الصاروخ واحد بس عشان ف فريم معين..\nهل فيه طريقة لحل المشكلة دي بإني أخلي الـ render بتاع الصاروخ مرة كل 10 frames مثلاً أو أي إقتراحات آخرى. وشكراً :D","caption":null,"description":null,"created_time":"2016-12-21T04:25:44+11:00","total_likes":2,"total_comments":14},{"id":"172338516139198_1331744030198635","from":{"name":"Mohamed Moshrif","id":"1235868066468537"},"message":"كان فيه ناس كتير في الفتره الاخيره بتشتكي ليه في مصر مفيش ناس ملتزمه أو كويسه في المجال بتاعنا وبصفتي واحد كان عايش بره وكان عايز يرجع مصر ولسة لحد اللحظة ديه مش لاقي حاجة في مصر كويسة كفاية إنها تخليني أرجع (يمكن قريب الاقي) أنا شخصيا شايف إن فيه سببين رئيسيين ليه إن أي حد بمجرد انه يبقي شبه كويس, بيختفي من مصر.\n\nأول سبب هو الإدارة. أنت في مصر عندك الإدارة شبه دايما ياما حد ملوش في التقنيه على الاطلاق بس كويس في علوم الإدارة بحد ذاتها بس مشكلته انه بيحشر نفسه دايما في الخيارات التكنولوجيه. ده بيحط عبئ ضخم على الناس اللي شغالة تحته بيخليهم مش عارفين دايما يشتغلوا براحتهم. ده غير الطلبات الغير منطقيه بالمره.\nياما بتبقي الإدارة حد عميق الفهم للتكنولوجيا بس لا يفقه أي شيء عن الإدارة وفهمه للإدارة هي إنك تطلع عين الناس اللي شغالة معاك وتخليها دايما خايفة علشان تمشي عدل.\n\nمثال من أرض الواقع.\n يعني أنا مثلا من حوالي 3 سنين اشتغلت كام شهر في مصر. \n1- المسمي الوظيفي لي كان \"مدير قسم برمجه الألعاب\" اللي حصل بعض كدا إن اللي كان بيطلب مني هو مسؤليات نائب المدير للامور التقنيه (VP of Engineering) و لما غيرت الإسم الوظيفي لي في لنكيد أين للمسمي الواقعي، كلمني صاحب الشركة اني أغير المسمي دة علشان أنا مش بعمل كدا! قلت ليه حلو، يبقي محدش يطلب مني أي حاجة خارج حدود المكتب اللي أنا شغال فيه. قال أوك و بعض كدا مدير الموارد البشرية بعت لي علشان اكتب مستند يوضح إيه هي حدود و مسؤليات وظيفتي علشان هم مش عارفين إيه هي و بعض كدا نتناقش فيها. طبعاً الكلام دة كان بعض حوالي 6 شهور من العمل في شركة مشغلة واحد في منصب إداري و هم مش عارفين هو المفروض يعمل إيه بالضبط!!\n2- فهمهم العام في المجال اللي المفروض هم شاغلين فيه كان قاصر بشكل مزري. مثال واقعي حدث مابيني و مابين أحد الشركاء في هذه الشركة:\nهو: جيلنا مشروع جديد جامد جداً عايزين نعمله في أسرع وقت. يعني شهر ولا اتنين ولا حاجة\nأنا: إيه؟\nهو: بص. هنجيب نضارة من بتاعة الفيرتوال ريالتي ديه و هنوصلها بالتليفون المحمول بحيث انك لما تلبس النضارة تشوف انك ايرونمان و تشوف ايدك كدا و لما تبص في المرايا تشوف الزي الكامل و ممكن نعمل أهداف في الهواء أو على الحيطة ممكن تضربها بالشعاع اللي بيطلع من ايدك و بعض كدا ممكن أكتر من واحد يلبسو النضارة مع بعض و يحاربوا بعض\nأنا: .......\nهو: ها، الكلام دة ممكن ياخد أد إيه؟\nأنا: مقدرشي أديلك رقم معين الموضوع محتاج بحث شديد. بس أكيد هيبقي أكتر من سنة.\nهو: ليه؟؟ دة المفروض سهل جداً!\nأنا:.......\nهو: بجد، الموضوع مش معقد كدا!! نضارة و 3D و شويه فيرتوال ريالتي من اللي بنعمله كل يوم، يعني ممكن البروتوتيب يخلص في شهرين ولا حاجة\nأنا: و دة على أساس إيه حكمت إن الكلام دة صح؟؟\nهو: عندك جوجل جلاس عرفو يعملوه أهو!!!\nأنا: هات لي 200 موظف يشتغلوا تحتي و اديني كام مليار دولار ميزانيه أبحاث و اديني سنتين وانا اعملك وحدة زيها حاضر!!\n\nطبعاً الحوار دة كان بيتكرر مثلاً مرة كل إسبوع أو اتنين و كل مرة حاجة فضائية كدا. يعني مثلاً مرة كانوا عايزين برنامج أعقد من Home Styler بتاع اوتودسك (اللي بتعمل اوتوكاد) و يتعمل باستعمال اتنين جونيورس. قلتلهم 8 سنين!!\n\n3- فهمهم عن الإدارة هي انك تفشخ الموظفين بحيث إن كل اللي بيكون شاغل فكر أي حد فيهم هو إنه ميعملشي حاجة غلط علشان ميطلعشي ميتين أهله. يعني حاجة وحدة تلخص الموضوع دة كله، قائمة الجزاءات والحاجات اللي ممكن تخصم من مرتبك كنت بتاع 10 صفح، انما قائمة المكافأت كنت سطر واحد و هو انك لو اشتغلت زيادة عن الوقت بتاعك و لازم موافقة كتابيه من مدير مديرك. طبعاً مفيش أي حاجة عن إيه اللي ممكن تعمله علشان تترقي أو تاخد مكافأة كبيرة أي أي حاجة من النوع دة.\n4- موضوع التدريب و انك تشغل هناك فترة تقوم خبرتك تزيد و كدا، دة خيال علمي و كلام ملوش أدني علاقة بالواقع\n\n5- بعد لما سبتهالهم مخضرة و مشيت، ضحكوا على الأولاد اللي كانوا شاغلين تحتي و وعدوهم بمكافأة لو خلصوا الشغل بدري و بدل المكافأة، رفدوهم كلهم!!\n\nالمشكلة التانية هي المرتبات. ناخد مثلا مايكروسوفت امريكا ومايكروسوفت الصين ومايكروسوفت مصر.\nمرتب الشخص ال senior في مايكروسوفت اللي هو متوسط خبره مابين 10 الي 13 سنة مثلا, ده بيبقي المتوسط بتاعه في حدود 150 الي 160 ألف دولار في السنه ده المرتب الأساسي ملوش علاقة بالمكافآت والكلام ده.\nالصين اللي مصاريف المعيشة فيها اغلي من مصر حاجة بسيطه, متوسط المرتبات لنفس المهندس في حدود 85 اللي 90 ألف دولار. يعني تقريبا في حدود 56% من مرتب امريكا.\n\nنيجي لمصر. أنا لما سألت على مرتبات نفس الموظف في نفس الشركة, كانت في حدود 480 ألف جنيه في السنه (كل الارقام ديه قبل الضرائب)\n\nيعني في الصين حوالي 56% من مرتب امريكا وفي مصر حوالي 16% من مرتب امريكا.\n\nالسؤال بقي. أي واحد كويس ومفيش سبب انه يفضل في  مصر (زي إن اهله محتاجينه مثلا أو هو مش بيحب السفر) ليه يقبل ب 16% بس ومش 56% ولا 100% ؟!\n\nمبدأ \"أصل الشركات ديه بتكسب اقل من الدول التانية بكتير\" مش كافي علشان نفس المبدأ ده لما بيحصل بره (شركة ناشئة مثلا) بتعوض ده عن طريق اسهم في الشركة وأول لما بيجي ليها تمويل, بتدي مرتبات أكتر من الشركات الكبيرة. يعني على عكس ما ناس كتير فاهمة, اكبر مرتبات مش بتبقي مش شركات زي مايكروسوفت وجوجل وأمازون, بتبقي من ال startups اللي جابت تمويل علشان تقنع الناس ديه إنها تسيب الشركات الكبيرة وتروح ليها","caption":null,"description":null,"created_time":"2016-12-20T00:37:51+11:00","total_likes":25,"total_comments":11},{"id":"172338516139198_1333813559991682","from":{"name":"Mohammed Ahmed","id":"10155112068834394"},"message":null,"caption":"codepen.io","description":"Egyptian pound after flotation....","created_time":"2016-12-22T05:50:45+11:00","total_likes":25,"total_comments":3}]}