{"posts":[{"id":"172338516139198_852403834799326","from":{"name":"Hossam Barakat","id":"10158320349860623"},"message":"How Cadence Predicts Process, Very interesting post by Mary Poppendieck","caption":"leanessays.com","description":null,"created_time":"2014-11-28T01:00:27+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_852185628154480","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"http://Notedn.com\n==========\nI built Notedn.com two years ago\n\ni built it for personal usage at first , then i developed it to be a public online service\n\nit was takefastnotes.com at the beginning, it was in arabic and english interfaces and for notes only\n\na year ago i developed it to a new only english version , added (Taskbook) feature and planned for two more features ( codebook ) & ( linkbook ) , but i never had time to do them ,\n\ndo you have any advices about the site because i think about taking it down :(","caption":"notedn.com","description":"Notedn is an online notes manager and a cloud service that makes it easy for you to save your notes, links, codes and create to-do lists. It makes them reachable anywhere anytime. You can use reminders and categories to remember your notes and organize them. You also can use to-do lists to organize…","created_time":"2014-11-27T14:31:22+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_852839128089130","from":{"name":"Muhammad Saleh","id":"10155634469686002"},"message":"Dears,\nlearnable.com by SitePoint is free for this weekend ONLY\nIt has a lot of good courses for the web and mobile too\nRegister from here\nhttps://learnable.com/join/322/account\nSource:\nhttp://www.sitepoint.com/free-weekend-learnable-us/","caption":"learnable.com","description":"Learnable: Learn web development and design from the masters.","created_time":"2014-11-28T19:09:24+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_853104181395958","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"I just developed an android app using cordova from Apache\n\nIts very easy and interesting plateform\n\n","caption":"cordova.apache.org","description":"Apache Cordova is a set of device APIs that allow a mobile app developer to access native device function such as the camera or accelerometer from JavaScript. Combined with a UI framework such as jQuery Mobile or Dojo Mobile or Sencha Touch, this allows a smartphone app to be developed with just HTM…","created_time":"2014-11-29T06:40:47+11:00","total_likes":1,"total_comments":2},{"id":"172338516139198_853232131383163","from":{"name":"Marwa Dosoky","id":"10155139969921248"},"message":"for security geeks :\nhttps://www.facebook.com/OWASPCairo","caption":null,"description":"OWASP Foundation is a professional association of global members and is and open to anyone interested in learning more about software security.","created_time":"2014-11-29T11:49:06+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_853153418057701","from":{"name":"Muhammad Negm","id":"10212131509466411"},"message":"كالعادة بخش اشحت =D\nلو حد كان ناوي يشترك في Digital ocean\n https://www.digitalocean.com/?refcode=5dd3f969119c \nده الريفيرال لينك بتاعي\nواول ما تسجل حتاخد ١٠ دولار في حسابك تقدر تستخدمهم شهرين قدام وانا حاخد زيهم \"او اكتر اظن ما ركزتش =D\"\nاحسنوا لاخيكم =D","caption":"digitalocean.com","description":"Deploy an 512MB RAM and 20GB SSD cloud server in 55 seconds for $5/month. Simple, fast, scalable SSD cloud virtual servers.","created_time":"2014-11-29T07:43:11+11:00","total_likes":3,"total_comments":12},{"id":"172338516139198_853252481381128","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"We are inspired by this trick :S a Jenkins Missile when someone breaks the build :D","caption":"youtube.com","description":"A behind the scenes look at the development process here at PaperCut. See the open source software and video that when viral across the internet. Read more h...","created_time":"2014-11-29T13:07:18+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_853465064693203","from":{"name":"Mohammad Alaggan","id":"10154136920322085"},"message":"There has been internal conflict between Debian developers, appears to be between those who support freedom of choice even at the cost of some advantages, and those who support better performance and usability at the cost of bloated system that is difficult to modify freely (what is referred to as \"lock-in\" in the article). The bloat comes from adopting systemd instead of sysvinit, apparently. Debian is significant because it is one of the most widely-spread distributions and the base of many other distributions, such as Ubuntu and Linux Mint.\n\nAfter lots of mediation efforts failed, Debian is finally going to be forked. The freedom-supporting fork will be called Devuan.\n\nAlthough this is not about technical aspects, it is about policy, and about the philosophy of free software and the role of civil society in protecting ideals.","caption":"lists.dyne.org","description":null,"created_time":"2014-11-29T22:24:01+11:00","total_likes":4,"total_comments":3},{"id":"172338516139198_853220544717655","from":{"name":"Marwa Dosoky","id":"10155139969921248"},"message":"Hi Geeks, i want to ask u about something but i don't know if it is violates the posting roles; if it is , feel free to remove it ;)\n\nI was asked to develop an app for a clinic, obviously this is supposed to be a small project. I am a web developer but due to the project size i considered Java Swing, as it is easy to install and doesn't require an application server to run it. \n\ndue to your experience, is this a good decision. java swing with old JDBC is fine with small apps ?","caption":null,"description":null,"created_time":"2014-11-29T11:07:54+11:00","total_likes":0,"total_comments":9},{"id":"172338516139198_853743364665373","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"My first Cordova Android App :\nhttps://github.com/khashabawy/company-checker\n\nIt is easy using html5, CSS and JS","caption":"github.com","description":"company-checker - Simple android application to check for latest Company script versions","created_time":"2014-11-30T10:05:55+11:00","total_likes":2,"total_comments":2}]}