{"posts":[{"id":"172338516139198_863561540350222","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"The last geek in Egypt :)\n","caption":"youtube.com","description":"اشترك الآن لمشاهدة فيديوهات أكتر: http://goo.gl/CmFmR لمشاهدة أجدد الحلقات ادخل على: http://elgtv.com تابعنا على الفيس بوك: https://facebook.com/elgtv تابعنا...","created_time":"2014-12-19T16:19:53+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_863271953712514","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"A funny story:\n\nTrue story:\n\nCEO:\nMohamed, We just discovered that the deadline for the project is next Sunday for the first module to be delivered.\n\nME:\nWhat do you mean discovered? How on earth are we supposed to deliver something to the customer on Sunday, when today is Wednesday night.\n\nCEO:\nI am depending on you, I am sorry we have no other choice.\n\nME:\nWe haven't even done requirements gathering. What are we even supposed to develop.\n\nCEO:\nYou know they want an ERP.\n\nME:\nExcuse me? we have 3 days to deliver something, exactly what part of the ERP could we possibly deliver in that time from scratch?\n\nCEO:\nStart with inventory, cause the customer is expecting to open a new warehouse on Sunday.\n\nME:\nBut we have no idea what his requirements are, no stakeholders, and not a single document even vaguely explaining the requirements.\n\nCEO (Accusingly):\nDocument? Didn't you read the proposal? I sent it to you a week ago.\n\nME:\nYou mean the 7 page document that said that the business requirements were going to be \"generic and configurable\"?\n\nCEO:\nYes, we can use a workflow and implement any business logic we want.\n\nME:\nSo what business logic are we required to deliver Sunday?\n\nCEO:\nThe inventory management module\n\nME:\nYeah, exactly what possible functionality can we do in 3 days including the weekend.\n\nCEO:\nMohamed, this is exactly the type of attitude I was warned about by the CIO. He says your ideas are too \"theoretical\" and that you should just start writing code and worry about the requirements later.\n\nME:\nAre you really being serious? How on earth do we develop something we haven't even agreed on?\n\nCEO:\nJust do, Inventory In and out and a report to show the inventory.\n\nME:\nWhat about returns? And who said inventory is just in and out?\n\nCEO:\nInventory is easy.\n\nME:\nNo, Inventory is very complicated business, in fact it is a science. Didn't you read the big inventory book in your business school?\n\nCEO:\nDon't worry, the business here is simple, and we don't need any \"returns\"\n\nME:\nThat is just impossible.\n\nCEO:\nYou know what? I will solve the whole problem now?\n\nME:\nHow?\n\nCEO:\nWe built an ERP system for a dairy producer 5 years ago, you can just use the inventory module from there and deploy it to the customer.\n\nME:\nFirstly, that was 5 years ago in Visual Basic. The customer wants an ASP.NET web portal.\n\nSecondly, The \"ERP\" does dairy, this is construction material.\n\nCEO:\nWhat is the difference? See, you already complain without even knowing the whole story. Your main problem is that you are too rash and not tactful.\n\nME:\nSo who can explain to me how a dairy ERP can work at a cement factory?\n\nCEO:\nThe business analyst.\n\nME:\nAnd what about the code.\n\nCEO:\nI think we have it backed up somewhere. You understand the business and figure out how to use the system. Then read the code and understand it and figure out the changes you need to make.\n\nME:\nBut the customer is waiting for a system built with ASP.NET, how do I deliver a system in Visual Basic windows forms? even if we forget about the business?\n\nCEO:\nUse the system as a backend and build a new front end. I am guessing this will save you a lot of time.\n\nSee , when you think business and get out of your technical bubble you can actually get stuff done.\n\nI leave the rest of the story to your imagination :)","caption":null,"description":null,"created_time":"2014-12-19T02:53:22+11:00","total_likes":25,"total_comments":25},{"id":"172338516139198_863947730311603","from":{"name":"Seif Aldin","id":"10211230833542983"},"message":"https://cubetriks.wordpress.com/2014/12/20/the-top-5-online-marketing-2015-get-ready/","caption":"cubetriks.wordpress.com","description":"1. Content Marketing Will be Bigger Than Ever As we enter 2015 in a more mature industry (58% of B2B marketers plan to increase their content marketing budget over the next 12 months), marketers wi...","created_time":"2014-12-20T12:25:00+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_863659637007079","from":{"name":"Ahmed Al-Amir","id":"10155179919799180"},"message":"Can you make a \"Hello, World\" program completely unreadable?","caption":"benkurtovic.com","description":"A few months ago, I got first place in this Code Golf contest to create the weirdest obfuscated program that prints the string “Hello world!”. I decided to write up an explanation of how the hell it works. So, here’s the entry, in Python 2.7:","created_time":"2014-12-19T22:19:34+11:00","total_likes":3,"total_comments":5},{"id":"172338516139198_864160363623673","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"Do you think they are gonna make it ?","caption":"khashabawy.com","description":"Hyperloop القطارات فائقة السرعة … فكرة فى طريقها إلى الواقع khashabawy 20/12/2014 لا يوجد تعليقات 11 مشاهدة Elon Musk هو من الشخصيات الرائعه بالعالم التى يجب حقاً أن تعلم عنها .. فهو مرتبط بالعديد من المشاريع البحثيه مثل Hyperloop و مؤسس لشركة SpaceX المتخصصه فى علوم استكشاف الفضاء و شريك فى عدد من…","created_time":"2014-12-20T23:55:23+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_864301296942913","from":{"name":"Mohammad Hefny","id":"10158294422125471"},"message":"http://dada.perl.it/shootout/\nNice site that compares performance of different languages.","caption":"dada.perl.it","description":"As stated in the note above, this is a port of the Great Computer Language Shootout by Doug Bagley on the Win32 platform. Doug made a hell of a good job with this test suite on its Linux box. Since most of the programming languages are implemented on Win32 without many differences, I started taking…","created_time":"2014-12-21T05:31:26+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_864502356922807","from":{"name":"Mohammad Tayseer","id":"10154965677956341"},"message":null,"caption":"revsys.com","description":"There are several things that are not usually appropriate to put into a relational database","created_time":"2014-12-21T12:37:37+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_863979713641738","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Ember, Angular, React, Knockout, Backbone, Meteor. JavaScript, where are we going in 2015? ","caption":"breck-mckye.com","description":"The JavaScript world seems to be entering a crisis of churn rate. Frameworks and technologies are being pushed out and burned through at an …","created_time":"2014-12-20T14:35:21+11:00","total_likes":6,"total_comments":3},{"id":"172338516139198_859273824112327","from":{"name":"Mohamed El-Kholy","id":"10154903509466885"},"message":"shabab , what about working on this app together ? does that sound like a good idea ?","caption":null,"description":"محتاجين واحد ابن حلال كدة يعمل موبيل ابليكيشن كل الناس تنزلها و تبقي وظيفتها ان الطفل الي يتوه ابوه او امه فورا يبعتوا صورته علي الابليكيشن دي تقوم هي تعمل نوتيفيكيشن لكل الناس الي قريبين من الlocation الي الاهل بعتوا منه يعني مثال لو طفل - ربنا يعافينا - تاه في النادي مامته تبعت صورته و بيناته علي الابليكيشن تقوم كل الناس الي في النادي الي عندهم الابليكيشن دي يطلعلهم notification ان الولد الفولاني اسمه و سنه و صورته كذا تاه دلوقتي فكله يبص حواليه و ممكن جدا يعرفوا يلاقوه او لو حد حاول يخطفه ممكن يتمسك....او علي الاقل يخالوا بالهم من عيالهم!\n\nو ممكن نسمي الابليكيشن #مؤمن\nأو #find_my_child مثلا\n\nشير يا جماعة يمكن نلاقي developer ابن حلال يتبرعلنا\nها مين ممكن يتطوع و يعمل الموضوع ده؟","created_time":"2014-12-11T17:49:06+11:00","total_likes":16,"total_comments":25},{"id":"172338516139198_862529653786744","from":{"name":"Abdo Barakat","id":"1367548563267323"},"message":"لو سمحتوا ياجماعة محتاج مساعدة .. ياريت لو حد عنده فكرة عن تأسيس الشركات في أميركا . محتاج مساعدة ضروري :)","caption":null,"description":null,"created_time":"2014-12-17T22:29:38+11:00","total_likes":0,"total_comments":5}]}