{"posts":[{"id":"172338516139198_857917214247988","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"المقال ده جميل بيتكلم عن الويبديزاين و تطوره من اول الCSS, Javascript, Table based designs, Flash intros, ...","caption":"blog.froont.com","description":"How the web design evolved from tables and flash into responsive web design. A glimpse into the history on why design and code live separate lives....","created_time":"2014-12-09T00:34:34+11:00","total_likes":11,"total_comments":0},{"id":"172338516139198_857849310921445","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":"We are getting prepared to work on an app that needs the highest security possible.. what should we consider?\nEgyptian experience or not ?\ncompanies or individuals ?\nhow much do you think it might cost ?","caption":null,"description":null,"created_time":"2014-12-08T21:00:19+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_857537530952623","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"This is a list of top 10 free linux books for all you Linux geeks out there\n\n","caption":"royal.pingdom.com","description":"Who doesn’t like free stuff? We put together a selection of free Linux e-books that you can read, in many cases download, and use as references, or simply to learn something. The topics range from advanced programming to Java, from GNU to Emacs, from device drivers to the kernel, and much, much more…","created_time":"2014-12-08T06:44:19+11:00","total_likes":7,"total_comments":25},{"id":"172338516139198_857106480995728","from":{"name":"Mohamed Soliman","id":"654812041374345"},"message":"ياجماعة محتاج مساعدة ونصيحة من حضراتكم :) \nايه افضل طريقة اقدر انظم بيها وقتى ما بين دراستى فى الجامعة وما بين ال self study بحيث تزيد من انجازى للاتنين","caption":null,"description":null,"created_time":"2014-12-07T06:54:15+11:00","total_likes":1,"total_comments":12},{"id":"172338516139198_857872217585821","from":{"name":"Amr Sobhy","id":"10155500123765016"},"message":"What's the best practice to secure an API call within an android application to minimise abuse, given the fact any API key, URL used or data you store in the app can be recovered through decoding the apk. Any general non-oauth thoughts/approaches?","caption":null,"description":null,"created_time":"2014-12-08T22:23:17+11:00","total_likes":2,"total_comments":13},{"id":"172338516139198_858136370892739","from":{"name":"Ahmed Abd El Wahab","id":"1463417307070803"},"message":"سلام عليكم :) \n\nايفنت منظماه MUFIX Community في حاسبات المنوفية \n\n====================================\n\nفي ناس ممكن تسالنا طيب يعني ايه SFD ؟ وانا ايه اللي هستفاده لما اجي او اني لما اخد من وقتي ووقت مذاكرتي واجي احضر الايفنت ؟\nبص هقولك .. بغض النظر عن الاستفاده الكبيرة بمعرفتك باسم المجال ولما حد يسالك يقولك يعني ايه Linux ويعني ايه Open Source وتكون عارف يعني ايه وتتكلم معاه .. هيفرق معاك جدا وبكره تعرف الفرق وتشوفه بعينك\nكمان هتتعرف على شخصيات متميزة وناجحه .. وازاي هما بدوا زي ما انت هتبدا وتكون ! وحاجات تانيه كتير يطول شرحها هنا \nربنا يوفقكم ويجعل فيكم الخير لغيركم ^_^ \n\nhttps://www.facebook.com/events/755994621142452\n===================================","caption":"Software Freedom Day 2014","description":"Software Freedom Day (SFD) is an annual worldwide celebration of Free Software. SFD is a public education effort with the aim of increasing awareness of Free Software and its virtues, and encouraging its use.\n\nSoftware Freedom Day was established in 2004 and was first observed on 28 August of that year. About 12 teams participated in the first Software Freedom Day. Since that time it has grown in popularity and while organisers anticipated more than 1,000 teams in 2010[1] the event has stalled at around 400+ locations over the past two years, representing a 30% decrease over 2009.\n\nSince 2006 Software Freedom Day has been held on the third Saturday of September, it has occasionally coincided with International Talk Like a Pirate Day.\n------------------------------------------------------------\nالسلاااام عليــكم  \n\nازيكم جميعا وايه اخباركم الدراسية ؟  \n\nمافكس بتقدملكم مفاجأة الموسم الجديد من نشاطها السنوي  .. الحدث اللي كلنا منتظرينه عشان نشوف كل جديد ومفيد لينا .. من خلال MUFIX Community \n\nيوم البرمجيات الحرة 2014 \" Software Freedom Day \" \n\nطيب افرض اني واحد مش عارف يعني ايه يوم البرمجيات الحرة اعمل ايه ؟ \n\nهنقولك باختصار وهتكمل معرفتك دي لما تيجي الايفنت وتشوف وتتابع بنفسك الدنيا وصلت لفين في مجال المصادر المفتوحة وكمان المجال بره اللي هتتخرج تشتغل فيه ! \n\nيوم البرمجيات الحرة دا .. يوم احتفالية بنشئة المصادر المفتوحة على مستوى العالم وبتنظمه عدد كبير من المنظمات والكيانات على مستوى العالم .. وبيهدف انه يعرف الناس اكتر بالمجال ومش بس كدا بيكون فيه معلومات كتير جدا بيقدمها شخصيات على اعلى مستوى من الخبرة عشان ينقولها ليكم في اليوم دا .. بالاضافه الى مفاجأت اليوم  \n\nمافكس هي المنظمة التانية في مصر اللي بتقوم بتنظيم الحدث دا على مستوى الجمهورية وبتنظمه من 5 سنين على التوالي لحد دلوقتي وبيكون من احلى واكبر الايفنتات اللي بتسيب بصمة فعلا مع الطلبة .. لانها بتقربهم للمجال دا اوي وبتحببهم فيه .. يكفي حضورك حتى لو مكنتش لسه عارف يعني ايه Open Source  \n\nمتسنينكم يوم الثلاثاء القادم 9/12/2014 \n\nفتح التسجيل قريبا والاعلان عن باقي التفاصيل زي برنامج اليوم والمكان والموعد بالتحديد وكل دا ان شاء الله ..  \n\nBest Wishes \nMUFIX Team  \n\n#One_Team #One_Dream\n#MUFIX_Community_is_the_Best_forever <3 <3","created_time":"2014-12-09T08:38:07+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_857845997588443","from":{"name":"Khaled M. Diab","id":"10212550395463324"},"message":"different concurrency models: locks vs actors vs STM .. an interesting article to understand the basic ideas of these models ..","caption":"adit.io","description":"Aditya Bhargava's personal blog.","created_time":"2014-12-08T20:44:57+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_858153144224395","from":{"name":"Yehya Hafez","id":"1814037031955164"},"message":null,"caption":"creativebloq.com","description":"In the last in a series of articles, Chris Bank of UXPin explains the Blur Technique.","created_time":"2014-12-09T09:33:57+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_857307257642317","from":{"name":"Mohamed Nady","id":"10154387282503733"},"message":"Material design (codenamed quantum paper) Developed by Google,\nIt brings a cleaner design and consistent look to mobile apps and Web pages across different platforms, using bold and colorful graphics. Depth effects such as lighting and shadows allows the user to have a more realistic experience. Fluid animations and transitions brings continuity and helps the user know how content moves, and reacts to input.\n\nhttp://www.google.com/design/\n\nhttp://en.wikipedia.org/wiki/Material_design\n\nhttps://developer.android.com/design/material/index.html\n\nhttps://material.angularjs.org/#/\n\nhttp://www.google.com/design/spec/material-design/introduction.html#introduction-goals","caption":"google.com","description":"At Google we say, “Focus on the user and all else will follow.” We embrace that principle in our design by seeking to build experiences that surprise and enlighten our users in equal measure. This site is for exploring how we go about it. You can read our design guidelines, download assets and resou…","created_time":"2014-12-07T19:18:37+11:00","total_likes":7,"total_comments":1},{"id":"172338516139198_858131090893267","from":{"name":"Abdulrahman Mohamed","id":"1351989794859335"},"message":"موقف اعتقد بيحصل لناس كتير\n\nفيه شخص صاحب موقع منافس ليا صاحب اضافة فى موقعه انا بالصدفة بعملها حاليا لموقعى وطالب انى اعملهاله والكود ده ميطلعش لحد\n\nاعملهاله و اعملها عندى بكود مختلف ولا ايه ( تفكير غريب شوية )\n\nولا ايه ؟","caption":null,"description":null,"created_time":"2014-12-09T08:20:56+11:00","total_likes":1,"total_comments":20}]}