{"posts":[{"id":"172338516139198_1019557454750629","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"فى ناس فى مصر بتهتم بموضوع ال performance بشكل جد جداً, أحمد واحد منهم.","caption":null,"description":null,"created_time":"2015-10-15T04:49:15+11:00","total_likes":25,"total_comments":3},{"id":"172338516139198_1018210681551973","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"شباب جتلى فكرة دلوقتى مش عارف ممكن نساعد بعض نعملها ولا لأ؟، فيه مننا ناس كتير شغالين فى شركات كبيرة و عريقة زى Microsoft, IBM, Sakhr, Booking.com, Amazon ، هل من الممكن الناس دى توريلنا الشركات من جوة؟ ان كل واحد ياخد صور من المكتب حواليه و المبنى من برة و يعمله البوم هنا بأسم الشركة؟ هتكون حاجة كويسة الناس التانية هتشوف الجو جوة عامل ازاى و هتكون حلوة سواء للناس اللى شغالين او اللى لسة فى كلية يشوفوا الدنيا، جتلى الفكرة دى لما لاقيت حد هنا شغال فى شركة صخر وانا من وانا طفل كان نفسى اشوف الشركة دى من جوة عاملة ازاى :D\nانا بدأت بنفسى  : https://www.facebook.com/media/set/?set=oa.1018226911550350&type=1","caption":null,"description":null,"created_time":"2015-10-11T22:16:21+11:00","total_likes":25,"total_comments":20},{"id":"172338516139198_1019281894778185","from":{"name":"Said Bakr","id":"10154979109648745"},"message":"سؤال شخصي نفسي:\nهل يمكن وهل من المعتاد إذا ما استغرقت في كتابة كود، أن يخاطبك أحدهم وترد عليه ولا تتذكر؟!\nحصلت معايا مرتين في خلال شهر، آخرهم الليلة دي، المدام جابت لي كباية شاي، وقلت لها شكرا، وبعدها وجدت أمامي كباية شاي دافية ولا اعلم من أين أتت، وعلمت بالحكاية بعد سؤال المدام!","caption":null,"description":null,"created_time":"2015-10-14T10:47:54+11:00","total_likes":7,"total_comments":5},{"id":"172338516139198_1019844701388571","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":"حاولت افهم ... بس اتلخبطت اكتر\nفأتمنى لو تشرحولي الفرق بين:\nSoftware architect \nDevelopment manager\nDevelopment team leader\nScrum master\n\nومين احسن حد ممكن يبقى شريك في ستارت اب ويقدر ينفذ المشروع (ويب او موبايل) بالكامل عن طريق انه يقسم الشغل حسب التكنولوجي المناسبة على فريلانسرز بالتوازي ويستلم منهم ويركب الكود على بعضه ويشغل المشروع بقى ويستمر في تطويره واصلاح المشاكل؟","caption":null,"description":null,"created_time":"2015-10-15T23:28:22+11:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1018057911567250","from":{"name":"Meligy","id":"10154884040385170"},"message":"حد فاكر صخر؟ :)","caption":"io.hsoub.com","description":"السلام عليكم ورحمة الله بعد الموضوع الذي طرحته حول شركة صخر و الذي كان بعنوان شركة","created_time":"2015-10-11T11:25:12+11:00","total_likes":25,"total_comments":9},{"id":"172338516139198_1019853768054331","from":{"name":"Nouran Mahmoud","id":"1396888116998492"},"message":"المسدج دي اتبعتت لي علي لينكد ان، انا بحطها هنا علشان افهم هو الـendrosement اتعمل لـكدا؟ .. اي حد يدخل يعمل endrose لأي حد في اي skill ؟؟ انا تقريبا نص اللي عاملين لي endrose ناس لا اعرفهم و لا يعرفوني ولا اشتغلنا مع بعض ..وأنا مبعملش endrose لحد غير اللي اعرفهم او اشتغلت معاهم .. فهل ده التصرف الطبيعي للـ feature دي ؟ و هل فعلا الـ HR بيهتموا بالحاجات دي اللي مفيهاش اي نوع من انواع الأمانه او المصداقيه اصلا!؟ ولا دي من العادات السيئة علي Linkedin؟ ولا ده تصرف سليم مفيهوش مشكله؟\n\nأيه رايكم؟","caption":null,"description":null,"created_time":"2015-10-15T23:55:24+11:00","total_likes":8,"total_comments":13},{"id":"172338516139198_1020270818012626","from":{"name":"Ahmed Magdy El Hanafy","id":"10212057465741966"},"message":"Good introduction to Reactive Programming and RxJava","caption":"realm.io","description":"How can you move away from traditional synchronous state management with variables to asynchronous streams of data? Try functional reactive programming! In this talk from Droidcon NYC 2015, Juan Gomez explains why you should use FRP, and covers three main topics: reactive extensions, observers & des…","created_time":"2015-10-17T00:57:45+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1020378278001880","from":{"name":"Omar Hadhoud","id":"1588343471179984"},"message":"I started Harvard's CS50 this year around June, and sadly, I'm completing it in a bad rate really, now I'm near the end, just doing Pset 7, then it will be pset 8 and the final project. So I don't really what shoud I do after finishing CS50 ? I'm looking to be a software engineer, probably I'm going to learn python, although I'm not entirely sure, I like c and I'm interested to learn c++. The main problem that the next year, I'll be in my final year in \"ثانوية عامة\", so it would be really hard to keep going the next year, specially from January of next year. So I was asking for the best thing to do in this time, so I wont waste this time. Thanks alot in advance.","caption":null,"description":null,"created_time":"2015-10-17T06:57:09+11:00","total_likes":2,"total_comments":1},{"id":"172338516139198_1020785537961154","from":{"name":"Mohammad Fouad","id":"10154777096910845"},"message":"Anyone else notice when you search google.com.eg it takes forever to return results?\nI have to delete the .eg part for the search to load quickly.\nJust me??","caption":"google.com.eg","description":null,"created_time":"2015-10-18T09:06:03+11:00","total_likes":2,"total_comments":11},{"id":"172338516139198_1020578274648547","from":{"name":"Mahmoud Tantawy","id":"10155099548114764"},"message":"Thoughts?","caption":"carlos.bueno.org","description":"One of the (few) advantages of being in technology for a long time is that you get to see multiple tech cycles beginning to end. You get to see how breakthroughs actually propagate. If all you have seen is a part of the curve, it’s hard to extrapolate correctly. You either overshoot the short-term p…","created_time":"2015-10-17T21:11:55+11:00","total_likes":2,"total_comments":5}]}