{"posts":[{"id":"172338516139198_808827022490341","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"alistapart.com","description":"Where does code review factor into your process? Don’t make it an afterthought, or avoid it altogether; Emma Jane Hogbin Westby shows us how code reviews can be done constructively and painlessly in this walkthrough. Even if you aren’t using Git to store your code, the principles here will make for…","created_time":"2014-09-04T09:53:52+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_808830032490040","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"The title say it all :)","caption":"frontendbabel.info","description":"What Every Frontend Developer Should Know About Webpage Rendering Written by Alexander Skutin on 26th May 2014; translated by Max Shirshin on 30th June 2014 Today I'd like to focus on the subject of web page rendering and why it is important in web development. A lot of articles are available coveri…","created_time":"2014-09-04T10:06:35+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_808351315871245","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"كنت عيز اخد راي الجيكس فى حاجة مهمة جدا بنسبالي...\nانا دخلت مجال البرمجة من حوالي سنتين تقريبا وعندي مشكلة\nفى خلال السنتين دول كنت ديما بذاكر وبتعلم حاجات جديدة باستمرار\nيعني مثلا اتعلمت c#,asp.net,sql server,winforms وذاكرت شوية game developement وعملت لعبة صغيرة علي قدي المهم دايما بطبق اللي بتعلمه\nوحاليا شغال بقالي سنة ونص ويب ديفلوبر, من فترة قريبة قررت اني اتوجه للاوبن سورس فبدات اتعلم php, mysql, laravel framework\nالمشكلة انى بذاكر وبطبق ديما يعني بدعم المذاكرة دي بتطبيق ولو حتي بعمل امثلة علي اللي اتعلمته...\nبس مشكلتي اني لو رجعت للحاجة بعد فترة بلاقي نفسي نسيت حاجات كتير !!\nفبضطر اني ارجع اقرا شوية عشن انعش الذاكرة وافتكر..\nمع العلم اني مذاكرتش بورقة وقلم كل مصادري كتب وفيديوهات وحاجات زي كده..\nافيدوني ايه الحل اني اثبت كل حاجة بتعلمها في دماغي ولما ارجعلها بعد فترة الاقيها موجودة ... هل في طريقة للمذاكرة معينة ممكن تساعدني ؟ هل الخرائط الذهنية والكلام اللي من النوع ده هيساعدني ؟\nمحتاج مساعدتكم..وشكرا ليكم مقدماً","caption":null,"description":null,"created_time":"2014-09-03T06:40:55+10:00","total_likes":5,"total_comments":12},{"id":"172338516139198_808853222487721","from":{"name":"Mohamed Hashem","id":"1387228811341413"},"message":"i deployed asp.net mvc project through visual studio to a website hosting that support mvc and MS sql too  and restore a database backup successfully but there's some error in web.config file so the website didn't work properly related to database access but the project works fine locally\n\nand honestly this is a first time for me to deal with things related to deploy and publish project through website hosting so that i tried many things to correct the error related to connection string but i couldn't do that\n\nthis is the connection string after updated \n  <add name=\"wa3enyEntities\" connectionString=\"metadata=res://*/Models.Model1.csdl|res://*/Models.Model1.ssdl|res://*/Models.Model1.msl;provider=System.Data.SqlClient;provider connection  string=&quot;data source=SQL5004.myASP.NET;initial catalog=DB_9B2DF3_wa3iny;integrated security=False;MultipleActiveResultSets=True;App=EntityFramework&quot;\" providerName=\"System.Data.EntityClient\" />\n\nthe website hosting support review the connection string and told me that \ni should review the code to ensure that not  overwritten by any other script.\n\nbut it works locally without any problem so i didn't think that the error in code but in the connenction string but i didn't know it till now","caption":null,"description":null,"created_time":"2014-09-04T11:32:00+10:00","total_likes":1,"total_comments":7},{"id":"172338516139198_808960295810347","from":{"name":"Kareem Kashwaa","id":"721605545"},"message":"To those with unit testing experience,\nI need to test a class that that sends data to a repo, lets say the given class has 2 methods, one is Create, the other is Exists, Create adds a new entity to that repo and Exists checks if a certain entity exists on the repo, \nmy question is, if I want to test Exists and Create, can I use each method to test the other, but in this case I would have used an untested method to test another, If I'm to rewrite the logic used to add the entity, I would have broken the DRY principle, it seems like a loop, how should this be done?\nnote: mocking the repo is out of question","caption":null,"description":null,"created_time":"2014-09-04T19:24:59+10:00","total_likes":1,"total_comments":3},{"id":"172338516139198_809001569139553","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"LOOOOL, scroll on the comic to pixels level :D \nthis is an endless zooooooooming script, i liked it so much.","caption":"xkcd.com","description":"Warning: this comic occasionally contains strong language (which may be unsuitable for children), unusual humor (which may be unsuitable for adults), and advanced mathematics (which may be unsuitable for liberal-arts majors).","created_time":"2014-09-04T22:02:38+10:00","total_likes":3,"total_comments":2},{"id":"172338516139198_809114852461558","from":{"name":"Hesham Mohamed Eladawy","id":"10154309434427452"},"message":null,"caption":"youtube.com","description":"في هذا المقطع يتحدث م.مصطفى جمال شارحا ما هي الحوسبة السحابية (الكلاود)، وكيف نشات من مفهوم grid computing وكيف يتم التعامل مع النماذج المكونة لها SaaS, PaaS...","created_time":"2014-09-05T03:39:32+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_808228485883528","from":{"name":"Maged Eladawy","id":"1220459164735315"},"message":"3- Who is involved - Deadline 4 of Sep\n\nالفكرة اللى هنشتغل عليها هى رقم ٥\nEgyptian Geeks Ideas&Discussion Platw\nhttps://github.com/egyptian-geeks/Activities/issues/5\n\nالفكرة هى كالتالى \nIndependent platform for posts,ideas, discussion and Q/A's. \nSponsored Events, with Ads, could help with server rents. \nDeveloping the platform will be a Piece of Cake - i guess :D -. \nArchiving group posts to the platform. \nEtc..\n\nاللى شايف إنه ممكن يشارك بشكل أو بآخر فى تنفيذ الفكرة دى ياريت يملا الفورم دى...\n\nhttps://docs.google.com/forms/d/1nCm2iMmub2xJCKX_PDinKS7XPVoSMfcY2rqCRRYCHWE/viewform?usp=send_form\n\nإنشاء الله بعد المرحلة دى ممكن نجمع الناس اللى هتشارك و نعمل \nSkype او Hangout call \nعلى يوم الجمعة أو السبت\n\nهنتناقش فى الحاجات دى\n\nExpected Features from each one perspective \nUsed Framework & Programming Language (Each one should suggest)\nOur roles (Who Should Manage The Project, Development Team..etc)\nAny Suggested Tools (Follow-up tools / Tasks management systems, Git / SVN...etc)\nUsed Methodology (If we are going to use any development methodology)\n\nممكن تحط المواعيد المناسبة ليك من هنا \nhttp://doodle.com/pse6puayuap2hgxe\n\nعلشان نشوف هنقدر نعمل اول ميتنج لينا أمتى أنشاء الله...\n\nبقيت الأفكار هنشتغل عليها بردو إنشاء الله لما نوصل لمرحلة كويسة فى المشروع ده","caption":null,"description":null,"created_time":"2014-09-03T00:24:55+10:00","total_likes":1,"total_comments":5},{"id":"172338516139198_810621012310942","from":{"name":"Husamuddin Hamad","id":"1275746175855756"},"message":"I need a free temporary hosting that provides AMP packages.. \nany suggestion?","caption":null,"description":null,"created_time":"2014-09-07T04:21:53+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_810635405642836","from":{"name":"Elsharnouby Mohamed","id":"10155040034611904"},"message":"That's a jaw dropping effort from Flipboard :O\nAlgorithms for showing content in the best way\n\n","caption":"engineering.flipboard.com","description":"At Flipboard, we are working hard to build the world’s best personal magazine—a magazine made just for you, filled with the stories you care about most.","created_time":"2014-09-07T05:08:31+10:00","total_likes":3,"total_comments":1}]}