{"posts":[{"id":"172338516139198_1348951911811180","from":{"name":"Ahmed Omar","id":"912933662143336"},"message":"السلام عليكم ورحمه الله وبركاته \nعايز تتعلم #Xamarin وتبرمج تطبيقات الموبايل #ios , #android بالسي شارب\nتابع معانا أحدث الدوات التعليمية علي قناة : http://www.witroo.com/channel/HoussemDellai\nوحاجات تانية كتيييير\nوتابع أحدث القنوات علي هذا الرابط \nhttp://www.witroo.com/Channels\nتابعنا علي #تويتر http://twitter.com/trywatroo \nعلي #فيس_بوك http://facebook.com/Witroo\nوللتواصل وإقتراح القنوات التعليمية علي البريد الإلكتروني info@witroo.com\n#ويتروو","caption":"witroo.com","description":"Helping enthusiasts developers to learn mobile (Xamarin Forms & Windows) and web (ASP.NET, Web API) development.","created_time":"2017-01-09T04:17:40+11:00","total_likes":8,"total_comments":0},{"id":"172338516139198_1347416401964731","from":{"name":"Hossam Eldin Mahmoud","id":"1308049899287135"},"message":null,"caption":null,"description":null,"created_time":"2017-01-07T05:34:23+11:00","total_likes":5,"total_comments":2},{"id":"172338516139198_1348390785200626","from":{"name":"احمد قرواش","id":"1250647018364386"},"message":"شباب بالنسبة لمشكلة ال Skype وال VOIP عموما في مصر واي بلدان محجوبة فيها الخدمة.\nانا بفكر في سرفيس نستخدمها نتخطي بيها الموضوع ده ونعمل الموضوع كمان Open source بحيث يبقي متاح للتطوير من قبل مطورين اخرين.\n\nالفكرة الي انا بطرحها وهي باستخدام vpn services \nطيب هتقولو ال vpn هيسبب مشكلة لسكايب انه مش هيشتغل وال vpn مفتوح\nبالتالي لازم نلجأ ل vpn مدفوع.\n\nطيب ما احنا ليه نبين ل Skype او حتي ال services الي بنشتغل بيها اننا بنستخدم اداة للتخفي او ال privacy.\n\nالحل اننا نشفر الاتصال بدون ما يبان اننا مشفرينه\n\nالحلول بتبقي step by step\n1 - DNS Leak \n2 - User Agent \n3 - Flash \n4 - Footprint / Fingerprint of VPN Tunnel\n5 - Network Setting Packets / Header Packets\n\nدول لو قدرنا نحلهم انت بيبقي معاك في بي ان لكن بيبان انك مستخدم جهاز real فعلا من الدولة الي انت مختار منها location وطبعا بتقدر تضبط ال ISP كمان بحيث تضبط موضوع ال Anonymity.\n\nطيب واحد يقولي الموضوع ده هيتم ازاي.\nكله الشغل بأن ال APP هيعملك تعديل في اعدادات جهازك بحيث يقفل ليك الفلاش او يفضل انك تشيله بالتالي مفيش تسريب لبيانات جهازك الفعلية وبيانات الشبكة.\n\nال ال User Agent سهلة وديه في حالة كانت السيرفيس علي الويب.\n\nمشكلتها هتبقي في رقم 1 - 4 - 5\n\nديه هتبقي شغل Network فعليا التطبيق هيقوم بتعديل علي قيم زي MSS و MTU\nMaximum Segment Size / Maximum Transmission Unit\n\nودول بيتعدلو بصعوبة انا بصراحة بعرف اعدلهم يدوي ولازم اكون علي OS مفتوح زي لينوكس .\nبمجرد انك تقدر تضبط القيم تلك للقيم الصحيحة حسب الشبكة بتبقي وقفت عملية تسريب الباكتس والداتا الي بتفضحك ببساطة شديدة دول بيانات هدفها تفضحك علي الانترنت.\nولو غلط غلطة واحدة النت مش هيشتغل تاني.\n\nفالحاجة هنا بقي لبرنامج اعتقد هيكون Deep Learning لحتي يقدر يعدل القيم تلك.\nويبقي بيطور نفسه ذاتيا.\n\nاتمني يكون الفكرة واضحة.\n\n======== النتيجة ========\nمش محتاج ادفع شهريا لشركة في بي ان هو مجرد Free Open Vpn\nبالاضافة لعملية ال Privacy القوية الي عملتها في جهازك.\n================================\n\nنتناقش في الموضوع ونطلع الحلول والافكار ان امكن صناعة مثل تلك التطبيق.\nحتي لو نكون ستارت اب غير ربحية لعلاج المشكلة ديه ونكون احنا ال VPN Provider ليها.","caption":null,"description":null,"created_time":"2017-01-08T10:51:46+11:00","total_likes":11,"total_comments":6},{"id":"172338516139198_1349341615105543","from":{"name":"Ahmed Elebzary","id":"1262912267118749"},"message":"https://www.facebook.com/ruhevent/photos/a.759665570806500.1073741828.756100174496373/1085507974888923/?type=3&theater","caption":null,"description":"أقترن أسمه بأسم الفورتي جيت أحد رواد السيكيورتي في العالم العربي هو من القادمين بقوة في هذا المجال هيكون معانا يوم الجمعة الساعة  24-2-2017 الساعة 2 ظهراً بتوقيت مكة مع الخلوق والمحترم المهندس تامر زين والآن نتركم مع مقالة من المقالات الهامة له في عالم االفورتي جيت\n\nمن سيناريوهات محترفي الـ FortiGate موضوع Load Balance \n\nسيتعاون معنا الفورتي جيت في ادارة وتوزيع الترافيك على مجموعة السيرفرات بما تحمله من ابليكيشن حسب الطريقة التي تختارها ومن بين عدة طرق متاحة \n\nيمكن ان تكون هذه السيرفرات مثلاً Microsoft server 2008 , 2012 تحمل web server او تحمل FTP server \n\nجميع هذه السيرفرات متطابقة تماماً بمعنى ان كل سيرفر يمكن ان يعمل بمفرده ويخدم الشبكة ، اذن فما فائدة 3 سيرفرات تحمل نفس السيرفس ؟\n\nهنا يظهر فكر الـ HA high availability وهو المبدأ الذي سيحقق لنا عدم انقطاع فى الخدمة عن الكاستمرز وذلك بنسخ نفس السيرفرات بما تحويه من ابليكيشن بشكل متطابق تماما على عدد اثنين او ثلاثة او اكثر حتى يمكننا توزيع الحمل عليهم جميعا بدلا من ان يتحمل الضغط سيرفر واحد \n\nكما يمكننا سحب اى سيرفر للصيانة وتعطيله بدون ادنى تأثير على الـ Services availability \n\nالفورتي جيت سيقوم بتوزيع الاحمال بعدة طرق منها \nSource IP Hash\nRound Robin\nWeighted\nFirst Alive\nLeast RTT\nLeast Session\nHTTP Host\nوتختلف كل طريقة في كيفيتها عن الأخرى ان اتسع المجال طرحناها بوقت لاحق ، ويمكنك الرجوع الى الموضوع كاملاً في FortiGate Handbook كتاب مجاني رسمي يشرح الفايروول كاملاً ومتوفر على \nhttp://docs.fortinet.com/d/fortigate-load-balancing-4\n\nالفورتي جيت سيكون متعاوناً معنا الى حد اقصى عشرة سيرفرات \nكما انه يمكن ادارة الـ State Full Application بالتعاون مع الويندوز سيرفر من خلال اضافة DFS replication والتى ستجعل لك من الابليكيشن على جميع السيرفرات بشكل Sync فإذا قمت بالتعديل في اى سيرفر منهم انتقل ذلك التعديل الى باقي السيرفرات اوتوماتيك \"اكيد انك تحتاج الى ذلك\"\n\nاذا احتجت الى ادارة موضوع الـ Load balance بشكل اعمق واكثر احترافية وتوسع فلن يخدمك الفورتي جيت وسوف تحتاج الى جهاز جديد من فورتي نت يسمى FortiADC application delivery controllers وهو بإختصار advanced server load balancer ومخصص لهذه المهمة وعنده القدرة على رفع اداء الابليكيشن وان شاء الله نتكلم عنه في المستقبل \n\nكل التقدير \nTamer Zein\n\n#ملتقى_الرياض_لعلوم_تكنولوجيا_المعلومات","created_time":"2017-01-09T17:27:19+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1348989931807378","from":{"name":"سامح دعبس","id":"1873036762957490"},"message":":D","caption":null,"description":null,"created_time":"2017-01-09T05:22:21+11:00","total_likes":25,"total_comments":2},{"id":"172338516139198_1349554751750896","from":{"name":"Maysara Elsaudi","id":"1580284012048789"},"message":"لو أنا معايا أندرويد و مربوط بحساب جوجل درايف و جوجل فوتو عليه الصور و الفيديوهات كلها معمولها syncing و الأسماء كمان متسيفه على الجيميل و حبيت أغير لأيفون..\nالحاجات دي هتتنقل ازاي للنظام الجديد اعمل ايه عشان انقلهم!؟","caption":null,"description":null,"created_time":"2017-01-09T22:00:14+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1348828955156809","from":{"name":"Mohamed Moshrif","id":"1235868066468537"},"message":"أنا نشرت البوست ده على الجروب بتاع ال Geeks Jobs بس أنا هنا بنشره لسبب تاني. بما إني مليش جدا في السوق المصري فعايز اسال على كام حاجة كده:\n\n1- إيه أماكن تانية ممكن أنزل فيها طلبات التوظيف اللي الناس عارفة إنها هتشتغل كويس؟!\n2- فيه مصريين كتير أصلا ممكن أي حد فيهم يقرا حاجة بالحجم ده أساسا ولا انزل اعلان عادي أحسن من نوعيه: \"مطلوب مهندس برمجيات يتقن ال Java وال MongoDB\" وكده وبس؟\n3- فيه حد في مصر بيشتغل technical وهو عنده خبره أكتر من 5 سنين؟\n4- بالنسبة للناس اللي شغالة في السوق المصري بقالها كتير, لو حد حابب يعمل حريات في الشغل زي بره (مواعيد عمل مرنه, مفيش تقييد بلاويح كتير, الخ) ده هينفع مع المصريين بشكل عام ولا لأ؟\n5- أي نصايح تانية بشكل عام غير \"بلاش تفتح في مصر\" والسواد ده :)","caption":null,"description":null,"created_time":"2017-01-09T00:59:55+11:00","total_likes":23,"total_comments":14},{"id":"172338516139198_1348939758479062","from":{"name":"Mohamed Sadek","id":"10155214475851614"},"message":"Facebook Computer Vision Tags","caption":"github.com","description":"show-facebook-computer-vision-tags - A very simple Chrome Extension that displays the automated image tags that Facebook has generated for your images","created_time":"2017-01-09T03:54:57+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1349847395054965","from":{"name":"Mohamed Ibrahim Gaber","id":"10155975829509012"},"message":"https://techcrunch.com/2017/01/09/atlassian-acquires-trello/","caption":"social.techcrunch.com","description":"Atlassian today announced that it has acquired project management service Trello for $425 million. The vast majority of the transaction is in cash ($360..","created_time":"2017-01-10T01:46:48+11:00","total_likes":24,"total_comments":1},{"id":"172338516139198_1349317341774637","from":{"name":"Ahmed Aziz","id":"1305943819490269"},"message":"حد هنا ليه تجارب/انطباعات عن OSSU ؟\nhttps://ossu.firebaseapp.com/#/about\nمحتاج آراء حتي لو ملكش تجربة مباشرة كفاية انك عارف الـ topic وعملت عنه سيرش قبل كده ومكون انطباع ورؤية بس يفضل التجارب طبعًا.","caption":"ossu.firebaseapp.com","description":null,"created_time":"2017-01-09T16:23:17+11:00","total_likes":2,"total_comments":2}]}