{"posts":[{"id":"172338516139198_1048571365182571","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":"السلام عليكم\n\nمن فضلكم حد هنا تعامل مع GenericRepository - انا عامل DLL Project لـ Unit Of Work عشان استخدمه فى اى مشروع \n\nلما بكون عامل EF - Database first بيشتغل عادى مفيش اى مشاكل - لكن لما بحاول اشغله بنفس الطريقة على EF Code First  بيدينى الخطأ دى للجدول اللى شغال عليه؟\n\nThe entity type Employee_Data is not part of the model for the current context\n\nمع انى عامل الكونكشن سترنج بنفس الاسم وزى ما وضحت هو شغال على Database first ؟\n\nتتحل ازاى دى يا جماعة ؟","caption":null,"description":null,"created_time":"2015-12-20T21:15:07+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1049141575125550","from":{"name":"Ahmed Saleh","id":"1384434324953403"},"message":"web.ts\nCreate Web Apps the Object Oriented way.\nAn Easier, Faster, and Efficient way to create websites with MVC architecture.\n\nIntroduction\nweb.ts is designed to make web design easier by using Object Oriented programing where is there separation between Views(HTML/CSS) and Controller(.ts classes) in Typescript to create native OO and asynchronous(AJAX) apps. Views are designed using Interactive Web Design softwares such as Visual Studio WebForm Designer and the Controllers are Typescript classes of Page, List, and View.\n\nWeb Developers are facing problems while designing websites. Javascript and HTML/CSS are all mixed together without structure or organization. With web.ts, there is separation between Views and Controllers, also Models to achieve MVC, which is best recommended type of architecture. You will not need to learn any new techniques or languages for as Typescript is merely Javascript with OO added(Future JS), and the library is simple and easy to follow.\n\nObject Classes(Components)\n* For pages, you create a ts class file that extends web.ts.Page. You fetch a and prepare document using view() implement and populate using render() implement. view() is called once for the class and all Subclasses. Process are started after Instantiation. \n\n* For lists, it extends Page class; create a ts class that extends web.ts.List<T>.  You fetch a document from view() implement and populate (add() Implement each item individually), remove() and set(). Process are started after Instantiation(arr:T) if View() is not empty or null, else use list() or set() method.\n\n* For Views, it extends Page class; create a ts class that extends web.ts.View<T>.  You fetch a document from view() implement and populate using apply(item:T, doc:?Document). Every time apply(item:T) is called, it preforms the action. Process are started after Instantiation(item:T) if View() is not empty or null, else use apply() method.\n\n* Use switch(hash) cases of main() method in web.ts to start the process for specific Page or List or View object on a specific hash name so pages are loaded when a Url change is detected and load different pages based on the name of the Hash. links(a element) with \"web\" css class will continue to work even if \"onhashchange\" event isn't supported as pages will reload automatically when this happens. Use Interactive Web Design tool for HTML/CSS such as Visual Studio WebForm design mode to design the view. The View can be an element on the document or a seperate html file document that can be fetched.\n\n-Pages\n1. Implement the view() Method to prepare document and return the location of the view page you would like to show, for example, \"/Page1.txt\".\nYou can also return #element (id of an element) which could be hidden using \"web ts\" class, which returns the outerHTML content removing \" ts\" class of an element in the document page. The view source file can be designed with Interactive HTML Designer softwares such as the free Viusal Studio WebForm design.\nYou can use the view() Method to prepare the document before render(), it will be used once internally.\n\n2. Implement the render(document) method callback which is used to render the content when it's already available.\n\n3. Create instance of this and it starts automatically.\n\n-Lists\n1. Implement the add() and remove() Method to be used in adding or removing items. And implement view() method to return the document that will be used in rendering.\nList class uses load() and render(), in addition to view() of the page extension internally and the methods behave the same as Page class.\n\n2. Create an Instance of and it(arr:T[]). Process are started after Instantiation(item:T) if View() is not empty or null, else use list()/set() method.\n\n-Views\n1. Implement the apply(item:T,doc:?Document) Method to apply the action with item on doc. And implement view() method to return the document that will be used in rendering or not if you want to use the current document as the template.\n\n2. Create an Instance of and it(arr:T[]). Process are started after Instantiation(item:T) if View() is not empty or null, else use apply() method.\n\n[Open Source Project Website Link](https://github.com/medozs/web.ts)\n\n[Gif Tutorial](https://github.com/medozs/web.ts/blob/master/example.gif)","caption":"github.com","description":"web.ts - Create Web Apps the Object Oriented way","created_time":"2015-12-22T02:03:26+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1049532848419756","from":{"name":"AlaBaha Katil","id":"631752380341942"},"message":"لما تكون مبرمج جديد في الشركة وتيجي عند اول عقبة \n\n#باج_بلا_ملامح\np_q","caption":null,"description":null,"created_time":"2015-12-22T19:26:05+11:00","total_likes":12,"total_comments":1},{"id":"172338516139198_1049631791743195","from":{"name":"Fouad Mahmoud","id":"10154919029442324"},"message":"Any help please with the best ORM to use with MVC or the EF is enough and best for it? From maintability and performance point of view ?","caption":null,"description":null,"created_time":"2015-12-23T00:40:07+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1049243531782021","from":{"name":"Ahmed Zain Mohammed","id":"10155252594718081"},"message":"Any help with this ? Thanks in advance :)","caption":"stackoverflow.com","description":"For sometime now I've been trying to do something that I never thought that it would be that hard: audio streaming. My objective is simple; a simple web app through which a certain someone can clic...","created_time":"2015-12-22T06:10:46+11:00","total_likes":2,"total_comments":5},{"id":"172338516139198_1049748521731522","from":{"name":"Ahmed Nabil","id":"390883967942160"},"message":"Easily generate your mobile app assets","caption":"assets.codly.io","description":null,"created_time":"2015-12-23T05:37:42+11:00","total_likes":5,"total_comments":1},{"id":"172338516139198_1050055418367499","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"https://remysharp.com/2015/12/14/my-node-test-strategy","caption":"remysharp.com","description":"My node test strategy","created_time":"2015-12-23T17:39:43+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1049004851805889","from":{"name":"Ahmed Ragab","id":"1287772667983866"},"message":"مقال جديد حول مبادئ وفلسفيات التصميم، أتمنى أن ينال إعجباكم :)","caption":"fwasl.com","description":"للوهلة الأولى التي تسمع فيها كلمة “تصميم Design” ربما سيخطر ببالك التصميم الجديد للأيفون ذو الحجم الأكبر بعض الشئ عن الإصدار السابق، أو شعار أحد الشركات الشهيرة، وربما أحد الملصقات والإعلانات الخارجية (Outdoors). أو الأشياء الثابتة الأكثر تقليدية من الأشياء السابقة، ربما هذا يعد تصميمًا، ولكن هذا لي…","created_time":"2015-12-21T18:50:53+11:00","total_likes":4,"total_comments":1},{"id":"172338516139198_1049008341805540","from":{"name":"Mohammed Morsi","id":"10212986144227875"},"message":"Statistics concept for fitness app ... check it out on dribbble ","caption":"dribbble.com","description":"Fitness app statistics concept PRESS L for some love & spread the joy :) Twitter · Instagram · Behance · Website","created_time":"2015-12-21T19:03:46+11:00","total_likes":2,"total_comments":3},{"id":"172338516139198_1049816721724702","from":{"name":"Omar Attia","id":"1855607434683322"},"message":"مساء الخير،\n\n يا ريت حد يقدر يساعدني في الكام سؤال دول :D \n\nعندي data متقسمة بين 3 tables كل واحد فيهم حوالي 400,000 entries.\nعايز أعمللهم join عشان أطلع بجدول واحد فيه كل حاجة أنا محتاجها عشان يسهل لي شغل كتير بعد كده.\nكتبت الـ query بأكتر طريقة naive تقريبا باعتبار إني عامل indexes على الـ joining attributes و كده.\n\nالـ machine عندي عادية مش server يعني (Core i7, 8GB RAM) و شغال MariaDB.\n\nالأسئلة هي:\n\n- هل 400,000 و 3 tables تعتبر كتير؟\nبمعنى آخر، هل هأقدر أشوف نتيجة الـ query ده قبل ما أموت؟ :D\n\n- هل في طريقة ممكن أقدر الوقت اللي query زي ده ممكن يشتغل فيه؟\n\n- بشكل أعم، هل في طريقة ممكن أسرع query بالمواصفات دي؟","caption":null,"description":null,"created_time":"2015-12-23T09:09:46+11:00","total_likes":1,"total_comments":11}]}