{"posts":[{"id":"172338516139198_528488737190839","from":{"name":"Chintan Pala","id":"1740325205985075"},"message":"Join FREE Webinar xRM: The Future of CRM\n\nOrganizations are realizing that to be effective at CRM, they have to be effective at xRM or Extended Relationship Management, also known as Any Relationship Management. And Microsoft Dynamics CRM is the engine for delivering xRM. \n\nRegister Now:\n\nFeb 12, 2013 2:00 PM EET http://bit.ly/XU6hJp\n\nFeb 12, 2013 1:00 PM EST http://bit.ly/XU6yvQ\n\nFeb 13, 2013 3:00 PM AEDT http://bit.ly/XL9iec","caption":null,"description":null,"created_time":"2013-02-11T20:01:00+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_528598510513195","from":{"name":"Noha Basiony","id":"10156006754279478"},"message":"(Windows 8 / Windows Phone 8 / WPF / Silverlight ) XAML Developer  \n \nJob description\n• Work with Visual Designers to implement elegant interactive solutions to complex interaction problems with polished XAML code.\n• Transform prototypes into fully functional new interactions and animations using XAML and WPF.\n• Design and develop new XAML components utilizing Microsoft Blend.\n• Analyze current codebase to make recommendations for WPF and Silverlight compatibility while utilizing a strong best practices approach\nRequirements\n• Experience with web technologies (XAML, HTML, CSS, etc.).\n• Basic understanding of the MVVM framework and MEF.\n• Exposure to C# development using technologies including: C#, .NET 1.1-4.0, Web Services, etc.\n• Good understanding of layout and basic user interface design principles.\n• Preferred experience with Microsoft Expression Blend or a similar design tool\n• Portfolio showcasing a track record of creating strong XAML/WPF interactive solutions.\n\nIf this sounds like something you could do, please apply to join our NUITEX team!\n\nJust send us email along with your resume and current/expected salary to : jobs@nuitex.com \n(NOTE: Please write 'XMLDEV'  in email subject)","caption":null,"description":null,"created_time":"2013-02-12T02:52:36+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_528748563831523","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"noupe.com","description":"Today we would like to show you 50 free Photoshop business card templates to help you design your perfect business card.","created_time":"2013-02-12T10:11:17+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_528650450508001","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":":D","caption":null,"description":null,"created_time":"2013-02-12T05:21:04+11:00","total_likes":5,"total_comments":1},{"id":"172338516139198_524909760882070","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"i'm a back end developer and don't have much experience with front end development, can any one tell me which tool can help me designing a good html pages using html5, css, jquery\nNote: i know all of these technologies well but i'd prefer a tool to automate and facilitate the design experience","caption":null,"description":null,"created_time":"2013-02-04T01:50:03+11:00","total_likes":0,"total_comments":14},{"id":"172338516139198_529103543796025","from":{"name":"Ramy Said","id":"10155924142787586"},"message":"Specification of Ubiquiti UniFi Access Point Enterprise WiFi System Long Range\nUniFi AP-Long Range (UAP-LR) Features.\nLarger Range up to 600 ft. It also offers 802.11n MIMO, with speeds of up to 300 Mbps.\nPower over Ethernet (PoE) functionality, which allows both power and data to be carried over a single Ethernet cable to the device.\nIntuitive UniFi Controller Software Install, configure, and manage all of your UniFi AP devices with the intuitive and easy-to-learn UniFi Controller user interface (no special training needed).\nExpandable Unlimited scalability. Build wireless networks as small or big as needed. Start with one and expand to thousands while maintaining a single unified management system.\nSave money and save time Unlike traditional enterprise WiFi systems utilizing a hardware WiFi switch, UniFi uses a  virtual client/server application that requires zero cost and no additional hardware.","caption":"egypt.souq.com","description":"http://egypt.souq.com/eg-en/unifi-4960553/i/","created_time":"2013-02-13T05:12:55+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_529122200460826","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"hongkiat.com","description":"There are many cloud storage services out there, one of which is Google Drive. We’ve pitted it against Dropbox and SkyDrive, another two crowd favorites and each cloud storage service have their strengths and limitations that would cater to a wide range of customer needs. But if you have decided ......","created_time":"2013-02-13T06:09:06+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_529198023786577","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"http://css-tricks.com/how-do-you-structure-javascript-the-module-pattern-edition/","caption":"css-tricks.com","description":"JavaScript is interesting in that it enforces no particular structure upon you. \"Bring Your Own Organization\", if you will. As I write more and more JavaSc","created_time":"2013-02-13T10:29:06+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_529417877097925","from":{"name":"Mahmoud Ibrahim","id":"10154874374735831"},"message":null,"caption":"quora.com","description":"Michael Wolfe's answer: Let's take a hike on the coast from San Francisco to Los Angeles to visit our friends in Newport Beach. I'll whip out my map and draw our route down the coast:   The line is about 400 miles long; we can walk 4 miles per hour for 10 hours per day, so we'll be there in 10 da...","created_time":"2013-02-14T00:25:09+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_529468400426206","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"http://net.tutsplus.com/articles/general/contracts-the-practical-side-of-semantics/","caption":"net.tutsplus.com","description":"We all know that we should be writing semantic code. Maybe, you're even using <section> or <em> correctly, and feel pretty good about it. But, are","created_time":"2013-02-14T03:11:16+11:00","total_likes":0,"total_comments":0}]}