{"posts":[{"id":"172338516139198_975991482440560","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":"ناس كتير هتـrelate للكلام المكتوب في البوست ده او اللي في الـthread اللي بدأ الكلام بيه","caption":"joequery.me","description":"The self-hating Web Developer Hi, I'm Joe! I'm a web developer primarily specializing in Python/Django. I frequent /r/learnprogramming to help answer both technical and career oriented questions about programming. It's an extremely gratifying use of time. Today I came across a thread where the OP de…","created_time":"2015-07-21T23:39:14+10:00","total_likes":12,"total_comments":3},{"id":"172338516139198_976300625742979","from":{"name":"Ahmed Adel","id":"10155949666619129"},"message":"Organizational Chart!","caption":null,"description":null,"created_time":"2015-07-22T09:04:02+10:00","total_likes":25,"total_comments":0},{"id":"172338516139198_976331222406586","from":{"name":"Ahmed Syam","id":"10212751928298930"},"message":"الزتون الجديد :D\n\nتابعونا علي :\nhttps://www.facebook.com/Ahmedsyam.official\nhttps://www.youtube.com/softmasr\n\n#مشن صاحبك المهتم\n#شير و كون سبب في وصول العلم للناس\n#اسأل لو عندك مشكلة\n#ساهم برأيك لتحسن الدروس","caption":null,"description":"الزتون الجديد :D\n\nازاي ممكن تعمل Update لحاجة من خلال لوحة التحكم ؟\n\n--------------------------------------------------\nالدرس 25 :\nhttps://youtu.be/QCkV3J3O6Gc\nده بيشرح الموضوع بشكل نظري\n--------------------------------------------------\nالدرس 26 :\nhttps://youtu.be/RqhwU_m3XTQ\nده بيشرح الموضوع من ناحية الكود\n\n--------------------------------------------------\nالدرس 27 :\nhttps://youtu.be/oulKfaYqKM0\nوده تكملة للدرس اللي فات\n\n--------------------------------------------------\n\nلمتابعة الدروس كلها :\nhttps://goo.gl/NmRD8e\n\n--------------------- (مش عارف يعني ايه زتونة؟) --------------\n\nده بوست هيفهمك يعني ايه زتونة\n\nhttps://www.facebook.com/Ahmedsyam.official/photos/a.281964532014800.1073741828.185094818368439/377043029173616/?type=1\n------------------------------------------------\nخليك ايجابي \n#مشن صاحبك المهتم\n#شير و كون سبب في وصول العلم للناس\n#اسأل لو عندك مشكلة\n#ساهم برأيك لتحسن الدروس\n\n#Zatona #الزتونة #php #ahmedsyam Ahmed Syam","created_time":"2015-07-22T09:40:17+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_975880949118280","from":{"name":"Ahmed Al-Amir","id":"10155179919799180"},"message":"Corporates will be corporates after all. It is foolish to think of a profit seeking entity as the good guys, something I was guilty of at some point.","caption":"wired.com","description":"Former Google employee Erica Joy gave a tweet-by-tweet replay of exactly what happened when she tried.","created_time":"2015-07-21T19:50:32+10:00","total_likes":10,"total_comments":13},{"id":"172338516139198_975901175782924","from":{"name":"Alaa M. Abdel-Aziz","id":"10158418639040464"},"message":"Good Afternoon guys,\n\nI was asked to buy a good router for the company I'm working at, it's an advertising agency. I did some research generally speaking to choose what's best for the agency.\nI saw a number of models but I don't know exactly which fits best. (I am limited to maximum 1.5-2K budget)\nI need something with a good range which also accepts a good number of devices because the one we have here is limited to a certain number of devices.\n\nI was thinking about one of those:\nhttps://compume.com.eg/en/linksys/linksys-ea6200-ek-ac900-smart-wifi-router-colinea6200-ek\n\nhttps://compume.com.eg/en/linksys-x3500-wireless-n-concurrent-dual-band-gigabit-modem-colinx3500-m2\n\nWhat do you guys recommend?\n\nThanks :)","caption":"compume.com.eg","description":"Shop online Linksys EA6200-EK AC900 SMART WIFI ROUTER from CompuMe, read full specification, different payment methods online payment , cash on delivery , installment, win reward points.","created_time":"2015-07-21T21:02:40+10:00","total_likes":0,"total_comments":4},{"id":"172338516139198_976581169048258","from":{"name":"Mohammad Tayseer","id":"10154965677956341"},"message":"Geek fun :)","caption":"youtube.com","description":"Michael Littman and Charles Isbell feat Infinite Harmony ML4LIFE by Udacity Records Check out the Machine Learning course at http://www.udacity.com/course/ud675","created_time":"2015-07-22T20:36:30+10:00","total_likes":5,"total_comments":0},{"id":"172338516139198_976140019092373","from":{"name":"Ibrahem Saad","id":"1267357859968206"},"message":"لو سمحتو ياجماعة فى حد قدامه فرصة ORACLE DEVELOPER فى أى شركة للعمل بدون خبرة او تدريب","caption":null,"description":null,"created_time":"2015-07-22T03:44:19+10:00","total_likes":0,"total_comments":5},{"id":"172338516139198_976727315700310","from":{"name":"Mahmoud Abou-Eita","id":"10154526340245735"},"message":"A question to Android developers using Robolectric: Did anyone face this issue and found a solution for it? Or rather had a direct successful trial that involves AppCompatActivity/ActionBarActivity? ","caption":"github.com","description":"When i using robolectric testing ActionBarActivity from support v7 package, it always gives the following error. java.lang.IllegalStateException: You need to use a Theme.AppCompat theme (or descen...","created_time":"2015-07-23T00:47:35+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_976727505700291","from":{"name":"Hany Essam","id":"1342489319142943"},"message":"هو فيه فرق بين ال System analyst و ال business analyst\nو how to pursue a career as one of those ?\ni have a fair experience in Sales(Client Facing) and Programming.\nThanks in advance\nبردو if a presales role might be a good fit !?","caption":null,"description":null,"created_time":"2015-07-23T00:48:38+10:00","total_likes":1,"total_comments":3},{"id":"172338516139198_976378222401886","from":{"name":"Sameh Saeed","id":"10154266644607344"},"message":null,"caption":null,"description":"بعد أكثر من عام من النسخ التجريبية وتوقعات صدور النسخة النهائية، أصدرت Microsoft اليوم النسخة النهائية من Visual Studio IDE بالتزامن مع إطلاق تحديث لبيئة .NET.\n\nويمكنكم الاّن تحميل أو شراء النسخة الأخيرة عبر الموقع الرسمي من خلال الرابط التالي:\nhttp://www.syr-res.com/?1bb0\n\nولكن Team Foundation Server 2015 إحدى خدمات Microsoft للمطورين لن تكون متوفرة حتى الشهر القادم.\n\nوبحسب تصريحات Microsoft اليوم، فقد قامت الشركة بطرح العديد من الأدوات للتحميل، مثل نسخة Visual Studio Community المجانية والمحسنة للبرنامج الخاص بالأفراد، والتي تم تحميلها أكثر من 5 ملايين مرة اعتباراً من تاريخ إطلاقها منذ 7 شهور. كما قام أكثر من 3.2 مليون مطور بالتسجيل على خدمة Visual Studio Online.\n\nأما Visual Studio Code المحرر المستقل الخاص بالأكواد لكل من أنظمة Windows، وMac، وLinix فقد شهد أكثر من نصف مليون عملية تحميل اعتباراً من تاريخ إطلاقه منذ 3 شهور، علماً أن أكثر من نصف هذه التحميلات جاءت من قبل مستخدمي أنظمة Mac وLinux.\n\nوصرح \"Soma\" نائب رئيس قسم التطوير في شركة Microsoft أن هدف الشركة من النسخة الجديدة هو الإيفاء بالوعود المعطاة من ِقبل الشركة لجعل Visual Studio قابلاً للاستخدام على جميع منصات التشغيل الشعبية، وذلك بقوله: \"عندما تفكر في Visual Studio فإن الموضوع الأهم هو أنه قابل للاستخدام على مختلف الحواسيب ومختلف أنظمة التشغيل \"، وهو ما يعرف باسم Cross-platform، ويصيف: \"المطورون كانوا يطالبون بهذه الميزة وقد قدمناها لهم\".\n\nللقيام بهذا قام فريق Visual Studio بمحاكاة عمل Apache Cordova مثلاً، وذلك كي يتمكن المطورون من كتابة تطبيقات iOS وAndroid باستخدام كل من لغات HTML، وCSS، وJava Script. ويمكنهم أيضاً استخدام مهاراتهم في C++ لبناء مكونات مشتركة بين كل من iOS وAndroid وتطبيقات Windows.\n\nوبفضل شراكة Microsoft مع Xamarin، أصبح بإمكان المطورين أيضاً توجيه تطبيقاتهم المبرمجة باستخدام .NET نحو كل من iOS وAndroid. كما أن Visual Studio أصبح يتضمن محاكياً مضمناً به لنظام Android.\n\nإضافة إلى تعدد منصات التشغيل، فإن VS سيدعم كل من لغتي C# 6 وVB.NET 12، إضافة إلى تحسّن كبير في دعم لغات C++ وTypeScript وPython ، كما أن بعض الميزات الجديدة مثل Light Bulbs التي تعمل على تنبيه المطورين بالحلول المحتملة لأكوادهم بكل من لغتي C# و Visual Basic رأت النور بفضل مشروع Roslyn project مفتوح المصدر العام الماضي.\n\nوقد أكد Soma أيضاً أن المطورين أصبحوا يستطيعون استخدام مخدمات Windows وLinux كسحابات تخزينية لهم.\n\nيتضمن VS 2015 أيضاً العديد من أدوات التصحيح Debugging والتشخيص الجديدة والتي تم جمعها في أداة واحدة. إضافةً إلى العديد من التغيرات الكبيرة والصغيرة على حد سواء في النسخة الجديدة. علماً أن Microsoft قد قللت عدد الإصدارات من 3 إلى 2 هما Enterprise وPro، إضافة إلى إصدار Free Community Edition. كما أنها ستقدم نسخة مستقلة عديمة الاشتراك من VS Pro بسعر $499 فقط. \n\nأشار Soma أيضاً إلى أن ردة الفعل تجاه تغير هذه الأسعار كان إيجابياً بشكل عام خاصة بين مستخدمي نسخة VS Enterprise. كما قامت Microsoft، كجزء من فعالية اليوم، بالتعاون مع Humanitarian Toolbox لكتابة برنامج هدفه إفادة المجتمعات بعد حدوث الكوارث، وسيكون البرنامج متوفراً كمشروع مفتوح المصدر على GitHub اعتباراً من اليوم.\n\n====\n\nالمصدر: http://www.syr-res.com/?1bb1\nالترجمة: أسامة البغدادي\nالتدقيق: رشا سريو\nالصورة: أحمد صوفي","created_time":"2015-07-22T12:31:47+10:00","total_likes":7,"total_comments":5}]}