{"posts":[{"id":"172338516139198_737214349651609","from":{"name":"Hady Ahmed","id":"10210684524123349"},"message":"An interesting discussion on HN is taking place over HipChat's new terms of service. The argument is around account owners (namely company management) gaining access to private 1-on-1 chats. Some argue against it [0], some argue for it [1][2].\nBoth of which are making very compelling cases, the policy is standard in almost all communication policies in corporate environments, likely the most common reason for the lack of such policy in startups is the legal overhead to produce, maintain and enforce one (despite what an entrepreneur might actually say, making a case that we're a startup and we do things differently)\n\nhttps://news.ycombinator.com/item?id=7649524\n\n[0] https://news.ycombinator.com/item?id=7650163\n[1] https://news.ycombinator.com/item?id=7650457\n[2] https://news.ycombinator.com/item?id=7650514\n\ncc: Mohamed Meligy you guys use HipChat too, right?","caption":"news.ycombinator.com","description":null,"created_time":"2014-04-27T02:10:32+10:00","total_likes":0,"total_comments":3},{"id":"172338516139198_737302939642750","from":{"name":"Hossam Elkady","id":"10155054571642440"},"message":"(Hiring)\njob Title: senior php developer (Team Leader)\nneed: 1 developer \nLocation: online\nWorking Hours: 8 hours\nDays Off: Friday\nQualifications:\n- practical experience in PHP development for large-scale, web-based applications using PHP Frameworks especially with codeigniter Framework.\n- Solid grounding in the fundamentals of Object-Oriented Design and design patterns.\n- Front-end skills with experience in HTML, CSS, JavaScript, jQuery, AJAX and XML.\n- Extensive knowledge of SQL databases - MySql is required.\n- experience more than 3 years.\nCVs to be sent to : php-hossam@tl4s.com (please write \"senior PHP developer\" in mail subject)","caption":null,"description":null,"created_time":"2014-04-27T05:35:01+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_737312672975110","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"Juniors/seniors. please read this article.\n------------------------------------------------------------------------\nTeach Yourself Programming in Ten Years\nhttp://norvig.com/21-days.html\n\nالمقال مترجم للعربيه: http://myahya.org/writing/21-days/","caption":"norvig.com","description":"The conclusion is that either people are in a big rush to learn about computers, or that computers are somehow fabulously easier to learn than anything else. There are no books on how to learn Beethoven, or Quantum Physics, or even Dog Grooming in a few days. Felleisen et al. give a nod to this tren…","created_time":"2014-04-27T06:00:12+10:00","total_likes":6,"total_comments":0},{"id":"172338516139198_736415513064826","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"guys i've an idea about a new activity in our group.\n\nafter this post https://www.facebook.com/groups/egyptian.geeks/734993243207053/\n\ni liked that debate between us. so why don't we have something like debates. for example PHP vs Ruby. and get the experts from both side to start the debate. i'll help the group members enhancing their skills. whta do you think guys?!","caption":null,"description":"so guys do you've an idea which is better: ajax long polling or using web sockets when implementing a notification system?! \n\nif we're talking about a server with good infrastructure does it matter to migrate from ajax to websockets?! \ndoes it has a problem with big data apps?! \ndoes it has an effect on mobile browsers?! \nim a little bit confused that facebook is doing ajax!","created_time":"2014-04-25T09:40:19+10:00","total_likes":3,"total_comments":9},{"id":"172338516139198_737625282943849","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"another one :)\n","caption":"thejuniordeveloper.blogspot.com","description":"I find this interesting. As a junior developer, I am by no means attached to my code. In fact, I'm begging for someone to teach me to do it right, but for some reason all I end up receiving is a bunch of senior devs that enjoy grilling the crap out of me and I absolutely hate it. I am seriously reth…","created_time":"2014-04-27T21:11:35+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_737599982946379","from":{"name":"Ahmed Magdy","id":"10154728972235376"},"message":"Chrome DevTools Features You May Have Missed Tutorial \nhttp://ow.ly/wcKim  \n#chrome #devtools #javascript #js #devville","caption":"code.tutsplus.com","description":"With the recent updates to Chrome DevTools, let's take a look at a few of the newer features which you can use to help debug and improve your web...","created_time":"2014-04-27T20:11:45+10:00","total_likes":7,"total_comments":3},{"id":"172338516139198_737602812946096","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"another excellent read.","caption":"ahmetalpbalkan.com","description":"Two years ago today, I started Microsoft Windows Azure as an intern, in the very same team I joined right after college and I am working for last 8 months.I decided to summarize a few points I learned so far in this job during last 8 months. This may sound like the way things work are crappy, it is…","created_time":"2014-04-27T20:19:36+10:00","total_likes":4,"total_comments":5},{"id":"172338516139198_737786306261080","from":{"name":"Shady Zaky","id":"1856382157974336"},"message":"Check #Dashsoft tips to be a #Successful_Software_Developer.","caption":null,"description":"A pack of tips by #Dashsoft on how to be a #Successful_Software_Developer","created_time":"2014-04-28T03:27:00+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_737815592924818","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Handlebars helpers now comes in Rails Flavor. My plan is to create a set of handlebars helpers that works very closely as Rails AssetTagHelper. If you start extending it please make a pull request after you finish. every single helper will have the credit of it's owner :)","caption":"github.com","description":"handlebars-helpers - Handlebars Helpers with Rails Flavor","created_time":"2014-04-28T04:37:19+10:00","total_likes":4,"total_comments":1},{"id":"172338516139198_737877732918604","from":{"name":"Samir Aly","id":"1537611492946333"},"message":null,"caption":"Take Your Innovation To The Market!","description":"GESR business incubator first networking event\nhttp://gesr.net/en/take-your-innovation-market\n\nThrough years, the word “Innovation” could not be uniformly defined. Yet, one of the most accurate definitions of “Innovation” is: an original idea that has value. As the value of an idea can only be measured by the acceptance of the community and by its impact, we find it mandatory that Innovations should belong to the market, where it can be tested and its true value and impact can be measured. For that purpose, “Take your Innovation to the Market” event was created.\n\nTake your Innovation to the Market, is an event organized by GESR with the aim of bringing together the innovators form all disciplines, and from both business and academia, to come together and to use the power and the value of innovation as a way to solve Egypt social challenges.\n\nDetails & Registration: http://gesr.net/en/take-your-innovation-market","created_time":"2014-04-28T07:18:46+10:00","total_likes":0,"total_comments":0}]}