{"posts":[{"id":"172338516139198_1217306054975767","from":{"name":"Ahmed Sabry","id":"1454381204603437"},"message":"كنت عايز استخدم ال jwt في ال authentication وبنائاً عليه هحتاج احفظ ال access-token لأما في Cookie ﻷما في sessionStorage/localStorage\nلو استخدمت ال cookie هكون محتاج اني احمي نفسي كويس من هجوم ال CSRF ، واقدر استفاد من ال http-only في اني احمي الكوكيز من ال XSS\nولو استخدمت ال localStorage هاخلص من مشكلة ال CSRF بس هيكون عندي مشكلة اني احمي ال localStorage من ال XSS\n\nانا مستحسن موضوع ال localStorage ﻷني عايز ابعد عن استخدام ال cookies عشان ال Site بيتعامل مع تطبيق موبايل او Cross-Origin Application\nلما جيت افكر ازاي ممكن ال Attacker هيستغل ال XSS ، لاقيت انه في الغالب بيقوم مأكسس على ال localStorage varible، فانا جاتلي فكرة اني الغي الوصول لل localStorage واربط ال refernce بتاعه بأي متغير تاني داخل Anonymous scope مثلاً او حاجة زي كدا\nhttps://gist.github.com/abou7mied/f6685ba76a6615906dbceb644af8f358\nممكن الفكرة تكون ساذجة نوعاً ما بس هيا فعلاً بتأدي الغرض :D \n\nايه رأيكم في الفكرة دي وهل ال Attacker يقدر يأكسس ال localStorage بأي طريقة تانية ، او لو حد عنده فكرة تانية ؟","caption":"gist.github.com","description":null,"created_time":"2016-08-29T16:54:35+10:00","total_likes":4,"total_comments":1},{"id":"172338516139198_1217726381600401","from":{"name":"Ahmed Zain Mohammed","id":"10155252594718081"},"message":"How cool is that!","caption":null,"description":"Now that looks interesting. Blisk is a browser designed for front-end developers. Worth checking out. https://blisk.io","created_time":"2016-08-30T04:36:11+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1217777758261930","from":{"name":"Amir Abou Eesa","id":"1353018234756623"},"message":"Using accelerometer in the app that keeps running in background for 16 hrs per day to measure distance moved regardless of position or anything else , is it possible ?, what is the best practices to do it ?","caption":null,"description":null,"created_time":"2016-08-30T06:07:40+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1217800011593038","from":{"name":"Bassam Abd Elhamid","id":"1811475205784288"},"message":"طيب للى لسه ميعرفوش, ممكن للمصريين تحميل اى حاجه من اصدارات springer\n\nياريت تشاركونا لو وجدتو اى شئ Geeky\n\nhttp://springer.com/\nعيشو حياتكو","caption":"springer.com","description":"Our business is publishing. With more than 2,900 journals and 200,000 books, Springer offers many opportunities for authors, customers and partners.","created_time":"2016-08-30T06:44:52+10:00","total_likes":5,"total_comments":2},{"id":"172338516139198_1217871621585877","from":{"name":"Mosab Ibrahim","id":"10154868571206047"},"message":"The result they reached is impressive. What is more impressive though is how they reached it. The last few paragraphs are way more important than the graphs and decision made.","caption":"eng.uber.com","description":"Uber Engineering’s comprehensive encoding protocol and compression algorithm test, and how this discipline saved space in our Schemaless datastores.","created_time":"2016-08-30T08:48:38+10:00","total_likes":8,"total_comments":2},{"id":"172338516139198_1217646521608387","from":{"name":"Abdel-Rahman Aref","id":"10154635214496713"},"message":"السلام عليكم.. انا لسه داخل مجال البرمجه جديد الاندرويد تحديدا اتعلمت جافا ديسكتوب وداتا بيز وويب جافا  واتعلمت اندرويد وعايز اشتغل فيه بس عايز منكم استشارة لتوضيح الطريق\n\nالاولي هي: -------- انا حاسس اني لو بقيت مبرمج اندرويد فانا هكون حد عادي في مني كتير - وانا عايز اكون متميز فالمجال اللي انا فيه وفي الماشين ليرننج علي سببيل المثال - حفزتني وخلتني ارجع افكر في فكرة كانت في بالي: هو انا ممكن اكون مبرمج اندرويد بس مش كل اللي بيعمله هو تطبيقات تقليدية علي البلاي ستور ولكن بيعمل حاجه ليها قيمه ومتميزة معرفش شكلها ممكن يكون ايه هل مثلا IOT or Augmented Reality, Virtual Reality or NLP applications... ولا في حجات ممكن اتعلمها تخليني حد متميز ينافس الناس اللي بره مصر استخدام الماشين ليرننج في الاندرويد ممكن يبقه شكله ازاي وهيوديني فين في مصر او بره مصر...\n--------------------------\n\n سؤالي التاني: ----------- لو حابب اتعلم ماشين ليرننج.. اسمع  ان عالاقل يكون معاك ماجستير فهل لو روحت قدمت في مكان زي مركز البحوث - بما انه في اسكندرية وانا من اسكندرية - علي الدبلومة هناك وبعدها اخدت ماجستير فالماشين ليرننج هل ده هيكون طريق صح ولا حد ممكن ينصحني بحاجه تانيه بما اني لسه في اول الطريق؟ \nشكرا ليكم مقدماً","caption":null,"description":null,"created_time":"2016-08-30T02:41:16+10:00","total_likes":4,"total_comments":7},{"id":"172338516139198_1217290898310616","from":{"name":"Mohamed Nady","id":"10154387282503733"},"message":"Hangfire – Open and free for commercial use, Background jobs and workers for .NET http://hangfire.io/ ,\nSolution for long running/scheduled background .NET jobs ,Hangfire is a framework that can be used to reliably create, process, and manage asynchronous .NET background jobs.","caption":"hangfire.io","description":"An easy way to perform fire-and-forget, delayed and recurring tasks in ASP.NET applications. No Windows Service required, backed by persistent storage.","created_time":"2016-08-29T16:24:45+10:00","total_likes":11,"total_comments":7},{"id":"172338516139198_1217782444928128","from":{"name":"Jean Assem","id":"1312583058801749"},"message":"ارجو المساعدة بشكل مبسط ، اذا تم اكتشاف سرقة التصميم الخاص بالموقع الالكترونى لشركة وهذ التصميم خاص بالشركة منذ اكثر من 4 سنوات ، تم اكتشاف انه تم تقليدة تماما من قبل شركة مبتدئه منذ ايام قليلة\nماذا يمكن عملة ؟ ؟ هل يمكن اغلاق الموقع المقلد من على الانترنت تماما؟\nارجو المساعدة من خبراء البرمجة","caption":null,"description":null,"created_time":"2016-08-30T06:17:16+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1216811651691874","from":{"name":"Seif Abaza","id":"10158282498465398"},"message":"هوه في سوق لبيع البرامج الخاصه بتاعت المرمجين اونلاين في مصر ولا لا ؟؟","caption":null,"description":null,"created_time":"2016-08-29T02:25:36+10:00","total_likes":4,"total_comments":8},{"id":"172338516139198_1218184171554622","from":{"name":"Hosam G. Zewain","id":"10212617052122854"},"message":"السلام عليكم ورحمة الله وبركاته\nسوآل بالنسبة للناس الي كان عندهم مشاكل في الاتصال بال SSH هل لسه المشكله مستمره ف مصر ولا حد لقي حل؟\nوالمواقع الي عليها SSL بيكون فيها مشكله او مقفوله ولا حاجه ولا شغاله بدون مشاكل؟\nشكرا","caption":null,"description":null,"created_time":"2016-08-30T18:20:00+10:00","total_likes":2,"total_comments":5}]}