{"posts":[{"id":"172338516139198_675044309201947","from":{"name":"Heba PiTechologies","id":"1942193909350528"},"message":"Do you know the companies work in embedded system in Egypt ?\nyou applied for a job in (axxcelera, IBM, Intel , Valeo , Newport Media , NMI , Mentor Graphics , ...)\nbut you are refused !\nHow to respond to a refusal after interview ??\n...\nJoi...See More\nAre you a fresh Graduate ?\ndo you know that there are many job vacancies in embedded systems engineering in Egypt !\nAs in IBM, Intel , Valeo , Axxcelera, Newport Media , NMI , Mentor Graphics , ... etc\n\nbut are you qualified for this opportunity ??\n\nJoin us in our next round to be qualified to work in embedded system market in Egypt.\n\npick your seat before next Thursday 26/12\nregister now at http://foe.pitechnologies.net/\nand get 10% off\nor call us : 01017473777\n\nknow about the content of the course\nhttp://foe.pitechnologies.net/courses.php?id=20\n\nYou can see ESD Smart Kit here :\nhttp://www.youtube.com/watch?v=XpBEsh6lChs","caption":null,"description":null,"created_time":"2013-12-25T23:02:43+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_674372172602494","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"http://hubot.github.com/","caption":"hubot.github.com","description":"GitHub, Inc., wrote the first version of Hubot to automate our company chat room. Hubot knew how to deploy the site, automate a lot of tasks, and be a source of fun in the company. Eventually he grew to become a formidable force in GitHub. But he led a private, messy life. So we rewrote him.","created_time":"2013-12-24T11:31:06+11:00","total_likes":0,"total_comments":2},{"id":"172338516139198_674820922557619","from":{"name":"Tarek Amr","id":"10154871355735944"},"message":"What happens when non-techie people discover web developer tools","caption":null,"description":null,"created_time":"2013-12-25T10:25:08+11:00","total_likes":18,"total_comments":2},{"id":"172338516139198_675434622496249","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"plus.google.com","description":"MadJS: Lessons learned building a webapp with +Yeoman, +AngularJS and +node.js 1) Building a Web App with Yeoman, AngularJS and Node.js - Part 1 of 2 2)…","created_time":"2013-12-26T17:33:11+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_675477615825283","from":{"name":"Meligy","id":"10154884040385170"},"message":"جامد البتاع ده، ممكن يبقى له لازمة","caption":"filltext.com","description":"Generate JSON datasets for testing or demonstration purposes","created_time":"2013-12-26T19:03:54+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_674932422546469","from":{"name":"Mahmoud Mahdy","id":"1948505975380764"},"message":"i have web app that make request to data base each 5 seconds to get the last updated data from DB i am using AJAX request with interval each 5 seconds  ,  if there is  another way to make this   ?","caption":null,"description":null,"created_time":"2013-12-25T16:36:58+11:00","total_likes":0,"total_comments":6},{"id":"172338516139198_675515582488153","from":{"name":"Mohamed M. El-Zalabany","id":"10158212414740276"},"message":"Jodod Technology Labs is looking for a skilled development team lead in Mansoura, Egypt. They will lead a highly competent team and will be responsible of delivering high quality software and meeting hard deadlines. They will also be responsible of critical technical decisions, maintaining the team harmony and skills diversity and orchestrating daily work between different team members. Jodod Technology Labs uses open source software and follows an agile development approach.\n--\nRequirements:\n--\n----Highly skilled with strong experience in one or more of the following languages: Python, Ruby or Java.\n----Strong experience in web technologies and frameworks such as Django, Ruby on Rails, J2EE, GWT, ...etc.\n----Strong experience of the Linux/Unix operating systems.\n----Strong experience in developing over Linux/Unix operating systems.\n----Strong knowledge in object oriented analysis and design.\n----Familiar with agile methodologies, test driven development and SCRUM.\n----Well disciplined with strong communication skills and a fast learner who can adapt to a rapidly changing environment.\n--\nCandidates can send their resume to jobs@jodod.com with the subject of \"Team Lead\".","caption":null,"description":null,"created_time":"2013-12-26T21:40:41+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_675607175812327","from":{"name":"Ahmed Raslan","id":"10158381834070029"},"message":"Technical project manager required for web and mobile apps.","caption":null,"description":"We are hiring a Technical Project Manager.\r\n\r\n-> Responsibilities:\r\n\r\n•\tAssign resources to projects while monitoring and tracking the progress for individual project engagements.\r\n•\tParticipate in the creation of user acceptance criteria.\r\n•\tManage and update task objectives and performance while helping to ensure that project commitments are met as specified in the client contract.\r\n•\tManage project budget to revenue, and costs.\r\n•\tDevelop new business within projects and identify new business elsewhere in the client environment.\r\n•\tAssist with preparation of the statement of work as well the delivery of the quality assurance review.\r\n\r\n-> Desired Skills, Experience and Qualifications :\r\n\r\n•\tBachelor’s degree from a top institution or a relevant degree. \r\n•\t1-2 years relevant work experience.\r\n•\tFamiliarity with project management tools and software.\r\n•\tExperience with agile development and its methodology is a plus.\r\n•\tPMP certification a plus.\r\n•\tFlexible, adaptive and responsive to project changes.\r\n•\tExcellent communication, analytical and problem solving skills.\r\n•\tAble to utilize Web technologies and Development tools.\r\n•\tAble to quickly learn company technologies and tools.\r\n•\tFamiliar with industry standards.\r\n•\tCapable of working independently with little supervision.\r\n•\tTechnical writing,Teaching/training and performance measuring.\r\n•\tIs experienced in managing relationships with multiple vendors and departments.\r\n•\tExperience in developing web-based tools.\r\n•\tSelf-motivated with strong organizational skills and attention to detail.\r\n•\tStrong team player with the ability to prioritize and thrive in a fast paced environment .\r\n\r\nInterested ? Apply using this form: http://bit.ly/1jLsfPe","created_time":"2013-12-27T02:14:18+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_675717325801312","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Richard M. Stallman, Linus Thorvalds, and Donald E. Knuth engage in a discussion on whose impact on the computerized world was the greatest.\nStallman: \"God told me I have programmed the best editor in the world!\"\nThorvalds: \"Well, God told me that I have programmed the best operating system in the world!\"\nKnuth: \"Wait, wait - I never said that.\"","caption":null,"description":null,"created_time":"2013-12-27T07:06:25+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_675763119130066","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"developer.ubuntu.com","description":"Embrace the power of the webThe tools you know and loveLeverage your existing knowledge to write Ubuntu apps with the technologies that power the web: HTML5, JavaScript, CSS are fully supported.Write web, run nativeHTML5 apps written with the Ubuntu SDK run as native apps. Use the provided HTML5 the...","created_time":"2013-12-27T08:53:56+11:00","total_likes":0,"total_comments":0}]}