{"posts":[{"id":"172338516139198_1045890715450636","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":null,"caption":null,"description":null,"created_time":"2015-12-17T00:48:51+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1045899345449773","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":null,"caption":"arabhardware.net","description":"مايكروسوفت تطلق برنامجًا تشجيعيًا للمبرمجين يتضمن أدوات وبرامج تعليمية  قيمتها مئات الدولارات بشكل مجاني إضافة إلى اشتراكات في دروس تطوير تطبيقات المحمول","created_time":"2015-12-17T01:13:46+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1047042802002094","from":{"name":"Kogo Mohamed Said","id":"10212310688508425"},"message":"Data recovery from a clicking (external) hard drive ,, any help ? \nPlaces with low cost or advice to do it home ,, I've been watching tons of youtube videos but all are warning from unclean air and stuff like that. \n\nif anyone have any idea or advice about doing that please tell me.","caption":null,"description":null,"created_time":"2015-12-17T20:44:42+11:00","total_likes":1,"total_comments":12},{"id":"172338516139198_1047119921994382","from":{"name":"Mahmoud Said","id":"10158340042205183"},"message":"You don't go fast by writing crap, you don't go fast by rushing, you don't go fast by tearing to the code and making it work and then releasing it as fast as you can.\nYou want to go fast, you do a good job, your grandmother told you this along time ago, right. you want to go fast you go well, you take your time, you study the problem, you move deliberately instead of rapidly.\n-- UncleBob (https://youtu.be/TMuno5RZNeE)","caption":"youtube.com","description":null,"created_time":"2015-12-17T23:19:37+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1047153438657697","from":{"name":"Sameh Elkhadem","id":"1831821787035137"},"message":null,"caption":"ghacks.net","description":"Preserving your Privacy in Windows 10 is a free ebook for computer users who already have upgraded a system to Microsoft's new operating system Windows 10, or plan to do so in the future. It covers important privacy topics that include customizing the settings during installation, using a local acco…","created_time":"2015-12-18T01:00:41+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1047304298642611","from":{"name":"Ahmed Saleh","id":"1384434324953403"},"message":"web.ts\nCreate Web Apps the Object Oriented way. An Easier, faster, and efficient way to create websites.\n\nFirst, you create a ts class file that extends web.ts.Page.\n\nSecond, Implement the View() Method to return the location of the view page you would like to show, for example, \"/Page1.txt\". You can also return #element (id of an element), which returns the outerHTML content of an element in the document page. The View source file can be designed with HTML Designer softwares.\n\nThird, you implement the Render(document) method callback which is used to render the content when it's already available.\n\nFourth, create instance of this class and cal Load() method to ask to fethch the document in View() and Render(doc) when it's finished fetching.\n\nFifth, Pages are loaded when a Url change is detected and load a different page based on the name of the Hash.\n","caption":"github.com","description":"web.ts - Create Web Apps the Object Oriented way","created_time":"2015-12-18T08:16:53+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1047317285307979","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"LOL :D","caption":"lifehacker.com","description":"Hitting a key over and over again actually works for once. Two security researchers in Spain recently uncovered a strange bug that will let you into most Linux machines just by hitting the backspace key 28 times. Here’s how to fix it and keep your data protected.","created_time":"2015-12-18T09:00:33+11:00","total_likes":7,"total_comments":0},{"id":"172338516139198_1047692251937149","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"Learn GraphQL step by step\n\n","caption":"learngraphql.com","description":"Learn and master GraphQL core concepts under few hours with our unique learning experience.","created_time":"2015-12-19T04:56:20+11:00","total_likes":9,"total_comments":0},{"id":"172338516139198_1047842895255418","from":{"name":"Sameh Saeed","id":"10154266644607344"},"message":"good to read :)\n","caption":"scotch.io","description":"The Scotchmas Day 2 giveaway can be found at the end of this article. Every developer strives to write maintainable, readable, and reusable code. Code structuring becomes more important as applications become larger. Design patterns prove crucial to solving this challenge – providing an organization…","created_time":"2015-12-19T11:29:46+11:00","total_likes":12,"total_comments":0},{"id":"172338516139198_1047142538658787","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":"السلام عليكم\nمن فضلكم يا جماعة انا عندى مشكلة ومش عارف ازاى اهندلها - انا بستدعى بيانات عن طريق Angularjs وبقدر اعرضها فى الفيو عادى - بس عاوز اخد قيمة منهم بعد ما تظهر فى الصفحة عشان بناء عليها حتم عملية تانية جربت document.ready\n$(document).ready(function () {\ndebugger;\nvar val = $('#DepId').val;\nalert('Content has been changed' + val);\n});\nبس المشكلة ان كودها بيتنفذ وبتكون لسه البيانات مجاتش الصفحة - بمعنى اصح كود الانجولار بيتنفذ بعدها - ازاى اقدر امسك القيمة اللى عاوزها بعد ما تكون اتبعتت للصفحة ؟","caption":null,"description":null,"created_time":"2015-12-18T00:33:45+11:00","total_likes":0,"total_comments":14}]}