{"posts":[{"id":"172338516139198_1231739746865731","from":{"name":"Omar Ibrahim","id":"10113230069002554"},"message":"A fun article I been working on the past couple of days, would love to hear your feedback.","caption":"omarbits.github.io","description":"Programming is Magic! The Fun Way To Learn Programming September 13, 2016 The Basics Can Be Boring Learning Programming can be intimidating at times. Whether you never got to learn programming and it seems very mysterious to you, or you actually had the unpleasant experience of learning to code for…","created_time":"2016-09-14T21:40:43+10:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1229960027043703","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"صباح الخير يا جيكس\nكل سنة وانتم طيبين وعيد سعيد علينا جميعا مسلمين ومسيحيين زي ما اتعودنا بنشارك بعض الاعياد\nياتري الجيكس مقضيين اول يوم عيد ازاي ؟\nانا قاعد بذاكر RESTFUL لمدة ساعتين وبعدها هدخل علي UNITY3D\nشاركونا عيز احس اني مش لوحدي اللي سايب الفتة واللحمة وقاعد بGEEK علي اللاب :D","caption":null,"description":null,"created_time":"2016-09-12T20:28:26+10:00","total_likes":24,"total_comments":25},{"id":"172338516139198_1229895910383448","from":{"name":"Ahmed Essam","id":"440145042983821"},"message":"دورة أساسيات بايثون 2.7 مكتملة.\n","caption":"muslimdevelopertv.com","description":"بسم الله الرحمن الرحيم، يسعدني أن أقوم بنشر أولى دوراتي في لغة Python، تلك اللغة التي تستخدمها وكالة الفضاء الأمريكية بشكل كبير في برامجها...","created_time":"2016-09-12T18:40:19+10:00","total_likes":3,"total_comments":3},{"id":"172338516139198_1231672920205747","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"One of the best articles about promises and generators","caption":"medium.com","description":"Covering the Basics","created_time":"2016-09-14T19:59:25+10:00","total_likes":7,"total_comments":2},{"id":"172338516139198_1232166773489695","from":{"name":"Mohamed Abu Galala","id":"1215961701856579"},"message":null,"caption":null,"description":"كلنا عارفين ان ال gps بنستخدمه عشان نعرف الطريق للمكان اللى احنا رايحين ليه ..... \nهل كلنا بنستخدمه نفس الاستخدام ..؟ \nفنان اسمه Stephen Lund استخدم ال gps عشان يرسم لوحاته الفنية على الخرايط\nستيفان اللى بيركب الدراجة بتاعته كل يوم حوالى 70 كم عشان يرسم لوحات على الخرايط اللى بتوفرهاله خدمة ال gps  واللى بدأ يمارس فنه بإستخدام الخرايط من 2015 سجل اكتر من 22,300 كم وكانت اطول مسافة اتحركها مرة واحدة بس كانت 220 كم .\n ده غير انه بيتحدى نفسه ان الرسمة تكون خط واحد متصل ببعضه.\nبس Lund  مكنش اول واحد يرسم على الخرايط فيه ناس تانية كتير واكبر رقم مسجل لفنان يابانى اسمه Yasushi Takahashi واللى مسجل اطول رسمة على الخرايط واللى تقدر بمسافة 105,734 كم .\nبس للأسف الرقم ده غير معترف بيه فى موسوعة Guinness World Records...\nبس Yasushi مكنش بنفس اسباب lund ده استخدمها لأغراض رومانسية :D   #Marry_me\n#gps_art","created_time":"2016-09-15T06:26:52+10:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1232168030156236","from":{"name":"Mohamed Shehata","id":"1370507823007722"},"message":"Bill Poucher with Wael Ghonim","caption":null,"description":"Live Session with Bill Poucher, Exec Director of ACM-ICPC and CS Prof at Baylor","created_time":"2016-09-15T06:28:12+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1232166063489766","from":{"name":"Abdelrahman Elkady","id":"1328679870533293"},"message":"GitHub introduced a big set of new features, and it's amazing !\n\n","caption":"github.com","description":"Today I welcomed more than 1,500 people to our second annual Universe conference in San Francisco, an event designed to celebrate the people building the future of software. It’s an important remin...","created_time":"2016-09-15T06:25:53+10:00","total_likes":18,"total_comments":2},{"id":"172338516139198_1231831510189888","from":{"name":"Rafael Adel","id":"10155242150027122"},"message":"مساء الخير .. انا بقالي كام يوم بحاول اعمل implementation لل merge sort بال c++ iterators بس .. بدون استخدام arrays or indexes دلوقتي انا عامل ال merge function مظبوطة لكن باجي لما اقسم الفكتور دة لما بعمل debug بلاقي فى مشكلة انه مش بيتقسم صح .. انا مش عارف العيب فين جربت اغير ال base case مش نافع .. فياريت اللي عنده فكرة يقوللي ... \n(ملحوظة ١: ده اول تعامل ليا مع ال iterators )\n(ملحوظة ٢: انا بحاول اعمل  in place swapping مش بعمل فكتور جديد و احط فيه ال sorted values )","caption":"gist.github.com","description":null,"created_time":"2016-09-15T00:06:55+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1232253666814339","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"If you can't access your Gmail don't freakout. google just deleted all the gmail accounts and they are restoring them now :D","caption":"google.com","description":"Google Apps Status Dashboard enables users and businesses to monitor the status of individual Google Apps services. Users of Google Apps can now view the status of individual services such as Gmail, Google Calendar, Google Talk, Google Docs, Google Sites and Google Video for businesses. Administrato...","created_time":"2016-09-15T09:05:01+10:00","total_likes":10,"total_comments":11},{"id":"172338516139198_1232950263411346","from":{"name":"أحمد عاكف","id":"10212157530870609"},"message":"A brief session about how to start learning about the Linux kernel. It includes a hands-on guide for examining the interaction between user-space and kernel space.\nمقدمة عن linux kernal اونلاين بكرة الجمعة الساعة 9 ان شاء الله","caption":"CAT Live | Understanding the Linux kernel","description":"A brief session about how to start learning about the Linux kernel. It includes a hands-on guide for examining the interaction between user-space and kernel space.\n\nThis presentation is part of ‘System bits’ series that introduces various topics of systems development in an easy to comprehend format.\n————————————————————————————\nPrerequisite:\nIt’s a light weight session that doesn’t require any background in Linux Kernel but requires basic programming experience.\n————————————————————————————\nBio:\nKarimAllah is a Linux Kernel engineer who has worked on several layers of the software stack starting from developing BIOSes, boot-loaders, and the linux kernel; all the way to developing NoSQL databases and openstack-like cloud management software.\n————————————————————————————\nDate: \nFriday, September 16th, 2016 – 9:00 PM\n————————————————————————————\nDuration:\n< 1 hour\n————————————————————————————\nWhere:\nhttps://www.youtube.com/user/CATHangouts\n————————————————————————————\nVisit our website for more activities:\nhttp://catreloaded.org/activities/#section-3","created_time":"2016-09-16T06:16:30+10:00","total_likes":6,"total_comments":0}]}