{"posts":[{"id":"172338516139198_1345722682134103","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"TensorKart: self-driving MarioKart with TensorFlow","caption":"kevinhughes.ca","description":"Kevin Hughes' Blog","created_time":"2017-01-05T08:34:41+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1345743638798674","from":{"name":"Khaled M. Diab","id":"10212550395463324"},"message":"Google is building a Python transcompiler and runtime using Go... seems interesting for concurrent workloads in Python. \n\nIt seems that only python 2.7 is supported so far. Also, the Go runtime doesn't allow C extensions (as CPython does)...","caption":"opensource.googleblog.com","description":"Google runs millions of lines of Python code. The front-end server that drives youtube.com and YouTube’s APIs is primarily written in Pytho...","created_time":"2017-01-05T09:15:46+11:00","total_likes":20,"total_comments":0},{"id":"172338516139198_1345879868785051","from":{"name":"Mohamed Moshrif","id":"1235868066468537"},"message":"Does anyone know of any way to download dmg file for MacOS from Windows?\nMy macOS is gone and I need to create a bootable USB to reinstall it but can't find a single working link to download the dmg file","caption":null,"description":null,"created_time":"2017-01-05T13:07:18+11:00","total_likes":0,"total_comments":5},{"id":"172338516139198_1345659248807113","from":{"name":"Ashraf Gawdat","id":"10154025473076618"},"message":"لو انت كمبرمج كنت بتشتغل شغل ريموتلي بارت تايم (جنب الشركة اللي انت فيها يعني) .. وعملت فيه حاجات كويسة فعايز تكتب الحاجات دي في السي في .. السؤال بيقول: هل كتابة إنك كنت شغال بارت تايم دي حاجة كويسة ولا وحشة في السي في؟ يعني هيبص للشغل اللي عملته فيه والتكنولوجيز اللي استخدمتها فيقول الشخص ده كويس .. ولا هيبص لإنك كنت بتشتغل شغل تاني جنب شغلك الأساسي ودي حاجة الشركات مش بتحبها؟\n\nولو كانت حاجة كويسة تتكتب .. تتكتب ازاي؟ مكانها فين يعني في ترتيب الوورك إكسبيرينس في السي في؟ لأن كل إكسبيرينس بيكون بتاريخ بداية وتاريخ نهاية .. وده تواريخه هتكون متداخلة مع شغل أو أشغال تانية .. وموضوع التواريخ ده شغلانة بالذات على لينكد إن.\n\nولو كانت حاجة مش كويسة بس انا عايز اكتب الشغل اللي عملته فيه لأنه مهم ومعملتش زيه في شركة اشتغلت فيها وحاجة تستحق إنها تتتب .. تتكتب ازاي؟ على إنها فري لانس مثلا ولا نفس المشكلة؟","caption":null,"description":null,"created_time":"2017-01-05T07:02:19+11:00","total_likes":3,"total_comments":6},{"id":"172338516139198_1346134592092912","from":{"name":"Mohamed Elsherif","id":"952693524866956"},"message":"Discussion : will voice be the new Touch screen ?","caption":"quora.com","description":"Did you unwrap a smart speaker during the holidays this year? If so, we're thrilled to let you know that Quora is available for Google Home and Amazon Echo. At Quora our mission is to grow and share the world's knowledge, and achieving this mission means making Quora accessible on more platform...","created_time":"2017-01-05T20:18:49+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1346209412085430","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"\"A mystery player causing a stir in the world of Go has been revealed as an updated version of AlphaGo.\"","caption":"nature.com","description":"Updated version of DeepMind's AlphaGo program behind mystery online competitor.","created_time":"2017-01-05T22:27:30+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1346258822080489","from":{"name":"Abdelrahman Omran","id":"2022367384657074"},"message":"Do you have an idea for a tech-related product, application or service? Do you have a basic functioning prototype or in the process of developing one?\n\nIf you answered YES to the above, you can now register for TIEC Accelerator 10th round set to start February 2017! Deadline for registration is January 22nd 2017.\n\nhttp://tiec.gov.eg/en-US/Accelerator/Pages/apply.aspx","caption":null,"description":null,"created_time":"2017-01-06T00:12:37+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1346297195409985","from":{"name":"Ahmed El Gabri","id":"10158299136875582"},"message":"This is why the future of JavaScript is to be a compilation target.","caption":"medium.com","description":"So you are intrigued what WebAssembly is and want to try it? Since December 22 it’s possible to compile Rust to WASM. If you don’t know…","created_time":"2017-01-06T00:35:08+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1346148115424893","from":{"name":"Mohamed Abdel Aty","id":"10212491964880718"},"message":"Anyone still having problem with google using https on windows in Egypt? I just tried something and worked for me\n\nMove the \"equifax secure certificate authority\" from the trusted root certification authorities to untrusted certificates in windows cert manager\n\nonly the pc i did this on had google working again on https with no warnings from chrome \n\ncan anyone confirm this solution work ? if it did not you can revert this by moving the certificates back to rusted root certification authorities","caption":null,"description":null,"created_time":"2017-01-05T20:30:49+11:00","total_likes":6,"total_comments":4},{"id":"172338516139198_1346246935415011","from":{"name":"Waleed Rostom","id":"10155013782967114"},"message":"A React-like JS library that is, according to them, a much smaller (9kb vs 45kb) and much faster alternative to React.","caption":"infernojs.org","description":null,"created_time":"2017-01-05T23:50:17+11:00","total_likes":5,"total_comments":2}]}