{"posts":[{"id":"172338516139198_664565400249838","from":{"name":"Meligy","id":"10154884040385170"},"message":"Yay reversible USB (hopefully, in the future)","caption":"theverge.com","description":"Work has begun on a new generation of USB that will break compatibility with existing connectors in order to improve ease of use and allow for thinner devices. The new connector, called Type-C, is...","created_time":"2013-12-04T20:40:19+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_664612720245106","from":{"name":"Ahmed Mohammad","id":"10155186366899791"},"message":"Google: Arabic content ranks eighth on the internet, 141 million Internet Arabic users (infographic)\n","caption":"arabcrunch.com","description":"Arabic content makes only 3% of the internet it dropped from the seventh spot 2012 to eights in 2013 Google spokesperson told Al Arabiya News. There are up to 630 million Arabic-speaking users arou...","created_time":"2013-12-04T23:20:59+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_664657046907340","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":null,"description":"Mohammad Abdel-Wahab\n\n\nفيسبوك عمل أبديت إمبارح لل Algorithm بتاعتو..\nيمكن يكون الموضوع مش جديد على البعض ،ويمكن يكون إتناقش قبل كدة.. إنما هو لسة داخل حيز التنفيذ من يومين وكمان هيبدا لسة هيتطبق واحدة واحدة\n\nطب إيه هو الأبديت ده؟ وهل هيفيدني أو يأثر على شغلي في فسيبوك؟ هل هيأثر على ال strategy اللي أنا عاملها وإيه أثره خصوصا على ال reach؟\n\nالأبديت بإختصار في نقطتين:\n\n1- المقالات ليها أفضلية:\n\nفيسبوك لقى إن الناس بتحب تقرأ مقالات كتير ومواضيع ذات صلة بإهتمامات اليوزر، يمكن أكتر من لينكات الصور والحاجات التانية.\nولذا، فسيبوك هيبدأ يدي أولوية للمقالات (اللينكات) بشكل عام في ال news feed، وهتظهر أكتر (خاصة في الموبايل).\nوده ميزته بالنسبة لليوزر إنه هيلاقي high quality content كتير من الحاجات اللي بيحبها وبيهتم بيها.\n\n2- Stories Bumping\n\nال Bumping ده الجزء التاني من الأبديت..\nوهو إن فيسبوك هيدّي أولوية للبوستس وال articles اللي حصل عليها كومنتات جديدة.. عن طريق إنه هيعملها pump أو يعني هيزقّها تاني ويطلعها في ال newsfeed من جديد ويعمل هايلايتنج للكومنتس الجديدة عليها.\n\nفيسبوك عمل ده عشان لقى إن فرص إن اليوزر يرجع يقرا و يبص على حاجة قديمة كان معمولها شير قبل كدة وهو كان بالفعل شافها، قليلة جدا. ويمكن يكون الحاجة اللي قرأها قبل كدة دي حصل عليها كومنتات وكلام جديد وهو فاتوا كل دة..\nفا محققشي أقصى إستفادة من البوست.\n\nوبالتالي ممكن بعض الناس دلوقتي (وده بدا يحصل عندي بالفعل) إنه يلاقي في النيوزفيد عنده بوست طلعت كذا مرة على فترات متفاوتة، إنما الجديد إنها بوست عليها تفاعل كتير وكومنتس جديدة.. وفيسبوك بيطلعها تاني (او بيعملها Pump يعني) ويعمل هايلاتينج للكومنتس الجديدة عشان ميفوتكش الكلام الجديد عالبوست دي.\n\nطيب تمام.. إيه بقى لازمة الهري دة بالنسبة لي يا معلم؟\n\n1- ال reach بتاع ال links للمقالات هيكون عالي مقارنة بقبل كدة.. يعني فرص ظهور اللينكات في النيوزفيد يمكن يكون أعلى من (أو بأهمية) الصور والفيديوهات\n\n2- في ال strategy بتاعتك ركز على المقالات ال quality أو البوستات اللي فيها إفادة فعلا بشكل عام للناس.. لإن فرصتها عالية جدا في الظهور في النيوزفيد وبالتالي فرص التفاعل عليها أكبر. (يعني مبقتشي الصدارة دلوقتي للصور والفيديو بس :D)\n\n3- البوستس المفيدة واللي هتنجح في إنها يحصل عليها تفاعل ولايكس وشيرز وكدة، فيسبوك هيزقّهالك ويطلعها أكتر من مرة أو عدة مرات كل ما يحصل عليها تفاعل جديد، عشان الناس تحقق أقصى إستفادة منها. (مش معنى يعني إن بوست طلعت كذا مرة عندك ان النيوزفيد معندوش جديد يطلّعوا  ) \n\nمارك والحاشية بتاعوا شغالين الله ينور  وعمالين يطلعوا كل يوم بحاجة تخلي فسيبوك مصدر استفادة مش ضياع وقت وخلاص\n\nمقال سابق\nhttp://goo.gl/PGBbKi","created_time":"2013-12-05T01:30:34+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_664738370232541","from":{"name":"Mosab Ibrahim","id":"10154868571206047"},"message":"At work, I am about to build a SOAP API in PHP.\n\nI am considering one of two options. Either using the native SoapServer class in PHP or Zend_Soap_Server class.\n\nDoes anybody here have any recommendations, or tips on which way to go?!\n\nOr does anybody have any useful resources to read?!","caption":null,"description":null,"created_time":"2013-12-05T05:10:07+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_664908693548842","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Ahmed Essam Naiem","caption":"thenextweb.com","description":"Jeremy Rappaport is a writer at Fueled, the leading iPhone application developers and masters of mobile design in New York City. This post was originally published on the Fueled blog. Everyone ...","created_time":"2013-12-05T12:53:45+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_664545473585164","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"I hate when i see a good plugin that doesn't have a destroy method. Well i did the pull request for Bootstrap Carousel plugin and I added the destroy function give it +1 if you like it so they can approve the pull request faster :)\n\nhttps://github.com/twbs/bootstrap/pull/11704","caption":"github.com","description":"bootstrap - Sleek, intuitive, and powerful front-end framework for faster and easier web development.","created_time":"2013-12-04T19:11:23+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_663393237033721","from":{"name":"Meligy","id":"10154884040385170"},"message":"الديلفري الطاير. خيال فاضل له بس قانون (متوقع في 2015 يخلص سلقه) و يبقى حقيقة في أمريكا.\n\nو الله زي مابقولك كده.","caption":"amazon.com","description":"Online shopping for Test; & more at everyday low prices.","created_time":"2013-12-02T13:09:29+11:00","total_likes":8,"total_comments":10},{"id":"172338516139198_665175880188790","from":{"name":"Christy Badry","id":"10158355539020635"},"message":"An innovative healthcare technology Company is hiring a qualified caliber :\n\nTitle : Software Front-End Development Engineer\n\nResponsibilities:\n\nSpecialize in building groundbreaking web applications using advanced HTML, CSS, and JavaScript\nContribute to presentation layer standards and practices\nContribute to testing and implementation approach for presentation layer\nPrototype future interfaces\nWork closely with our product and design teams, as well as other engineers.\n\nRequirements:\n\nBS or BA degree related to Software Engineering.\n1+Experience in developing highly interactive Web applications with modular, reusable JavaScript\nExceptional object-oriented JavaScript skills\nInterest if not experience working further down the stack","caption":null,"description":null,"created_time":"2013-12-05T23:09:38+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_664499396923105","from":{"name":"Amr Selim","id":"10211984009066138"},"message":"مساعده يا جماعه وياريت الي عنده اي معلومه ما يبخل بيها\n-------------------------------\nسلام عليكم انا الدومين بتاعي واخد بان من الفيس بقالو سنتين اشتريت دومين جديد قعد اسبوع واخد بان انا قولت يمكن السوفت وير بتعتي فيها مشكله وبالفعل عملت فحص على virustotal.com وكلمت كتير من الشركات الي كانت مصنفاني اني milcation website الحمد لله البان اتفك اسبوع ورجع تاني مش عارف المشكله من ايه انا عملت كل الي اقدر على وبعت كتييير Reports ولا حياة لمن تنادي\n\nاتمنى لو عند اي اي احد  وسيله او معلومه يفدني بيها اكون متشكر جدا جدا ليه واسف جدا على الازعاج يا \n\nefhamcomputer .com\n efhamcomputer .net","caption":null,"description":null,"created_time":"2013-12-04T15:55:27+11:00","total_likes":0,"total_comments":6},{"id":"172338516139198_665340093505702","from":{"name":"Ahmed Mohammad","id":"10155186366899791"},"message":"RIP Ali Shaath:  Egypt and Arab Open Source Movement and Arabic Content Looses One of its Pioneers http://bit.ly/1dSD2o7 #علي_شعث","caption":"arabcrunch.com","description":"The community of Arabic digital content and open source movement in Egypt, Palestine and the Arab world has lost one of its pioneers and heavy weight evangelists: Ali Shaath. Ali Shaeth, son of the...","created_time":"2013-12-06T04:36:45+11:00","total_likes":0,"total_comments":0}]}