{"posts":[{"id":"172338516139198_1176777025695337","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"عند فكرة Tool محتاج اعرف رأيكم فيها، المفروض ان كلنا تقريبآ لما بتواجهنا مشكلة بندور على Stack overflow و بنلاقى كود ناخده كوبى بيست او بنلاقى gist على جبت هب بناخد الفايل او الإتنين اللى فيها و نحطهم فى اماكنهم فى البروجيكت و نشوف النتيجة و نعدل عليهم و كده.\nوناس كتير بتشتكى من ان فيه packages صغيرة قوى فايل او اتنين، فليه تحجز اسم و الديفلوبر يطلع منها فيرجنز و repo on github و كل ده و تاخد وقت طويل مع انه ممكن يحطها على gist.github.com والناس تبقى تدور عليها وتاخدها فى البروجيكت و خلاص.\nالproposal بتاعى ان فيه اكواد صغيرة قوى اصغر من انها تكون package مع نفسها وفايل عاوز تديه للناس بطريقة ابسط من انك تعمل كل ال package structure و تكتب تيستس ، ابسط من انك تتراك النسخ بتاعتها وتعمل ابديت، اللى بقترحه يكون فيه cli tool زى gem فى روبى، بس مش بتدور فى الإندكس بتاعها، بتدور على gists ولو عاوز الgist دى بتعمل كوبى ليها فى المكان بتاعها بناء على اسم الفايل (اللى المفروض يكون وقتها path ) وخلاص خلصنا، حاجة صغيرة تسألها على حل مشكلة عندك تديلك حلول زى validations فى rails او فايل واحد بيحل مشكلة معينة صغيرة.\nالمفروض ان يكون اكونتات github زى sources تقدر كمستخدم تحط الأكونت ده كsource للgists فيكون فيه اكونت ل rails مثلأ لو حطيته فى التول تقدر تسأل على حلول لمشاكل rails و الgist اللى عاوزها ينزلهالك، وممكن اكونت تانى يكون بيعمل favorite لحاجات فريموركس تانية.\nولو حد عاوز ينشر الgist بتاعته فى الأكونت بيبعت رسالة ولا حاجة او يمنشن الأكونت والأكونت يكون وراه bot بيشوف الgist دى فيها الرولز المطلوبة ولا لأ يعملها favorite اوتوماتيك.\nكده انا مثلأ عاوز url validation class for rails بعمل كوماند زى\n$ publisher \"url validation\"\n1. url validation class\n2. ftp url validation class\n3. enforce url validation \n.\n.\n.\nN:next, 1-9 install gist, Q:quit\nحاجة زى كده تختار الgist ينزل الملف او الإتنين اللى فيها فى البروجيكتـ تعدل فيهم زى مانت عاوز ويكونوا جزء من البروجيكت على طول وقتها مش هيتحسبوا dependency على ما اعتقد! و هتلاقى ان الdepency manifest زى Gemfile عندى اقل بكتير لأن الباكدجيز الصغيرة اللى فيه دلوقتى بقت included فى المشروع على طول.","caption":null,"description":null,"created_time":"2016-07-07T20:24:24+10:00","total_likes":14,"total_comments":6},{"id":"172338516139198_1176512339055139","from":{"name":"Abdelrahman Mamdoh","id":"10209094202414310"},"message":null,"caption":null,"description":null,"created_time":"2016-07-07T08:22:03+10:00","total_likes":11,"total_comments":5},{"id":"172338516139198_1176612089045164","from":{"name":"Ahmed A. Radwan","id":"10210320806590684"},"message":"Hello,\nI know how to code in C but not professionally. I'm thinking of taking a course or more to understand more about the syntax of C++ OOP, data structures, algorithms and design patterns.\nI found online courses but I'm confused about the arrangement of those courses. Could anyone help with that?!\nThanks in advance","caption":null,"description":null,"created_time":"2016-07-07T11:47:32+10:00","total_likes":0,"total_comments":8},{"id":"172338516139198_1177083258998047","from":{"name":"Abdulrhman Rdwan","id":"424544994553184"},"message":"يا ريت كل الموجودين في الجروب يلتزمو بقوانينه  في الاجابه على الأسئله و نقد الطروحات و الافكار من غير تجريح او اساءه لحد و يا ريت الأدمنز يقومو الأعضاء في حالات المخالفه\n\nhttps://github.com/egyptian-geeks/FAQ/wiki/New-Members-Guidelines\n\nplease make sure you have noticed these two guides :\n\nBe creative, come up with new idea, write your opinion \"and support it with evidences and proper information\", we appreciate opinions and posts that has some effort in it.\n\nBe friendly, talk to people like in real life, use references for your replies, attack the problem, say your opinion, don't attack people.","caption":"github.com","description":"FAQ - A set of frequently asked questions in Egyptian geeks group, checkout WIKI for them","created_time":"2016-07-08T05:36:47+10:00","total_likes":6,"total_comments":1},{"id":"172338516139198_1177322365640803","from":{"name":"Khaled Ramadan","id":"10155975474214478"},"message":null,"caption":"blog.thoughtram.io","description":"In our last article we've talked about what Zones are and how they change the way we deal with asynchronous code. In this article we're going to discuss what role they play in the Angular 2 platform, with the Angular 2 specific NgZone.","created_time":"2016-07-08T14:12:06+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1177326295640410","from":{"name":"Khaled Ramadan","id":"10155975474214478"},"message":null,"caption":"tattoocoder.com","description":"The import statements in Angular 2 can get pretty cumbersome if you're using a lot of services, models, directives etc in any specific component. Looking at the basic \"QuickStart\", the app.component.ts doesn't seem very obtuse. import {Component} from...","created_time":"2016-07-08T14:19:55+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1177453458961027","from":{"name":"Mohamed Yahya","id":"1255225231180285"},"message":"What time is it in Cairo right now ? \n\nhttps://www.google.com.eg/?ion=1&espv=2#safe=off&q=local+time+in+cairo+right+now","caption":null,"description":null,"created_time":"2016-07-08T19:20:51+10:00","total_likes":4,"total_comments":3},{"id":"172338516139198_1177231905649849","from":{"name":"سامح دعبس","id":"1873036762957490"},"message":"Wow!","caption":"quora.com","description":"Riyad Parvez's answer: I'm surprised no one mentioned Jeffrey Dean. Just some of his accomplishemnts: * The design and implementation of the initial version of Google's advertising serving system. * The design and implementation of five generations of our crawling, indexing, and query servi...","created_time":"2016-07-08T11:09:20+10:00","total_likes":25,"total_comments":1},{"id":"172338516139198_1177206532319053","from":{"name":"Abdulla Adel Essa","id":"1475277042503657"},"message":"Firebase is now the best alternative for parse after adding the new cross platform cloud messaging and the Firebase file storage \n","caption":"firebase.google.com","description":"gmp_analytics AnalyticsAt the heart of Firebase is Firebase Analytics, a free and unlimited analytics solution. See user behavior and measure attribution from a single dashboard. plat_iosplat_androidUnlimited reporting of 500 event types, each with up to 25 attributesOne dashboard to view user behav...","created_time":"2016-07-08T10:24:35+10:00","total_likes":7,"total_comments":1},{"id":"172338516139198_1177462905626749","from":{"name":"Omar Negm","id":"1336081849771271"},"message":"Visual Studio 2015 Update 5 Released.","caption":"blogs.msdn.microsoft.com","description":"The official source of product insight from the Visual Studio Engineering Team","created_time":"2016-07-08T19:49:08+10:00","total_likes":1,"total_comments":11}]}