{"posts":[{"id":"172338516139198_885494231490286","from":{"name":"Mohamed Nady","id":"10154387282503733"},"message":"https://msdn.microsoft.com/en-us/magazine/dd882510.aspx","caption":"msdn.microsoft.com","description":"Receive the MSDN Flash e-mail newsletter every other week, with news and information personalized to your interests and areas of focus.","created_time":"2015-01-24T22:57:33+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_885497521489957","from":{"name":"Mohamed Abdel Aty","id":"10212491964880718"},"message":"Apparently asp.net team is voting on what format their documentation should be in \n\nhttps://github.com/aspnet/Home/issues/289","caption":"github.com","description":"The Home repository is the starting point for people to learn about ASP.NET 5.","created_time":"2015-01-24T23:05:44+11:00","total_likes":2,"total_comments":1},{"id":"172338516139198_885561208150255","from":{"name":"Hesham Mohamed Eladawy","id":"10154309434427452"},"message":null,"caption":"heshameladawy.blogspot.com","description":"هذا هو الدرس الثاني في دورة احتراف الأسكرم (سكروم). في الدرس الأول تعرفنا على المشاكل التي تواجه فرق العمل سواء مع العميل، او مع التقنية، او بين افراد الفريق بعضهم بعضا. وربما يتبادر لذهنك الآن لم كل هذه المشاكل مرتبطة بمجالنا (مجال البرمجيات).","created_time":"2015-01-25T02:09:29+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_885542824818760","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"خلونا نقرأ المقابلة دى مع Bjarne Stroustrup المقابلة مختصرها انه لما عمل الC++ دى كانت ترول و بيهرج و انها مضيعة للوقت، انا من كتر ما الكلام عجيب حاسسها نكتة بس، لكن النص اللى فى الأول بيقول انها مقابلة حقيقية مع مجلة IEEE Computer :D ياريت تقرأوها و خصوصآ ال C++ ديفلوبرز :D \n\nhttp://www.cs.cmu.edu/~chuck/jokepg/joke_19980216_01.txt\nEdit: طلع تأليف يا جماعة الحمد لله False alarm, False Alarm :D","caption":"cs.cmu.edu","description":"On the 1st of January, 1998, Bjarne Stroustrup gave an interview to the IEEE's 'Computer' magazine. Naturally, the editors thought he would be giving a retrospective view of seven years of object-oriented design, using the language he created. By the end of the interview, the interviewer got more th…","created_time":"2015-01-25T01:22:14+11:00","total_likes":11,"total_comments":6},{"id":"172338516139198_885678501471859","from":{"name":"Tamer Ahmed","id":"10153746998237614"},"message":"https://www.facebook.com/747640815319074/photos/a.753705848045904.1073741830.747640815319074/753705901379232/?type=1&theater","caption":null,"description":"كيف نختار شركاء العمل في شركتنا الناشئة؟\nهذا السؤال دائما ما يكون السؤال التالي  بعد الفكرة\nوهناك آربعة عناصر رئيسية لابد من التحري عنها بدقة عندما تبدأ في البحث\nالموضوع يشبه الزواج !!! فستقضي مع شركاؤك الجدد فترة تتجاوز ما تقضيه مع زوجتك أو زوجك وبالتالي فلابد ان تختار جيدا و بصورة مقاربة لأختيار الزواج فلا يخفى علينا كم الزيجات التي تنتهي بنهايات مأساوية حالياً\n\nآولاً \nعليك البحث بدقة عن هولاء الذين يؤمنون بنفس القيم و المباديء في حياتهم فلا يوجد أسوأ من ان يكون شركاء يؤمن آحدهم تماماً بقيمة المال و أهميته بينما يؤمن الآخر بقيمة عمل الخير و الحفاظ علي العلاقات الأنسانية و هنا لا يهم آيهما افضل و لكن المهم ان تتشاركا نفس القيم لأن هناك أختيارات صعبة ستحتاج منكما ان تفضلا واحد من هاتين القيمتين و بالتالي فلا مجال للتناحر حول القيم الأساسية\nقد يكون احد الشركاء يحب العمل بالليل و الآخر كائن صباحي وهنا لا توجد مشكلة\nقد يحب احدهم العمل مع الكمبيوتر بينما يفضل الآخر التعامل مع الناس وهنا ايضا لا توجد مشكلة\nولكن اياك ان تختار شريك يختلف معك في الفيم الأساسية او core values\n\nثانياً\nتعامل مع الشريك المرتقب عن قرب و أخرج معه و استمع منه لأرائه في كل شيء العمل و الحياة\nاستمع لأصدقائه و اسمع من ناس يعرفونه جيدا\nأسأل عن والديه و أخوته و اقرباؤه و جيرانه\nمرة أخرى هذا يشبه الزواج وبالتالي فأنت تحتاج لمعرفة واسعة و من أشخاص متعددة عن هذا الشخص\n\nثالثاً\nفكر دائماً في أسوأ السيناريوهات لأنك ستمر بأوقات صعبة جداً وسيكون عليك اتخاذ قرارات آصعب و خاصة عندما يتعلق الأمر بالمال وعندها تختلف تماما تصرفات البشر و قناعاتهم الشخصية\nحياة رائد الأعمال تشبه ركوب القطار الأفعواني و يوم حتبقى في اعلى نقطة و يوم ثاني حتنزل لسابع أرض و بالتالي انت محتاج ناس تقدر تثق فيهم\nفكر ايه اللي حيحصل لو اطلقت المنتج و لقيت الأقبال ضعيف ؟\nناس كثير ساعتها حيبتدوا يشككوا في قدراتك و تقل ثقتهم فيك و بالتالي لازم تحدد مين الناس اللي حيكونوا جنبك في السراء و الضراء فعلياً\n\nرابعاً\nانسى تماماً حب الذات لأن ريادة الأعمال تحتاج للمرونة و البيزنس موديل ممكن يتغير كثير وبالتالي لكي تنجح ستحتاج ان تحيط نفسك بفريق عمل لديه خبرة و ذكاء أكثر منك و كذلك لابد ان تشجعهم على التحدث بحرية  فأنت تريد من يقولون لك لا و يختلفون معك لا من سيوافقونك في كل شيء حتى ولو كان خاطئا\nخليك دائما مرحب بالنقد و وجهات النظر المختلفة لأن في النهاية انت محتاج الناس اللي بينظروا للبيزنس بنفس الطريقة يعني انت و الفريق لازم تنسوا تماما فكرة حب الذات و تتعاملوا فقط من منطلق ماهو افضل للشركة \nلا تتضايق من هؤلاد الذين لهم وجهة نظر مختلفة و قد يبدوا اختلافهم معك على انه هجوم شخصي عليك و تذكر دائما انتم في نفس المركب\nابحث بدقة عن هؤلاء الذين يغطون نقاط ضعفك لكن دايما اختار \nAttitude over aptitude","created_time":"2015-01-25T07:18:44+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_885359084837134","from":{"name":"Amjad Mashaal","id":"10210954655734032"},"message":null,"caption":"reddit.com","description":"I'm a founder of a small startup, we're only 2 people, I'm the developer and my pal who co-founded the startup is a designer. Few months ago we...","created_time":"2015-01-24T13:29:19+11:00","total_likes":2,"total_comments":10},{"id":"172338516139198_885665534806489","from":{"name":"Rafael Adel","id":"10155242150027122"},"message":"What's the best book to learn algorithms for a web developer ? \nI kinda narrowed it down to three books (any other recommendations are welcome) :\n\n1- Introduction to Algorithms, 3rd Edition\nhttp://www.amazon.com/Introduction-Algorithms-3rd-Thomas-Cormen/dp/0262033844/ref=sr_1_1?s=books&ie=UTF8&qid=1422128070&sr=1-1&keywords=introduction+to+algorithmsm\n\n2- The Algorithm Design Manual\nhttp://www.amazon.com/Algorithm-Design-Manual-Steven-Skiena/dp/1848000693/ref=pd_sim_b_1?ie=UTF8&refRID=0WSWJSYNH2S8TFVTYTNP\n\n3- Algorithms (4th Edition)\nhttp://www.amazon.com/Algorithms-4th-Edition-Robert-Sedgewick/dp/032157351X/ref=pd_sim_b_5?ie=UTF8&refRID=0WSWJSYNH2S8TFVTYTNP","caption":null,"description":null,"created_time":"2015-01-25T06:36:11+11:00","total_likes":5,"total_comments":4},{"id":"172338516139198_885661014806941","from":{"name":"Adel K. Khalil","id":"10158375948495584"},"message":"Help needed! \n\nOn iOS or Android is there a way to create push notifications that have a custom view (i.e. custom actions like Download Update, Confirm...etc.) And i need to push these notification to users on certain times they can be local notifications or pushed from internet the important thing is that i can get the custom view even if the app is closed.\n\nAny idea how?","caption":null,"description":null,"created_time":"2015-01-25T06:20:24+11:00","total_likes":0,"total_comments":17},{"id":"172338516139198_884686601571049","from":{"name":"Mohamed Hashem","id":"1387228811341413"},"message":"as mentioned in this topic the new browser for windows 10\n- Powered by a new rendering engine\n- loads the IE11 engine for legacy enterprise web sites when needed\n- standards support and roadmap can be found at http://status.modern.ie.","caption":"blogs.msdn.com","description":"Yesterday, we announced that Windows 10 will ship with a brand new browser, codenamed “Project Spartan.” Designed for Windows 10, Spartan provides a more interoperable, reliable, and discoverable experience with advanced features including the ability to annotate on web pages, a distraction-free rea…","created_time":"2015-01-23T07:25:29+11:00","total_likes":4,"total_comments":3},{"id":"172338516139198_886691678037208","from":{"name":"Ahmed Magdy","id":"10154728972235376"},"message":"Pluralsight just became an online learning MONSTER\n\nKeeps acquiring e-learning websites","caption":"codeschool.com","description":"I’m happy to announce Code School has joined the amazing team at Pluralsight. Code School started less than four years ago with the mission of creating the best way to ...","created_time":"2015-01-27T08:16:35+11:00","total_likes":5,"total_comments":0}]}