{"posts":[{"id":"172338516139198_934259696613739","from":{"name":"Mohammad Tayseer","id":"10154965677956341"},"message":"Leaflet Routing Machine is an easy, flexible and extensible way to add routing to a Leaflet map\n\nFeatures\n\n- Standard Leaflet control, with Leaflet look and feel\n- Routing from start to destination, with possibility of via points\n- Add, edit and remove waypoints through both address input and using the map\n- Multiple language support\n- Support for several routing engines","caption":"liedman.net","description":null,"created_time":"2015-05-01T06:58:11+10:00","total_likes":5,"total_comments":6},{"id":"172338516139198_934592836580425","from":{"name":"Osama Soliman","id":"709206249239999"},"message":"Just wondering ... what happens if two persons commented in the same time -same ms- or even smaller unit ? .... how facebook db or any other db will handle this ?","caption":null,"description":null,"created_time":"2015-05-02T03:12:19+10:00","total_likes":4,"total_comments":17},{"id":"172338516139198_934882456551463","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":null,"caption":"youtube.com","description":"From Fluent 2015: Kyle Simpson is an Open Web Evangelist from Austin, TX, who’s passionate about all things JavaScript. He’s an author, workshop trainer, tec...","created_time":"2015-05-02T22:48:09+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_934992589873783","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"medium.com","description":"Thirty thoughts about building startups","created_time":"2015-05-03T04:19:03+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_934993079873734","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"+50 BUSINESS & REVENUE MODEL EXAMPLES","caption":"boardofinnovation.com","description":"How to select a new business model? We’ve handpicked dozens of remarkable revenue model examples. On this page you’ll find a free download of +50 cases.","created_time":"2015-05-03T04:20:12+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_934994023206973","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"thinkapps.com","description":"Keeping an existing customer is much cheaper than acquiring a new customer. Here’s a guide to analyzing customer churn in order to improve retention.","created_time":"2015-05-03T04:23:35+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_935000623206313","from":{"name":"Mohammad Fouad","id":"10154777096910845"},"message":"Anyone here going isA?","caption":"Cloud Weekend 2015","description":"Egypt's Biggest Cloud Computing and Big Data summit\n\nCloud Weekend 2015 is the 3rd iteration of the Cloud Weekend series launched in 2012. This year we will focus on the emerging trends in Cloud Computing and Big Data  inspired by the latest advances concerning the infrastructure, operations, analytics and available services throughout the global network.\n\nCloud Weekend 2015: We Talk Cloud! \n\nCloud Weekend 2015 brings together a strong array of the CIOs and CTOs of the top Cloud Computing and Big Data players in addition to architects, senior engineers, IT leaders across the board starting with business, to academia and governmental bodies. \n\nSpeakers at Cloud Weekend 2015 are regional and international industry thought leaders from Telecom Egypt (TE), Dell, EMC2, IBM, Microsoft, Oracle, SAP,Vodafone, TeraData, Cloud11, and Google.\n\nCloud Weekend 2015 Structure: \n\n-- Keynotes: Top Notch Speakers from all around the world covering the most advanced technologies from the world\n\n-- Panel Discussions: Top leaders in each track will be discussing a hot topic in each category, sharing their opinions and vision.\n\n-- Sessions: Through 30 minute session, our speakers will cover the latest technologies and introduce their products\n\n--Workshops: Parallel workshops will be introduced to implement the different technologies and get hands-on the different products.\n\n-- Exhibition: Summit sponsors will have a space to have their representatives communicating with our audience.\n \nWhy should you attend?\n\nThe Conference will not only impart valuable knowledge, it will also help you inspire and connect with peers, customers, partners, prospective vendors and colleagues from global multi-national organizations in more profitable and refreshing way. When you attend CW15 you will:\n\n- Become a recognized face/name in Cloud space.\n\n- Develop and share ideas, innovation and knowledge on Cloud Computing and Big Data best practices.\n\n- Meet like-minded cloud professionals and make new business connections. \n\n- Meet new companies and people in the cloud space and build mutually-beneficial business relationships.\n\nWhat’s New this Year?\n\nTo ensure that we grow with and adjust to changing industry needs and priorities, we have made some notable changes while simultaneously moving the brand forward to acknowledge the differing maturity stages, investment levels and adoption phases.\n\n- More keynotes and bellwether speakers from leading international companies.\n\n- World-class panel discussions on the main topics of the conference.\n\n- Cloud Exhibition and on-site workshops for some hands-on experience with latest technologies.\n\n- More networking activities, and group discussions, and way more fun!\n\nHow to attend Cloud Weekend 2015?\n\n• Visit http://bit.ly/cloudweekend\n\n• Create an @[249167708461403:274:Eventtus] account or sign up with Facebook then click on \"Get ticket\" to apply\n\n• Wait for an approval/rejection email with a confirmation code in case of approval\n\n• Buy your ticket from Vodafone stores. Vodafone branches selling our tickets: www.eventtus.com/wheretopay\n\nFollow our social media for speakers and agenda announcements on: twitter @cloudweekend - instagram @cloudweekend \n\n#CWCairo\nWe Talk Cloud!\nwww.cloudweekend.com","created_time":"2015-05-03T04:50:25+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_935017136537995","from":{"name":"Ahmed Bahnasy","id":"1270319029713569"},"message":"كل الناس اللي مهتمه بالويب \nالتفاصيل كلها نزلت علي ال event \nhttps://www.facebook.com/events/841375902597860/\n\nوالناس اللي هتحضر تقدر تسجل من هنا \n\nhttp://goo.gl/0TrXEo","caption":"المؤتمر المصري الاول لمطوري الويب","description":"ال web؟؟\nفي ناس كتيير اوي بتعرف web كويس في مصر\nبس برده في ناس كتيير عاوزين يتعلموا و يدخلوا المجال ويبدعوا فيه ومش عارفين يبداو منين !!!\n\nوفي ناس كتيير برده واقفبن عند نقطه معبنه و مش عارفين\nيكملوا ويطوروا من نفسهم ازاااااااي !!!!\n\nوفي برده ناس عاوزين يوصلوا علمهم و خبرتهم للناس دي\n\nتخيبل بقي ؟؟؟؟؟؟؟؟؟؟؟\n\nلو جمعنا الناس دي كلها في مكان واحد وخليناهم يتفاعلوا مع بعض في حاجه عمليه\n\nيعني لو مثلا واحد شغال web developer في شركه كبيره يجي ويشنغل معاك في project فعلي\n\nولو مثلا web designer يجي ويعلمك ازاي الشغل بيمشي جوه الشركه وازاي تتعامل مع العملاء\n\nده غيير ان ممكن ناس تكلمك عن التكنولجيا الجديده اللي ظهرت في ال web وازاي تقدر تستفيد منها\n\nطيب ايه ال topics اللي هنتكلم فيها \nاول حاجه هنتكلم عن الفرق بين لغات البرمجه للويب زي ال php ,JSP,ASP.NET, و هكذا\nوبعدين هنتكلم عن ازاي تقدر تعمل plugin بنفسك و اي حد في العالم يقدر يستخدمه بعدك\nوهنتكلم عن ازاي ال web development بيتم في الشركات الكبيره وايه دور \nال web developer جوه الشركه بالظبط وايه هي الحاجات اللي لازم تكون عارفها عشان تقدر تشتغل في شركه كبيره \nوهكذا بالظبط في ال web design \n\nطيب واللي عاوز يشتغل freelancer ؟؟؟؟؟؟؟؟؟؟؟؟؟؟\nدول كمان مش ناسينهم وهنتكلم عن ال freelancing خطوه خطوه\n\nده غير ان احنا هنتكلم عن ال tools الجديده اللي ظهرت في الويب وازاي تقدر تستخدمها \nوده غير برده topics كتييير جدا زي \nsecurity\ncloud-computing \nbootstrap \n\nوالناس اللي هتتكلم في المجالات دي عندهم خبره سنين في المجال ده منهم اللي شغال في شركات ومنهم اللي شغال freelancer وحابين انهم ينقلوا خبرتهم ليكم \nوهنزلكم الاجنده فيها كل حاجه بالتفصيل \nو هتعرفوا مين ال speakers اللي موجوده معانا \nطيب جميل اوي !!!\nامتي بقي الكلام ده وهيبقي فين ؟؟؟\nالميعاد هيكون يوم 8و9 مايو ( الجمعه والسبت الجايين) ان شاء الله \nوالمكان هيكون في قاعه الربع في شارع المعز- الحسين - القاهره القديمه\n\nطيب والتسجيل ؟؟؟\n\nده لينك التسجيل :\n \nhttp://goo.gl/0TrXEo","created_time":"2015-05-03T05:57:05+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_935062229866819","from":{"name":"Aya E Mahmoud","id":"781082622041370"},"message":"I'm trying to add a button to google map v2 #android, but whenever I add the button code to the map fragment, the map loads without the button. I tried putting the button code inside a LinerLayout but the same thing happened. can someone help me please?!","caption":null,"description":null,"created_time":"2015-05-03T07:17:04+10:00","total_likes":2,"total_comments":2},{"id":"172338516139198_935093929863649","from":{"name":"Ahmed Al-Amir","id":"10155179919799180"},"message":"Do we have military technology geeks in here?","caption":"medium.com","description":"And that’s not the old munition’s only new trick","created_time":"2015-05-03T09:17:17+10:00","total_likes":2,"total_comments":6}]}