{"posts":[{"id":"172338516139198_1091063977599976","from":{"name":"Ahmed Jadelrab","id":"1664976033803696"},"message":"What is the best hosting for personal use?\nFrom where to buy a domain is it better to buy it from the same hosting or from another service like name.com or other?\n\nI am looking for personal hosting to host a personal blog for me to write technical articles or anything it might interest me, Thanks in advance.","caption":null,"description":null,"created_time":"2016-03-04T13:57:57+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1090585770981130","from":{"name":"George Leon","id":"10155084969830747"},"message":"لو سمحتم يا جماعة حد عنده اى خبرة فى التعامل مع الضرايب \nاو عنده فكرة عن طريقة تعامل الضرايب مع الفريلانسر","caption":null,"description":null,"created_time":"2016-03-03T18:54:23+11:00","total_likes":3,"total_comments":11},{"id":"172338516139198_1090280194345021","from":{"name":"Mohamed A. Othman","id":"1268007273278424"},"message":"أيه الخطوة إللي بعد تعلم أساسيات الـ JavaScript ومنين اجيب problems كتير أحلها ؟ ياريت تكون الأجابة مفصلة بخطوات أمشى عليها مايبقاش كلام عام، شكراً.","caption":null,"description":null,"created_time":"2016-03-03T04:43:05+11:00","total_likes":6,"total_comments":13},{"id":"172338516139198_1091289187577455","from":{"name":"Kareem Badawy","id":"1206517932798772"},"message":"don't miss it","caption":null,"description":"هتستفد ايه من حضور Imagine Cup Academy؟\n- هيكون فيه ناس متخصصين منهم ناس من Microsoft هيكلمو معاكو على حاجات كتير ممكن تكونو عايزين تعرفوها.\n-هيكون عندوكو الفرصة أنكو يكون ليكو Mentor  فى المشروع بتعكو ودة بيبقى شخص متخصص لكل فريق عشان يرشدو ويساعد ال فريق أنه ينجح. \n- موفرين ليكو المواصلات، buses الجامعة البريطانية هتوصلكو من مكان ما انتو سكنين  لحد باب الجامعة وترجعكو تاني كمان.\n-هتتعلمو حاجات كتير جديده…\n*المؤتمر ده لكل طلاب مصر وكل الجامعات!\n*التسجيل عن طريق اللينكات في-description بتاع الافنت وتابعو الصفحة لمعلومات \nأكتر: https://www.facebook.com/events/550986975082558\n\nWhat are the benefits of attending Imagine Cup Academy?\n-There will be a lot of experts and Microsoft Professionals to talk about many things that you might want to know.\n-You’ll get the chance to have a mentor to help you with your project that is dedicated to your team having a goal that is to help you Win the Imagine Cup competition.\n-Transportation will be provided by the BUE busses, will transport your from your home to the university and the opposite.\n-You’ll learn a lot more things…\n*The conference is open for Bueians and out comers too!\n*The registration is through the links provided in the description of the event, for more information check the event page: https://www.facebook.com/events/550986975082558\n\nShare and invite everyone!","created_time":"2016-03-05T00:20:45+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1091180074255033","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"فى هوجة لغات البرمجة الجديدة، واحد عامل لغة برمجة جديدة -واتمنى يكون عاملها تريقة- بتستخدم ال emojies كـ Keywords","caption":"emojicode.org","description":"Emojicode is an open source, high-level, multi-paradigm, object orientated programming language consisting of emojis.","created_time":"2016-03-04T19:54:48+11:00","total_likes":25,"total_comments":7},{"id":"172338516139198_1091426850897022","from":{"name":"Ahmed Van Mostafa","id":"10155038428386081"},"message":"Anyone here is building his presentations with sozi and InkScape?","caption":null,"description":null,"created_time":"2016-03-05T05:48:14+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1091373750902332","from":{"name":"Mariam Maarouf","id":"10154848350731638"},"message":"Does anyone here have any experience with Google Summer of Code? Newbie here, and would love to get some (general) pointers while I lurk on #gsoc.","caption":null,"description":null,"created_time":"2016-03-05T03:35:57+11:00","total_likes":7,"total_comments":3},{"id":"172338516139198_1091512314221809","from":{"name":"Mohamed Fergany","id":"10212218310718439"},"message":"ازيكم يا شباب :] عندي استفسار بما اني معنديش اي خبرة في موضوع الاتصالات دا .\n\nهو ازاي لما بتصل من سكايب علي التليفون بيظهر ( private number ) ومرات بيظهر رقم ( 00 ) ومرات بيظهر ( 0 ) بس \nومرات بيظهر رقم تليفون جوه مصر . ارقام فودافون . معني كدا ان لو الشركات التانية بتقدر تهاندل اختيار الرقم ان ممكن حد يستخدم رقمي من شركة تاني ؟","caption":null,"description":null,"created_time":"2016-03-05T08:55:26+11:00","total_likes":4,"total_comments":21},{"id":"172338516139198_1091489814224059","from":{"name":"Morad Edwar","id":"10212482712403270"},"message":":'D","caption":null,"description":"The last and best programming book you'll ever need ;) #humor Via https://twitter.com/ThePracticalDev","created_time":"2016-03-05T08:00:46+11:00","total_likes":25,"total_comments":4},{"id":"172338516139198_1091596724213368","from":{"name":"Muhammad Al Rabbani","id":"436443206686932"},"message":"I found this article interesting, and thought I would \n\nThis is Microsoft admitting its mobile strategy was a failure\nOr, to be more accurate about it, it’s the final page in the chapter labeled “Windows Phone”. Having admitted that the Nokia purchase was a bad one, having admitted that Windows Phone wasn’t the success they wanted it to be, Microsoft is now (finally!) looking to recircle the wagons. The Lumia phones simply weren’t selling, and while I certainly know a number of people personally who love their Windows Phone, almost all of them are either Microsoft employees or relatives of Microsoft employees. Sales figures certainly seemed to agree with my understanding of consumers’ dislike of the devices, compared to iOS and Android.\n\n","caption":"blogs.tedneward.com","description":"Xamarin: Next Steps Posted on Feb 24, 2016 #Industry #Java #C# #F# #Visual Basic #C++ #Swift #Objective-C #JVM #CLR #LLVM #iOS #Android #Windows #Mac OS tl;dr By now, everybody in the tech industry has heard that Microsoft and Xamarin have come to terms and Microsoft will acquire the cross-compiling…","created_time":"2016-03-05T12:19:19+11:00","total_likes":0,"total_comments":2}]}