{"posts":[{"id":"172338516139198_1156117271094646","from":{"name":"Taha Amin","id":"10154850341220590"},"message":"http://stackoverflow.com/research/developer-survey-2016","caption":"stackoverflow.com","description":"What do devs do. What do devs want. Read the results of the largest, most comprehensive developer survey ever conducted.","created_time":"2016-06-05T08:13:02+10:00","total_likes":6,"total_comments":0},{"id":"172338516139198_1155984307774609","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Finally a website only Focusing on Frontend Courses.","caption":"frontendmasters.com","description":"Become a master in front-end with 20+ advanced video training courses featuring experts such as Douglas Crockford, Kyle Simpson and Estelle Weyl.","created_time":"2016-06-05T03:55:17+10:00","total_likes":8,"total_comments":2},{"id":"172338516139198_1155365147836525","from":{"name":"عمر أمين","id":"10158307172615634"},"message":"anyone worked on face detection problem before ?\n\nI'm trying to search for a diverse dataset that contains different faces sizes, illumination diversity .. etc (i've found some of them already), but all what I've found up-till now are easy datasets (faces are almost the same size and the same pose).\n\nalso i'm searching for hard negative examples (pictures that look like faces but aren't actually faces) to make sure that the detector is robust, or retrain if necessary.\n\nThank you","caption":null,"description":null,"created_time":"2016-06-04T03:49:34+10:00","total_likes":10,"total_comments":3},{"id":"172338516139198_1154947474544959","from":{"name":"Ibrahem A'mer","id":"10208568946200728"},"message":"- Can we consider the software engineering career as a mathematically-dependent major? \n\n- If you're to recommend one must-have mathematical course, what would it be? Any recommended sources? (of course for SE or CS related concepts)","caption":null,"description":null,"created_time":"2016-06-03T11:28:45+10:00","total_likes":3,"total_comments":9},{"id":"172338516139198_1155201177852922","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"Anybody here ran his/her own mail server before? I manage a few hosting accounts for friends and recently I moved from managed VPS to digitalocean ... Everything is running perfectly except for emails ...\nI did a lot of research ... The options I found was either:\n1- Use a third party service like https://www.mailcheap.co/ ... Seems to fit exactly what I need but it's expensive ($24/mo)\n2- Run my own mail server using Mail-In-A-Box on digitalocean. It will cost nearly $120/yr but I read a lot of articles and discussions on reddit and hosting forums discouraging running your own server. https://www.digitalocean.com/community/tutorials/why-you-may-not-want-to-run-your-own-mail-server.\n3- Use a free service like Zoho mail but it is limited to one domain per account and 10 email addresses per account. I can create multiple accounts but I don't want to do that.\n\nI would like to get your input if you have any experience.","caption":"digitalocean.com","description":"When setting up a web site or application under your own domain, it is likely that you will also want a mail server to handle the domain's incoming and outgoing email. While it is possible to run your own mail server, it is often not the best option f","created_time":"2016-06-03T22:35:13+10:00","total_likes":1,"total_comments":11},{"id":"172338516139198_1156394377733602","from":{"name":"Morad Edwar","id":"10212482712403270"},"message":"Facebook is removing the messaging capability from its mobile web application, according to a notice being served to users: “Your conversations are moving to Messenger,” it reads. Welcome news to the millions like me who switched to the web app in order to avoid Messenger in the first place!","caption":"social.techcrunch.com","description":"Facebook is removing the messaging capability from its mobile web application, according to a notice being served to users: \"Your conversations are moving to..","created_time":"2016-06-05T21:04:52+10:00","total_likes":5,"total_comments":5},{"id":"172338516139198_1157169010989472","from":{"name":"Omar Aysha","id":"10154356908097267"},"message":"Any way to save all interactions on an FB page you manage? (posts, videos, photos, comments, shares, messages, fans)","caption":null,"description":null,"created_time":"2016-06-07T01:32:56+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1157372877635752","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"youtube.com","description":"Playbuzz is a 3 years old startup with hundreds of millions of page views per month. We are able to serve this scale with less than 5 servers in production. ...","created_time":"2016-06-07T09:03:18+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1157361987636841","from":{"name":"Hany Essam","id":"1342489319142943"},"message":"Anyone used Chromebook OS for software development usages !?","caption":null,"description":null,"created_time":"2016-06-07T08:36:04+10:00","total_likes":2,"total_comments":3},{"id":"172338516139198_1157658777607162","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":"IPSC is a very cool online annual programming contest. The cool thing about it is that problems are not just algorithmic. I remember some included looking at the waveform of a given audio file, a problem with no statement, debugging some HTTP headers of the problem's page, writing a program to play a JS game, etc.. You can have a look on the problems archive and you'll understand what I mean. Also you can join the contest as a team. Here's the invitation email :\n\n\"Your favorite programming competition is back for its 18th year! We excitedly invite you to compete in IPSC 2016.\n\nInternet Problem Solving Contest is an online programming competition for teams of up to three people. The problems range from easy to very hard, so everyone is welcome to compete. We also have separate ranklists for individuals and secondary school students. You can use any programming language, or even solve problems by hand. Most of the problems are algorithmic in nature, but IPSC is particularly known for its unusual and fun problems.\n\nIPSC 2016 will take place on Saturday, 18 June 2016 from 11:00 to 16:00 UTC. Visit http://ipsc.ksp.sk/ to register, either as an individual or as a team of up to three people.\n\nWhile you're waiting for 18 June 2016, you can also visit http://ipsc.ksp.sk/train/ to practice on problems from previous years of IPSC.\n\nIf you like IPSC, help us spread the word! Tell your friends, classmates, coworkers, internet strangers, et cetera.\n\nGood luck in the contest, and have fun!\n\nIPSC Organizing Team\n\"","caption":null,"description":null,"created_time":"2016-06-07T20:52:47+10:00","total_likes":6,"total_comments":1}]}