{"posts":[{"id":"172338516139198_1087892381250469","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":"I have an idea. There are lots of cool and interesting tech people to follow on twitter, blogs .. etc. Why don't we share some of those accounts with a small summary of who they are and what do they usually tweet about. Maybe we can find some interesting people to follow.\nAs an example I'd start by:\n\n- @chrishunt : A github engineer, one of the best speakers I've ever seen. I started using tmux after watching one of his talks. His podcast is nice also. Other than tech, he has some talks on memory and solving rubik's cubes. Watch his talks.\n\n- @Nick_Craver : A stackoverflow developer and sys admin. I've mentioned him before. He tweets a lot about SO's architecture and stats and he's currently writing a series of blog posts about SO's architecture, hardware, .. ( https://trello.com/b/0zgQjktX/blog-post-queue-for-stack-overflow-topics ).\n\n- @fatih : Software Engineer at Digital Ocean and the developer of the famous vim-go plugin. Most of his tweets are about Go.\n\n- @antirez : The creator of redis.\n\nThose are the people I have in mind right now. Whenever I remember someone new I'll add him in a comment.","caption":null,"description":null,"created_time":"2016-02-28T08:22:43+11:00","total_likes":25,"total_comments":6},{"id":"172338516139198_1092038044169236","from":{"name":"Sherif Omar","id":"10158356909500092"},"message":"Seems this issue is more than just CIB","caption":"www.dailynewsegypt.com","description":"credit card - CIB prohibited international credit card transactions as trial before decision is officially implemented, expects Reda","created_time":"2016-03-06T08:39:45+11:00","total_likes":3,"total_comments":1},{"id":"172338516139198_1091176364255404","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"امازون طلعت الجهاز ده النهاردة، عبارة عن كمبيوتر بتتحكم فيه بالصوت بس من خدمة زى سيرى اسمها أليكسا، بيقدر يتحكم فى اى حاجة سمارت فى البيت، الإضاءة المكيف، بيشغل موسيقى من سبوتيفاى و يطلب اكل من دومينوز بيتزا :D ممكن نشوف الفيديو اللى فى البيدج حاجة جميلة <3","caption":"amazon.com","description":"Online shopping from a great selection at Echo Dot Store.","created_time":"2016-03-04T19:38:14+11:00","total_likes":25,"total_comments":4},{"id":"172338516139198_1092265144146526","from":{"name":"Anas Rabei","id":"621823724675667"},"message":"A custom Django technical error template that puts a related stackoverflow search link under the exception message.","caption":"github.com","description":"django-stackoverflow-trace - Django error page w/ a stackoverflow search link.","created_time":"2016-03-06T20:08:47+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1090974360942271","from":{"name":"Hosam Aly","id":"1348336588561390"},"message":"الوضع القانوني الضريبي للعامل الحر في مصر (freelancer)\n\nقانونا، صفتك \"عامل\" حر. استبدل بكلمة \"عامل\" الوصف المهني بتاعك: طبيب حر، مهندس حر، إلخ.\n\nقانونا، العامل الحر يخضع لضريبة الدخل مثل كل عامل أو موظف في مصر. ضريبة الدخل في مصر مقسمة إلى شرائح حسب الدخل. تنطبق تلك الشرائح على جميع الأفراد بنفس القيمة. أحدث ما أعلم عنها هي تعديلات 2014، حيث تخصم مدفوعات التأمينات الاجتماعية، ثم تكون الـ 12 ألف الأولى معفاة من الضرائب، ثم شريحة 10% على الـ 25 ألف التالية، ثم 15% على الـ 15 ألف التالية، ثم 20% حتى 250 ألف، ثم 25% حتى مليون جنيه. وذلك على الدخل السنوي.\n\nقانونا، كل صاحب دخل مستقل مطالب بتقديم إقرار ضريبي سنوي في الربع الأول من كل عام ميلادي. ينطبق ذلك على العامل الحر وكذلك على الموظف إن كان له دخل زائد عن راتبه، وكذلك العاطل إن كان له دخل (مثل إيجار عقار يمتلكه). باختصار، كل فرد مطالب بالإقصاح عن دخله، إلا أن الشركات تقوم بذلك نيابة عن موظفيها.\n\nمن حق مصلحة الضرائب أن ترفض الإقرار وتتهم المقر بالكذب فيه، أو أن تتهم شخصا بالتربح دون إقرار دخله، كأن تتهم طبيبا لديه عيادة مغلقة بأنه يتربح منها دون أن يعلن ذلك، أو تتهمه بالحصول على دخل أكبر مما أعلن عنه. إلا أن تعديلا قانونيا منذ 10 سنين أو أكثر ألزم مصلحة الضرائب بإثبات ادعائها (وكان قبل ذلك يلزم المدعى عليه بإثبات صحة إقراره أو إثبات عدم تربحه، وكان يتيح لمأمور الضرائب تقدير الدخل جزافيا). تستطيع مصلحة الضرائب إثبات دخل المواطن بتتبع معاملاته البنكية، أو بقانون \"من أين لك هذا\" إن كان له دخل ضخم.\n\nعلى حد فهمي تنطبق هذه القوانين على الشركات الفردية أيضا، حيث تعامل معاملة الفرد. وفي الحالتين (العامل الحر والشركة الفردية) تكون الضريبة على الدخل الصافي، وذلك بأن تقدم فواتير المصاريف (مثل الإيجار أو اشتراك الإنترنت)، فتخصم من الدخل قبل حساب الضريبة، طالما كانت تلك المصاريف ضرورية للنشاط. (مثلا لا تقبل فاتورة إيجار عيادة من مهندس.) ولكن يجب الحذر في حالة الفواتير من دول أجنبية، حيث يجب تسوية ضريبة المبيعات عنها قبل تقديمها.","caption":null,"description":null,"created_time":"2016-03-04T10:40:03+11:00","total_likes":22,"total_comments":5},{"id":"172338516139198_1091802980859409","from":{"name":"Islam Isamm","id":"10155486641237971"},"message":null,"caption":null,"description":"موقع codeschool فتح كورساته free خلال يومين من 4 ل 6 مارس \nموقع codeschool  يعتبر من افضل المواقع فى تعلم البرمجه و خصوصا ال \njavascript   CSS   HTML  Python  ruby ios (objective-c)\nDatabase \n\nالحق سجل من هنا\n و شير لغيرك  \n\n#Codec \n\nhttps://www.codeschool.com/free-weekend-confirm","created_time":"2016-03-05T22:30:13+11:00","total_likes":8,"total_comments":2},{"id":"172338516139198_1092157654157275","from":{"name":"Muhammed Eltabakh","id":"1268731539846598"},"message":"المشكلة دي بتقابلني ونا بسطب virtual environment python  جربت pip وconda و home brew ونفس المشكلة علي بايثون 2.7.11 وبايثون 3.5 وكنت شغال علي os x yosemite وبعدين عملت أبجريد ل os x elcapitan وهي هي نفس المشكلة","caption":null,"description":null,"created_time":"2016-03-06T14:50:16+11:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1092445004128540","from":{"name":"Muhammad Gamal","id":"1195975020515559"},"message":"Question for Java Developers : \nWhen Building Project in Netbeans on Windows it Clearly build without any issues \nWhen Building the Same Project in Netbeans on Ubuntu it Said : \nNo Base JDK Package will use System JRE .\nand Stop Packaging Process...\nHow to Set the Base JDK Directory  or any Different way to Packaging (.deb) or (.rpm) in Eclipse or any JavaFX IDE ? \nNotice * : \nJDK Installed Correctly on Ubuntu .\nAny Help please... ThanQ","caption":null,"description":null,"created_time":"2016-03-07T02:53:19+11:00","total_likes":2,"total_comments":4},{"id":"172338516139198_1092088854164155","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":"أهلآ، \nلاحظنا ان فيه اسئلة بتتكرر فى الجروب كل شوية و فكرنا ان لو فيه مكان كويس نجمع فيه الأسئلة دى و الإجابات عليها هتبقى احسن من اننا نكرر الكلام تانى، اكتر حاجة straight forward اننا نعمل ويكى تجمع فيها كل الكلام ده، فعملت الrepository دى على github، هى دلوقتى لسة فاضية لأنها لسة معمولة من ربع ساعة، لو لاقيت ان فيه بوست بيتكرر كل شوية ياريت تحط محتواه فى الويكى بتاعة الrepo دى او تبعت لينك البوست ده لحد من الأدمنز يضيفه","caption":"github.com","description":"FAQ - A set of frequently asked questions in Egyptian geeks group, checkout WIKI for them","created_time":"2016-03-06T11:06:03+11:00","total_likes":25,"total_comments":3},{"id":"172338516139198_1092945067411867","from":{"name":"Morad Edwar","id":"10212482712403270"},"message":null,"caption":"Alex Geeks Meetup ( Second Meeting )","description":"Alex Geeks Meetup ( Second Meeting )\n--------------------------\nWe will meet again but we will have a topic to talk about this time.\nPlease if you are coming vote for the topic which you want to talk about.\nDate : 19/3/2016\nLocation : @[1632681443678835:274:Flux Coworking Space]\nPlease invite your Alexandrian friends.","created_time":"2016-03-07T23:00:09+11:00","total_likes":2,"total_comments":0}]}