{"posts":[{"id":"172338516139198_1206135489426157","from":{"name":"Ahmed Mostafa","id":"1145278385599688"},"message":"hello every one,\nI'm  a .net developer and interesting in node js I just  need to know what's the benefits of node js over . net ?","caption":null,"description":null,"created_time":"2016-08-17T07:30:19+10:00","total_likes":1,"total_comments":5},{"id":"172338516139198_1205897126116660","from":{"name":"Michael Henry","id":"10155149755210955"},"message":"Hello Geeks, Almost all of us in the Software Development industry have been hit by a client request to make an Uber for X project. I got over 10 requests now for that type of projects.\n\nFrom a decision maker perspective I found that to achieve this project in a proper professional way we have to build it from scratch, and sure this will cost a lot of time and money. (that's a lot for the client to take).\n\nSo, Am sure that 100's of you faced the same request but with different flavors, Then did anyone of you worked on a similar project that are welling do a rebuilt copy or maybe a white label and re-sell it to another client?\n\nIf not, Anyone Interested in building this project and put it here for re-use against a decent fees (sure it will be much less to customize over to build it from scratch again).\n\nI did checked all the Indian options available in the market, but for sure this option is not on the table and I will not gonna talk about the Indian software :)\n\nThoughts?","caption":null,"description":null,"created_time":"2016-08-17T01:10:54+10:00","total_likes":8,"total_comments":3},{"id":"172338516139198_1206811189358587","from":{"name":"Osama Soliman","id":"709206249239999"},"message":"How to compare \n2.60 GHz dual core processor to\n2.00 Ghz quad core one ?","caption":null,"description":null,"created_time":"2016-08-18T01:04:11+10:00","total_likes":2,"total_comments":3},{"id":"172338516139198_1206959796010393","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"blog.nimbleci.com","description":"There are some very good articles and posts out there which describe in fantastic detail how Docker works and how easy it is to start...","created_time":"2016-08-18T04:18:57+10:00","total_likes":6,"total_comments":0},{"id":"172338516139198_1204142109625495","from":{"name":"Mustafa Dagher","id":"10212394020589663"},"message":null,"caption":null,"description":null,"created_time":"2016-08-14T20:16:47+10:00","total_likes":1,"total_comments":16},{"id":"172338516139198_1201525886553784","from":{"name":"Mohamed Fergany","id":"10212218310718439"},"message":"حد عنده المشكلة دي ؟\nمش عارفن نعمل كونكت علي السيرفرات ب SSH","caption":null,"description":null,"created_time":"2016-08-12T01:33:44+10:00","total_likes":25,"total_comments":25},{"id":"172338516139198_1205491342823905","from":{"name":"Peter Yanni","id":"10155102432759183"},"message":"Dear UI /  Frontend Developers,\ndo you have any recommendations to Vector Map Library integrated or compatible with AngularJs (1.x) and have the flexibility to easily add / bind data to it ?","caption":null,"description":null,"created_time":"2016-08-16T10:43:25+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1207078422665197","from":{"name":"Ahmed M. Araby","id":"10154630737934263"},"message":null,"caption":"softwarefreedomday.org","description":null,"created_time":"2016-08-18T07:15:59+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1207004706005902","from":{"name":"Mohamed Bakry","id":"1634378429912384"},"message":"Senior Full Stack Developer (Node.js)\nJob Type: Full Time\n\nAbout the Job\nWe are undergoing a pretty awesome transformation, and are looking for people with a true engineering mind-set. We are solving challenging problems, building an entrepreneurial, product centric and mobile first engineering culture and are seeking passionate technologists.\nOur ideal candidate is an experienced developer and team player who enjoys coding, is reliable, and flexible to change while being able to coolly handle multiple priorities. An above average attention to detail with the ability to work with limited supervision as a member of a small, fast moving team is a must.\n\nResponsibilities \nDevelop and support multiple Single Page Applications, Node.js APIs, backend services and data stores.\nIterative platform development, including troubleshooting and performance optimization.\nDocumentation\n\nJob Requirements\n2-5 years of experience.\nExperience with Test Driven Development\nExpert knowledge of Node.js and experience in a production environment\nExpert level knowledge of Angular (preferred, but other comparable frameworks is sufficient)\nExperience deploying to and monitoring applications in AWS or other cloud infrastructure\nExperience with third-party systems integration\nExperience with various data storage solutions such as MongoDB and/or others\nKnowledge of eventually consistent data paradigms and distributed systems architectures\nExperience with message queueing patterns and products such as RabbitMQ, ZeroMQ, SNS/SQS\nExperience with Github, Jenkins, and continuous deployment pipelines\nYou are experienced and happy in a fast moving, continuous flow development environment.\nBuilding internal tools for customer management, order fulfilment\nEnsure the technical feasibility of UI/UX designs\nOptimize applications for maximum speed and scalability\n\nIf you are Qualified send your Cv to jobs@brilliancetech.net\nState in the Subject: Senior Full Stack Developer (Node.js)\nBR\n#Talented_Calibers #Share_Vacancies\n#Jobs #Vacancy","caption":null,"description":null,"created_time":"2016-08-18T05:13:25+10:00","total_likes":3,"total_comments":1},{"id":"172338516139198_1206956779344028","from":{"name":"Abdelrahman Omran","id":"2022367384657074"},"message":"If you've problems connecting to secure websites currently, check this & help solve the problem..","caption":"blog.omranic.com","description":"I’m working in web development industry, and thus I’m trying here to diagnose how this Daylight Saving Time change still affects me and…","created_time":"2016-08-18T04:13:28+10:00","total_likes":9,"total_comments":6}]}