{"posts":[{"id":"172338516139198_989251777781197","from":{"name":"Muhammad Saleh","id":"10155634469686002"},"message":"http://abc.wtf\nhttp://abc.fail\nWill redirect you to Bing\n:)","caption":"techworm.net","description":"WTF is ABC? Microsoft asks Google after its Alphabet announcement","created_time":"2015-08-13T17:47:21+10:00","total_likes":23,"total_comments":7},{"id":"172338516139198_989324027773972","from":{"name":"Mosab Ibrahim","id":"10154868571206047"},"message":"The CTO of Microsoft's Azure is tweeting about Alex gate fiasco!","caption":"twitter.com","description":"“One of our weaker advertising campaigns for Windows:”","created_time":"2015-08-13T21:43:25+10:00","total_likes":25,"total_comments":8},{"id":"172338516139198_990093771030331","from":{"name":"Safwat Ali","id":"10209047044593114"},"message":"Guys please help\nI have a Router (with wifi disabled) connected through LAN to an AP and then the rest of home devices connected to the AP\nI'm feeling something weird with the connection so I decided to make sure I'm not hacked\nI changed the wifi password so now only my laptop is able to connect\nShouldn't I have just 1 MAC Address in the picture?\nwhen I refresh the second mac address  goes away then I refresh and it comes back.","caption":null,"description":null,"created_time":"2015-08-15T08:54:20+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_990237927682582","from":{"name":"Hesham Mohamed Eladawy","id":"10154309434427452"},"message":null,"caption":"heshameladawy.blogspot.com","description":"في الأحصائية المبينة اعلاه يمكننا ان نميز مجموعة عوامل تؤثر في ريادة الأعمال في مصر بشكل ايجابي واخرى بشكل سلبي. الدراسة اشارات الي ان العوامل التي تؤثر في ريادة الأعمال بشكل ايجابي هي:","created_time":"2015-08-15T19:59:11+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_990256961014012","from":{"name":"Ashraf Kaabi","id":"10155206502385921"},"message":null,"caption":"reuters.com","description":"Beginning more than a decade ago, one of the largest security companies in the world, Moscow-based Kaspersky Lab, tried to damage rivals in the marketplace by tricking their antivirus software","created_time":"2015-08-15T20:54:27+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_990288251010883","from":{"name":"Amr Aboshama","id":"1479925982057921"},"message":"ازاى تشتغل فى جوجل الجزء الثانى :D","caption":null,"description":"ازاي تشتغل في جوجل ( الجزء التاني ) ..\n\nالجزء الاول : https://goo.gl/blCo4v\n\n------------------------------------------------------------------------\nفي الجزء الي فات اتكلمنا عن الكورسات اللازمة عشان تشتغل في جوجل بس الكورسات مش كفاية عشان تشتغل في اي حتة ف في مواصفات للشخصية لازم تكون فيك عشان تشتغل في جوجل والمواصفات دي سهل تكتسبها \n\n1 - القيادة \n2 - التواضع\n3 - لازم تكون عامل مشاريع برمجية قبل ما تشتغل في جوجل \n4 - جوجل محتاجة تعرف مدي انجازاتك بالنسبة لزملائك \n5 -  القدرة التحليلية\n6 - القدرة علي التعامل مع المشاريع الصعبة \n7 - المرح والجدية \n8 - العمل مسبقا في العمل التطوعي\n\nزي ما شفنا المواصفات دي سهلة وتقدر تكسبها بسهولة جدا ومن غير كورسات :D والمواصفات دي تشغلك في اي شركة مش شرط جوجل بس\n\n#Techioneer\n#دمتم_pioneers","created_time":"2015-08-15T22:47:19+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_990302881009420","from":{"name":"Abdelrhman Ibrahim","id":"1433313313345437"},"message":"what 3D has made easier for buildings designing?","caption":null,"description":"How Is 3D Design Software Improving Building Designs?\nBy Ankur Sharma\n\nBefore 3D design software was introduced, there were many cases when the entire project need to be redone, simply because the designer and the client could not visualize identically. However, the situation has drastically changed.\n\nDesigning buildings has always been a very meticulous task, requiring special expertise and experience of the highest order. However, ever since the inception of 3D design software, the entire scenario has undergone a sea change, and there is now a lot more scope for flexibility and inculcating the client's ideas into the design at every stage. The reason for this widespread usage is not just because of the fact that it's the latest trend, but also because it's a very utilitarian approach to getting the job done.\n\nTo begin with, using 3D design software means that any kind of changes can be done at the planning stage itself, since the architect will showcase a walkthrough of sorts, and if the client has any problems, the issues can be sorted at that stage itself. This was certainly not possible in case of the old world approach of drawing. It was extremely difficult to explain to the client what the final structure would look like. Everything was based upon assumptions, and this often meant that the whole project needed to be re-executed, simply because it did not meet the expectations of the client.\n\nHowever, with 3D design software, many things can be put into perspective, much to the delight of designers as well as clients, for the simple reason that work can be done more efficiently, with lesser labor and faster results. Creating a virtual map and walkthroughs give the client an exact picture of what is to be made, leaving no room for obscurity and doubt.","created_time":"2015-08-15T23:40:41+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_990349297671445","from":{"name":"Mostafa Muhammad","id":"10154873940166210"},"message":"Someone on Stackoverflow is suggesting that in order to delete a git repository created using \"git init\" you simply run \"git commit --suicide\" , Any git gurus can confirm this? :P","caption":null,"description":null,"created_time":"2015-08-16T01:56:14+10:00","total_likes":7,"total_comments":6},{"id":"172338516139198_988553657851009","from":{"name":"Mohamed Ibrahim Farrag","id":"10154239091086176"},"message":"السلام عليكم : انا محتاج شركة اخد منها VPS (windows server \n\nمحتاج اقتراحتكم مع شركات حد اشتغل معاها قبل كده غير شركة هوست جيتور","caption":null,"description":null,"created_time":"2015-08-12T03:38:19+10:00","total_likes":1,"total_comments":8},{"id":"172338516139198_990399240999784","from":{"name":"Abdelrahman M. Moez","id":"1615887465092802"},"message":"كلاكيت تانى مرة؟!","caption":null,"description":"عدنا إليكم من جديد :D\n\nشكل شركة Lenovo مش بتحرم! :3\n\nلتانى مرة، فى نفس السنة، الشركة دى تتقفش فى من حاجة مش مظبوطة بتعملها مع الـ users بتوعها، للى الناس اللى مش عارفة المشكلة الأولى، ده لينك ليها اتفضل :v\nhttp://on.fb.me/1J8PgH7\n\nمشكلة المرة دى بقى ..\n\nفيه utility اسمها \"Lenovo Service Engine\" بتبقى موجودة فى الـ BIOS فى أجهزة Lenovo، و دى بتنزّل برنامج اسمه \"OneKey Optimizer\" و وظيفته انه بيحسن الأداء بتاع الجهاز  و يعمل update للـ firmware و الـ drivers و الـ pre-install programs و بتشوف الـ  junk files و تمسحها و شوية حاجات تانية، و كمان بتبعت سجل بمعلومات عن كيفية استخدامك للـ product بتاعهم و الشركة بتدعى إن المعلومات دى مافيهاش حاجة \"شخصية\".\nالمشكلة، إن الـ users مايعرفوش اللى بيحصل فعلاً زائد إن التخلص من اللى بيحصل ده صعب جداً!\n-\nلو انت بتستخدم Windows 7 Or 8 .. فالـ BIOS بيعمل check على لو إن الـ file اللى بالـ path ده:\nC:\\Windows\\system32\\autochk.exe\nهل هو بتاع Microsoft و لا فيه الـ signature بتاعة Lenovo؟  و مافهوش الـ signature فبيتم إعادة الكتابة عليه بالـ signature بتاعتهم.\n-\nبعد كده، الـ autochk المتعدل عليه ده فى الـ boot اللى بعد كده للويندوز بيشتغل و فيه فايلين تانيين بيتم إنشائهم: LenovoUpdate.exe و LenovoCheck.exe، و اللى بيبتدوا بدورهم بإنهم ينزلوا files تانية لما يبقى فيه Internet Connection.\n-\nماشى، فين المشكلة بالظبط؟!\nفى 31 يوليو، اكتشفوا وجود \"ثغرة\" فى الـ Lenovo Service Engine اللى بتبقى موجودة فى الـ BIOS بتاعة أجهزة لينوفو، و اللى الـhackers ممكن يستخدموها علشان يعملوا شغلهم بقى 3:)\n\nالشركة نزلت patch علشان يعالج المشكلة دى، بس للأسف الكلام ده مش فعال 100% و مش بيوقف وظيفة الـutility دى، و فيه جزء يدوى لازم يتعمل مش الـ patch هو اللى يعملها! :/ \n- \nMicrosoft ليها دخل بالموضوع ده!\nفيه mechanism لينوفو بتستخدمها من Microsoft Windows اسمها:\n\"Windows Platform Binary Table\" و كان أول مرة تتطبق فى 2011 و تم تحديثها يوليو السنة دى.\nماشى، ها و بعدين؟\nالـ mechanism دى بتسمح لصانعى أجهزة الكمبيوتر إنهم ينزلوا software على الـ system  من الـ BIOS!\nو من هنا جه موضوع استغلال الثغرة اللى هنا و اللى بيها الـ hackers يقدروا ينزلوا أى حاجة على الجهاز بتاعك! :/ :/\n- \nالـ models المصابة بالموضوع ده:\nFlex 2 Pro-15/Edge 15 (Broadwell/Haswell models),\nFlex 3-1470/1570/1120, G40-80/G50-80/G50-80 Touch/V3000, S21e, S41-70/U40-70, S435/M40-35, Yoga 3 14, Yoga 3 11, Y40-80, Z41-70/Z51-70 and Z70-80 / G70-80.\n\n-\nيا ترى ايه آخرة Lenovo فى المواضيع دى؟\nمعروف انها شركة كبيرة و بنت اسم فى وقت قليل، شايف ان ده هيهد من اسمها و لا لأ؟\nو هل الموضوع ده غير من رأيك فيها كشركة و قلل من ثقتك فيها؟\n-\nلتفاصيل أكتر و المصدر: http://bit.ly/1J4Yy2l","created_time":"2015-08-16T04:42:22+10:00","total_likes":7,"total_comments":0}]}