{"posts":[{"id":"172338516139198_1203390926367280","from":{"name":"Said Bakr","id":"10154979109648745"},"message":"موضوع للنقاش:\nهل يوجد ما يسمى \"النصب أو التدليس التكنولوجي\" بمعنى، وبفرض جدلي -استخدم الأسماء فقط للتوضيح وليس للتقرير- مثلا مشروع زي AngularJS يكون مجرد تكرار لتكنولوجيات موجودة او ألا يكون هناك حاجة حقيقية لوجوده وأصل الموضوع مجرد تجارة Business  وبالاستعانة بإمكانات دعائية وتسويقية يجد له أرضية وتواجد داخل مجتمع البرمجة والتطوير.\n***أكرر الاسم فقط للتوضيح بدلا من س او ص ولا يعني انا ما ذكر ينطبق على الاسم المذكور.","caption":null,"description":null,"created_time":"2016-08-14T01:12:02+10:00","total_likes":2,"total_comments":9},{"id":"172338516139198_1203375939702112","from":{"name":"Mahmoud Elshafaey","id":"10210569174683682"},"message":"which is better, PhoneGap or Appcelerator ?","caption":null,"description":null,"created_time":"2016-08-14T00:57:52+10:00","total_likes":0,"total_comments":8},{"id":"172338516139198_1204089046297468","from":{"name":"Mootaz Dinana","id":"10154839781925306"},"message":"I get asked this question a lot, but now a friend is in dire need of an answer: How much does it cost to have an agency or software house to develop a basic app on Android and iOS? For features, imagine something very similar to Uber.. Thanks in advance..","caption":null,"description":null,"created_time":"2016-08-14T18:32:48+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1204397069599999","from":{"name":"Alaa Attya Mohamed","id":"10210243495897310"},"message":"Hi geeks,\n\nA friend of mine is filing an inquiry to telecom Italia, it's where the traceroute drops, it seems it's out of Egypt's hands afaik. So he needs to have a list of IP Addresses and domains that we're not able to connect to:\n\n","caption":"docs.google.com","description":null,"created_time":"2016-08-15T03:22:27+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1203369859702720","from":{"name":"Mahmoud Fahmy Elbalasy","id":"10206865647514640"},"message":"ممكن افهم الى بيحصل فى الانترنت فى مصر , انا اتصالات من الصبح معظم المواقع الhttps مش راضية تفتح معايا بما فيهم الفيسبوك على اكتر من جهاز فى البيت عندى , الفيسبوك فتح بعد لما نزلت tor على التوزيعة و خليت البروكسي بتاع البراوزر عن طريق tor , ايه السبب بقا انا كنت فاكر ان العك ده فى tedata بس .","caption":null,"description":null,"created_time":"2016-08-14T00:45:23+10:00","total_likes":2,"total_comments":4},{"id":"172338516139198_1204050042968035","from":{"name":"Rafael Youakeem","id":"10154500313486909"},"message":"Hey guys, after the recent bank limitations on USD transactions, we switched whatever we could to PayPal (It charges us in EGP) but we've had a couple of PayPal transactions rejected despite having sufficient funds.\n\nDid this happen to any of you or do you know anything about it?","caption":null,"description":null,"created_time":"2016-08-14T17:24:08+10:00","total_likes":0,"total_comments":7},{"id":"172338516139198_1204176979622008","from":{"name":"Mohamed Shaheen","id":"1823163877946104"},"message":"Hello , i am searching for Budget friendly Saas service monitor solution , new relic and datadog are good but expensive , any suggestions ?","caption":null,"description":null,"created_time":"2016-08-14T21:33:56+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1204584082914631","from":{"name":"Ahmed Amin","id":"1813081165632012"},"message":"السلام عليكم\n\nممكن استسفار من فضلكم - انا ديفلوبر .net mvc - web api وبشتغل angularjs - وشغال بقالى 5 سنين والحمد لله - لو عاوز احدد لنفسى سعر للساعة الرينجاات اللى ماشيه كام او بتتحدد ازاى ؟","caption":null,"description":null,"created_time":"2016-08-15T08:49:54+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1204888372884202","from":{"name":"Tarek El Kady","id":"1256065217807154"},"message":"The French Tech Ticket (second edition) has been launched. \nApplications are open till August 24\nWww.frenchtechticket.com","caption":null,"description":null,"created_time":"2016-08-15T18:58:29+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1204753419564364","from":{"name":"Mohamed AbuIssa","id":"1364997500240454"},"message":"السلام عليكم،\nمؤخرا كان في حالات اختطاف كثير في اسكندرية فكنت فكرت في كذا طريقة لمحاولة تقليل الموضوع\n\nأول طريقة حتكون عبارة ان كل الناس اللي بتحاول تتقي الموضوع ده انها تنزل app علي الموبيل الapp ده حيشغل background service مستنية key combination معين اول اما يتعمل تقوم باعتة لservice online صورة صاحب الموبيل و اسمه(مأخوذين منه قبل كده) و المكان بتاعه و كل اما المكان يتغير يتبعت المكان الجديد و كحاجة اضافية ممكن الservice تpost علي الfacebook بتاع الشخص ده انه في خطر و مكانه كذا كذا و تقرب واحد له ممكن يساعده\n\nالمشاكل في الطريقة دي\n١- انها محتاجة نت و النت محتاج شبكة\n٢- ان ممكن حد(حرامي او مختطف) يستعمل البرنامج في انه يبعت request فالناس مثلا اللي حيشفوه حيحاولوا يساعدوه فممكن يسرقهم، يخطفهم او يقتلهم\n٣- البطارية ممكن تفضي بسرعة او الموبيل يتقفل\n\nالطريقة الثانية ان الابليكشن حيكون background service برده بس حيعمل حاجتين حيشغل البلوتوث او اي short range comm. method و يlisten علي port معين ده غير انه حيستني الkey combination بتاع طلب المساعدة اما الkey combination يتعمل هو حيقوم باستعمال البلوتوث ي braodcast  request for help حيسمعه او يعرف به كل الdevices اللي حواله اللي عليها الابليكشن و حيطلع نوتيفيكشن ان في شخص كذا محتاج مساعدة و الناس اللي حواليه حيقدروا هل هو يستاهل المساعدة و لا لأ و هل هم لو ساعدوه مفيش اذي عليهم و لا لا؟! و ساعتها ممكن يساعدوه او لو مش حيقدروا ممكن يكلموا البوليس او الاسعاف او اي حاجة زي دول و هم يتصرفوا \n\nالمشاكل في دي\n١- ان المساعدة بتعتمد علي عدد الناس اللي عندهم الابليكشن\n٢- البطارية ممكن تفضي بسرعة او الموبيل يتقفل \n\nالطريقة الثالثة ان الservice تكون حزء من الOS و وقت اما الkey combination يتعمل الOS يقفل كل الfunctionality اللي هو مش محتاجها في انه يبعت الhelp request و يقفل كل الطرق اللي ممكن حد يقفل بها الموبيل زي زرار الlock و اي تعاملات مع الsettings و يفضل يبعت الrequest و النتس اللي قريبة من الضحية ممكن يقولوا اننا قبلناه و حنساعده فساعتها الdevice مش حيبطل يبعت خالص بس حيقلل الfrequency عشان يحافظ علي البطارية و المفروض ان كل اما الناس تقبل اكثر يقلل الfrequency اكثر المهم هو مش حيطلع من الmode ده غير باستخدام جهاز او برنامج يكون بس عمد المستشفيات و اقسام البوليس بحيث ان معروف اي بني آدم في خطر حيروح مكان من الاثنين دول في الآخر\n و في حالة ان الkey combination اشتغل و الشخص مش في خطر ممكن يتحط عليه عقوبة زي انه موبايله يتصادر لمدة او يدفع غرامة\n و برده محدش يساعد حد في كل وقت يساعده بس اما يحس انه مش حطر عليه و لو خطر يكلم المسؤولين فبكده لو حد عايز مساعدة علي الطريق الصحراوي مثلا محدش ينزل يساعده لأ بمنتهي البساطة يكلم الاسعاف انا شفت كذا كذا و المكان كذا اتصرفوا\n\nملحوظة: الkey combination ممكن يختلف من شخص للثاني بحيث محدش يشغل ال request for help عند اي حد ثاني \nالkey combination لازم يكون صعب انه يداس عليه by accident بس في النفس ممكن حد تعبان يعمله\nايه رأيكم في الفكرة دي و لو في اي اقتراحات او مشاكل يا ريت تقولوا","caption":null,"description":null,"created_time":"2016-08-15T13:53:33+10:00","total_likes":10,"total_comments":5}]}