{"posts":[{"id":"172338516139198_738064119566632","from":{"name":"Salah Jr Ahmed","id":"10154647662667880"},"message":"Guys, We need for a small size start up 2 javascript developers with a high experience in JQuery - Bootstrap 3.0 please let me know I will send you contact needed in a private message. We need 20 hours at least per week.","caption":null,"description":null,"created_time":"2014-04-28T15:31:10+10:00","total_likes":2,"total_comments":3},{"id":"172338516139198_738071949565849","from":{"name":"Mahmoud Elsayed Abd Elaty","id":"10154475733042406"},"message":"Guys, Do any one have experience before about integration with Facebook and twitter or any social networks .i am using already this script in url     http://adodson.com/hello.js/ .\nBut i faced problem that i can't save authentication of user always .It saved authentication of user in local PC not in the server .Any solutions?","caption":null,"description":null,"created_time":"2014-04-28T16:02:42+10:00","total_likes":0,"total_comments":8},{"id":"172338516139198_737268249646219","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"in JQuery , hidden options in select still accessible by keyboard arrows \nhow to solve this problem ?","caption":null,"description":null,"created_time":"2014-04-27T04:11:41+10:00","total_likes":0,"total_comments":16},{"id":"172338516139198_738117409561303","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"سؤالى ممكن يكون مش مهم لبعض الناس بس نظراً لأنى لسه مجرب الموضوع دا إمبارح حبيت أعرضه عليكم يمكن يكون عند البعض منكم معلومات بخصوص الموضوع دا.\nحصل إمبارح فى الحساب بتاع زوجتي على الفيسبوك اللى بيقول عليه البعض (إختراق).\nواحد دخل على الحساب وبدأ يكلم بعض صحباتها انه هى وعاوز رصيد علشان واقع فى مشكله.\n\nالغريب فى الأمر إن الحساب له كلمة سر معقدة مش سهل تخمينها, وكمان تتبع الشخص دا قادنى لواحد فى بورسعيد (مع العلم انى من سكان القاهره).\n\nكنوع من أنواع التهديد, انا أخدت الرقم اللى كان بيحاول يقنع الناس انه فى ورطه ومحتاج يتحوله رصيد عليه, وعن طريق TrueCaller عرفتله لقب أكلمه بيه, وفعلاً كلمته على تليفونه من Skype وبدأت معاه المكالمه كواحد صاحبه هو ناسيه, وفينك يا راجل , ومش فاكرني وهكذا, وقدرت أعرف عنه شوية حاجات بسيطه نفعتنى قوي لما رحت قالب المكالمة على صيغة تهديد وإنى هبلغ البوليس عنه وانه هيتشد وان حساب الفيسبوك دا متراقب وإنى عرفت هو ساكن فين وتليفونه متراقب وان وإن... \n\nبدون ما أطول عليكم الموضوع خلاص خلص وعملت lock للحساب لحد ما غيرت كلمة السر بتاعته وفعلت ال 2 step verification , بس السؤال هنا الموضوع دا حصل technically إزاى؟!!\nهل الأدوات اللى بتقولك (إختراق الفيسبوك, وتعلم إختارق حسابات أصحابك) والهبل دا فى منه حاجه ممكن تؤدي للنتيجه دى, مع لاعلم انها مبتدخلش من أى مكان إلا من جهاز البيت او الموبايل؟\nوهل الموضوع سهل كدا (أشك طبعاً).\nوهل حد منكم عنده فكره عامه عن الموضوع دا؟\n\nفى إنتظار مناقشاتكم.","caption":null,"description":null,"created_time":"2014-04-28T19:36:18+10:00","total_likes":2,"total_comments":7},{"id":"172338516139198_738209579552086","from":{"name":"Shady Zaky","id":"1856382157974336"},"message":null,"caption":null,"description":"The editor should be an extension of your hand. check the rest of tips by #dashsoft to  be a #Successful_Software_Developer.","created_time":"2014-04-28T23:29:31+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_738214699551574","from":{"name":"Meligy","id":"10154884040385170"},"message":"Ubuntu Users","caption":null,"description":null,"created_time":"2014-04-28T23:46:38+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_738218456217865","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Interesting.","caption":"honnibal.wordpress.com","description":"A syntactic parser describes a sentence's grammatical structure, to help another application reason about it. Natural languages introduce many unexpected ambiguities, which our world-knowledge imme...","created_time":"2014-04-28T23:55:21+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_738223972883980","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"blog.tjll.net","description":"An extended look at SSH features that can serve a variety of purposes for different use cases.","created_time":"2014-04-29T00:10:55+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_738273909545653","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"us-cert.gov","description":"US-CERT is aware of active exploitation of a use-after-free vulnerability in Microsoft Internet Explorer. This vulnerability affects IE versions 6 through 11 and could lead to the complete compromise of an affected system.","created_time":"2014-04-29T02:24:51+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_738353749537669","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"makeuseof.com","description":"Ubuntu is a pretty good Linux distribution to start out with, but there are some tweaks you might want to perform to get it to work and behave the way you want it to. This is especially true if you're new to Ubuntu or Linux. If you've jumped over from Windows XP, you've made a…","created_time":"2014-04-29T05:17:02+10:00","total_likes":2,"total_comments":0}]}