{"posts":[{"id":"172338516139198_1234920419880997","from":{"name":"Mohamed Amin","id":"1858939887697579"},"message":"Hello Guys, \nIs anyone here using some kinda remote developing machine?\nI had my own setup as an instance on AWS and just connect to it through sublime SFTP, then I moved to Atom and nuclide but both ways have their own troubles.\n\nI'm just wondering if anyone has a better practice?","caption":null,"description":null,"created_time":"2016-09-18T16:25:58+10:00","total_likes":2,"total_comments":6},{"id":"172338516139198_1232667966772909","from":{"name":"Amr ElBsheer","id":"10208670485819631"},"message":"How to configure apache2.4 server to serve a Django1.9 (python2.7) on windows ?\nI google it for days without any working result :(","caption":null,"description":null,"created_time":"2016-09-15T23:18:47+10:00","total_likes":1,"total_comments":6},{"id":"172338516139198_1233612243345148","from":{"name":"Mohamed Gamal","id":"10155052545932328"},"message":"SA,\n-How often do you use NoSQL databases?\n-When do you need to use them over normal SQL?","caption":null,"description":null,"created_time":"2016-09-17T02:59:47+10:00","total_likes":3,"total_comments":7},{"id":"172338516139198_1236868919686147","from":{"name":"Mohamed Samir","id":"1252844501489402"},"message":"مساء الخير،\nلو حد عنده تجربه ياريت يديني ترشيحات لبرنامج POS اوفلاين بالكامل، تحميل وتسطيب وشغل اوفلاين، لمحل بيع ملابس بالتجزئه\nيكون يكون فيه invetory mangemnt وbilling & invoicing\nوبيدعم الباركود قرايه وطباعه (يعني بيدعم الـ thermal printer والـ barcode scanner)\nولو كان فيه loylty program و disoucnt program يكون افضل بس مش شرط\nانا لجئت لكم لاني بدور بقالي اسبوع ووصلت لبرامج كتير جدا جدا جدا بس مفيش حاجه اوفلاين، كله cloud based ومفيش ولا واحد فيهم برنامج مستقل بذاته كده، ادفع واحمل واسطب على طول وكام واحد وصلتلهم كده outdated جدا\nمستبعد الـ openbravo تماما، معقد جدا بالنسبه لاحتيجاتي المحدوده\n*تحديث: مش عاوز حاجه عربي (من مطورين عرب او شركات عربيه) نهائي","caption":null,"description":null,"created_time":"2016-09-20T23:23:57+10:00","total_likes":0,"total_comments":5},{"id":"172338516139198_1236997133006659","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"حد جرب او اشتغل مع FB Messenger bot \nازاي ممكن نستفيد منها ؟ افكار مثلا ؟\n\n-موضوع مطروح للنقاش :)","caption":"developers.facebook.com","description":"Product overview for Messenger Platfrom","created_time":"2016-09-21T02:20:19+10:00","total_likes":7,"total_comments":4},{"id":"172338516139198_1235709246468781","from":{"name":"Muhammad Sabry Abdulwanis","id":"10212106739285334"},"message":"Would anybody help answer this question, please?\nThank you.","caption":"stackoverflow.com","description":"I am learning to use unit testing and Moq for asp.net MVC5. I am trying to write my first unit test for the index action of one of my controllers. Here is the code for the index action. [Author...","created_time":"2016-09-19T12:07:46+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1237240162982356","from":{"name":"Abdelrahman Elkady","id":"1328679870533293"},"message":"If anyone is using GitHub's Student pack ( Or any pack that contains aws edu ), something cool is updated there :\n\n\"All students can choose between two account types: the standard AWS account which provides $150 in credits, ****or the AWS Educate Starter Account which delivers $75 in credits and does not require a credit card to sign up.****\"","caption":null,"description":null,"created_time":"2016-09-21T08:30:42+10:00","total_likes":4,"total_comments":0},{"id":"172338516139198_1236071659765873","from":{"name":"Ahmed Badawy","id":"1285105998248677"},"message":null,"caption":null,"description":"دى مجموعة الدوافع إلى تخليك تستخدم db manager معين فى مشروعك على حسب إحتياجاته... \n\nComparition between  (sqlite - mysql - postgresql) \n----------------------------------------------------\n\nWhen To Use SQLite\n\nEmbedded applications:\nAll applications that need portability, that do not require expansion, e.g. single-user local applications, mobile applications or games.\n\nDisk access replacement:\nIn many cases, applications that need to read/write files to disk directly can benefit from switching to SQLite for additional functionality and simplicity that comes from using the Structured Query Language (SQL).\n\nTesting:\nIt is an overkill for a large portion of applications to use an additional process for testing the business-logic (i.e. the application's main purpose: functionality).\n\nWhen Not To Use SQLite\n\nMulti-user applications:\nIf you are working on an application whereby multiple clients need to access and use the same database, a fully-featured RDBM (e.g. MySQL) is probably better to choose over SQLite.\n\nApplications requiring high write volumes:\nOne of the limitations of SQLite is the write operations. This DBMS allows only one single write*operating to take place at any given time, hence allowing a limited throughput.\n----------------------------------------------------\n\nWhen To Use PostgreSQL\n\nData integrity:\nWhen reliability and data integrity are an absolute necessity without excuses, PostgreSQL is the better choice.\n\nComplex, custom procedures:\nIf you require your database to perform custom procedures, PostgreSQL, being extensible, is the better choice.\n\nIntegration:\nIn the future, if there is a chance of necessity arising for migrating the entire database system to a propriety (e.g. Oracle) solution, PostgreSQL will be the most compliant and easy to handle base for the switch.\n\nComplex designs:\nCompared to other open-source and free RDBMS implementations, for complex database designs, PostgreSQL offers the most in terms of functionality and possibilities without giving up on other valuable assets.\n\nWhen Not To Use PostgreSQL\n\nSpeed:\nIf all you require is fast read operations, PostgreSQL is not the tool to go for.\n\nSimple set ups:\nUnless you require absolute data integrity, ACID compliance or complex designs, PostgreSQL can be an over-kill for simple set-ups.\n\nReplication:\nUnless you are willing to spend the time, energy and resources, achieving replication with MySQL might be simpler for those who lack the database and system administration experience.\n--------------------------------------------------------------\n\nWhen To Use MySQL\n\nDistributed operations:\nWhen you need more than what SQLite can offer, including MySQL to your deployment stack, just like any stand-alone database server, brings a lot of operational freedom together with some advanced features.\n\nHigh security:\nMySQL's security features provide reliable protection for data-access (and use) in a simple way.\n\nWeb-sites and web-applications:\nA great majority of web-sites (and web-applications) can simply work on MySQL despite the constraints. This flexible and somewhat scalable tool is easy to use and easy to manage -- which proves very helpful in the long run.\n\nCustom solutions:\nIf you are working on a highly specific and extremely custom solution, MySQL can tag along easily and go by your rules thanks to its rich configuration settings and operation modes.\n\nWhen Not To Use MySQL\n\nSQL compliance:\nSince MySQL does not [try to] implement the full SQL standard, this tool is not completely SQL compliant. If you might need integration with such RDBMSs, switching from MySQL will not be easy.\n\nConcurrency:\nEven though MySQL and some storage engines perform really well with read operations, concurrent read-writes can be problematic.\n\nLack of features:\nAgain, depending on the choice of the database-engine, MySQL can lack certain features, such as the full-text search.\n--------------------------------------------------------------\n\nto read the full article visit: \n","created_time":"2016-09-19T22:34:55+10:00","total_likes":8,"total_comments":2},{"id":"172338516139198_1237448232961549","from":{"name":"Ahmed Atalla","id":"423597977977586"},"message":"Nice tips #electron","caption":"blog.avocode.com","description":"Electron, the technology that powers Avocode among many other apps, allows you to very quickly get a cross-platform desktop application up and running. Check out these first-hand tips and avoid ending up in the uncanny valley of apps. Apps that don't feel _quite_ in place among your other apps.","created_time":"2016-09-21T14:13:58+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1236834106356295","from":{"name":"Emad Elmogy","id":"750667738418523"},"message":"Hello, \ni want to deploy two laravel projects on the same droplet on digital ocean , i am using LAMP.\nhow can i do it ?","caption":null,"description":null,"created_time":"2016-09-20T22:32:04+10:00","total_likes":0,"total_comments":5}]}