{"posts":[{"id":"172338516139198_1028344827205225","from":{"name":"Moustafa Amin","id":"10154448578021538"},"message":"Hi guys,\nI'm trying to have more visibility on the UX Field in the Egyptian market.\nwhat are the companies you know that has a UX designer or a team?\n\nFor example, I know ITworx has a team for UX design. \n\nللى مش فاهمني أوى, تعرفوا فى مصر شركات ايه عندهم ناس متخصصين UX ؟\nتسلموا :)","caption":null,"description":null,"created_time":"2015-11-05T22:58:45+11:00","total_likes":0,"total_comments":12},{"id":"172338516139198_1029851760387865","from":{"name":"Sherif El-Melegy","id":"2249925261898253"},"message":"سوال اتسألتوا فى انترفيو .. \nهو ممكن يكون بيزك اوى ليكوا \nلو معانا كذا رواتر عايزين نوصلهم مع بعض .. ايه البورتكلات اللى هنستخدمها وليه ؟؟","caption":null,"description":null,"created_time":"2015-11-09T05:23:26+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1030047460368295","from":{"name":"Anas Rabei","id":"621823724675667"},"message":"I am facing a little problem with a simple java application \nMy problem simply is ClassNotFoundException. Although I am using Maven for dependency management and the required jars exists in the repo, I still get that exception. \nThe full details listed in the following stackoverflow question\n\nhttp://stackoverflow.com/questions/33594281/java-lang-classnotfoundexception-org-apache-spark-streaming-twitter-twitterrece \n\nCan anyone direct how to solve this issue ?","caption":null,"description":null,"created_time":"2015-11-09T18:34:35+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1029907587048949","from":{"name":"Muhammad Saleh","id":"10155634469686002"},"message":"Dears,\nAnyone tried crossover.com ? Are they trustworthy ?\nFor anyone who doesn't know them they're having remote working opportunities\nYou get hired after successfully complete a series of tests and interviews\nAnd then they outsource you to third party clients\nThey have their tracking software as well which take screenshots from your screen and take photos from your webcam as well while you're working\nIf you have an experience with them it would be great if you can share it with us.\nThanks.","caption":null,"description":null,"created_time":"2015-11-09T08:28:59+11:00","total_likes":6,"total_comments":11},{"id":"172338516139198_1030456653660709","from":{"name":"Emad Mokhtar Habib","id":"10158372089300634"},"message":"MIT 6.00 Introduction to Computer Science and Programming, Fall 2008 ","caption":"archive.org","description":"This subject is aimed at students with little or no programming experience. It aims to provide students with an understanding of the role computation can play...","created_time":"2015-11-10T19:35:05+11:00","total_likes":6,"total_comments":0},{"id":"172338516139198_1029544283751946","from":{"name":"Ahmed Kamal","id":"10203100096301505"},"message":"Hi guys , I just want to know your opinion regarding an idea that I have.\n\nProblem : Sometimes I fed up with Facebook (for productivity reasons) and I decide to kill the news feed or even close the account but at the same time I'm following a lot of great people who publish great beneficial posts and some groups/pages that share hot opportunities and excellent opinions.\n\nSuggested Solution :\n\nActually the idea isn't very clear yet but I'm thinking about :\n\nA tool that get all the feeds from your favorite sources (groups/pages/Persons) and exposes them through an alternative news feed. \n\nYou can apply some filters on the content so when a new post (from a page that you love) contains \"Master Degree Scholarship\" is posted , you will get notified.\n\nThe content may be pre-processed to remove for example all the politics posts :) in addition to a lot of other things.\n\nDo you also have the same problem ? What are your solutions for it ?\nDo you think you could use sth like that if it is free for example ?","caption":null,"description":null,"created_time":"2015-11-08T09:49:02+11:00","total_likes":6,"total_comments":5},{"id":"172338516139198_1030709173635457","from":{"name":"Ahmed Elsayed Shahawi","id":"1317342155017349"},"message":"Analyzes a webpage and detects performance or front-end code quality issues. Free, Opensource, easy to launch and easy to understand.","caption":"github.com","description":"YellowLabTools - Web performance and front-end quality testing tool","created_time":"2015-11-11T11:00:04+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1030760426963665","from":{"name":"Sameh Saeed","id":"10154266644607344"},"message":null,"caption":null,"description":"طيب الكلام بتعنا النهارده هيكون عن حجتين مع بعض\n Graphical User Interface (GUI) Vs (CLI) Command line Interface\nيا اخ انا مش فاهم حاجه ايه كومو... و جراف... ايه ! مش فاهم\n--------------------------------------------------------\nهقولك انا يا سيدي شوف انت لما بتيجي تتفرج علي فيلم اجنبي و تلاقي واحد ماسك شاشه سوده كده و نازل تكته و تخبيط في الكيبورد و تحس انك مش فاهم حاجه\n\"متقلقش انت مش لوحدك في الغالب الراجل نفسه مش فاهم حاجه برضه\"\nهي ديه يا سيدي بقي الـ CLI - Command line Interface و مميزتها بقي :\n1 - مش بتستهلك حاجه من امكنيات جهازك \n2 - بتديك تحكم و حريه في انك تستخدم كل ال Command اللي بتقدر عن طريقها تتحكم في الجهاز او السيرفر بتاعك\n3 - بما انها مفهاش صور و روسومات و شغل شقلبه كتير فبتكون اسرع بكتييييير و مع ذلك اخف علي الجهاز بتاعك\n4 - الوسيله الاسرع و الاخف و الاكتر فاعليه لما بتيجي تتحكم في سيرفر موجود في مكان تاني\n\"تخيل معايا بتتحكم في سيرفر موجود في امريكا مين اسرع يبعت الكلام اللي في الشاشه السوده ولا يبعتلي الـ Desktop كله اشوفه و ابتدي اتحكم فيه\"\n--------------------------------------------------------\nبس المشكله اللي قبلتنا هنا ان فيه حاجات مش هنقدر نستخدمها علي الشاشه السوده او زي متفقنا بقي اسمها CLI - Command line Interface زيه ايه مثلا :\nالصور, الافلام, الالعاب و اي حاجه من هذا القبيل,\nو عشان كده جيه هنا دور الـ GUI - Graphical User Interface و ده يا سيدي الحاجات المرسومه و المرئيه عندك اللي حضرتك قاعد و بتقرأ عن طرقها الكلام ده دلوقتي او بتتفرج علي فيلم او تشوف صوره صاحبك اللي قاعد مقضيها في الساحل فتعمله لايك.\n--------------------------------------------------------\n الموضوع اول مبدأ  كان اسمه سعتها X و كان عباره عن مربعات كده تقدر تشوفها من هنا https://goo.gl/srKKaC, بعدين اتطور شويه و بقي اسمه x11 و بعدين  فيه شركه اسمها x.org و شركه كمان اسمها freedesktop.org اتحدوا مع بعض و عملوا حاجه اسمها X.Org Foundation و فضلوا يطورا فيه لحد دلوقتي معظم الواجهات دلوقتي مبنيه عليه م بيشتغلو مع بعض عشان يوفرولنا الشكل اللي احنا شيفينوا دلوقتي.\n--------------------------------------------------------\nدلوقتي هبتدي اقولكم علي اشهر الواجهات الموجوده عندنا في لينيكس و مزياهم\n\n1 - Unity \nده الواجهه الرئيسيه لواحده من اشهر التوزيعات الموجوده Ubuntu \nو بتطور بشكل كبير و سهله في الاستخدام و ده الشكل بتعها http://goo.gl/OXMlYl\n\n2 - GNOME \nو ديه بقي واحد من اقدم و اعرق الواجهات سريعه و من مميزتها انك تقدر تضيف  عليها اضفات زياده علي حسب رغبتك بتيح ليك سهوله و مزايا كتير جدا مش موجوده في اي واجهه تانيه و تقدر تشوف شكلها من هنا http://goo.gl/9sM20n\n\n3 - KDE\n يعتبر من اكتر الواجهات الشبيهه بـ Windows يعني مش هتحس انك بعيد لو لسه في عالم الـ open source و بتقدر تضيف فيه Widgets و تظبط فيه زي ما انت عايز بس للاسف كل ده بيجي علي  حساب السرعه و ده شكله http://goo.gl/DyBRsa\n\n4 - Xfce\n ده بقي يعتبر من اخف الواجهات اللي ممكن تستعملها سريع و خفيف جدا و لو جهازك امكنياته مش كبيره قوي فده هيديك افضل اداء\n\n5 - Cinnamon \nده الواجهه الرئيسيه لواحده من اشهر و اخف و اسرع التوزيعات Linux Mint و ميزته انه خفيف و سريع رغم كده موفر شكل جميل و متناسق و سهل الاستخدام و ده شكله http://goo.gl/cRzO90\n\n6 - LXDE\nده بقي متصمم مخصوص عشان الاجهزه القديمه اللي امكنياتها علي قدها عشان برضه مينفعش ننساها رغم كده موفر معظم الحاجات اللي اي مستخدم طبيعي يحتجها\n\n7 - Xmonad او i3\nهما اتنين مختلفين بس يعتبر ليهم نفس المزايا و هي انه خفيف جدا و سريع جدا و ده يعتبر موجه اكتر لل Sys Admins اللي بيحتاجوا يقسموا الشاشه بتعتهم لكذا شاشه عشان يقروا يعملوا حاجات و يرقبوا النظام ماشي ازاي في كذا مكان في نفس الوقت ده شكل الXmonad لتوضيح http://goo.gl/PURTUo\nده بقي شكل الـ i3 عشان نعرف نفرق بينهم http://goo.gl/Rs3GXr\n--------------------------------------------------------\nو بكده نكون خلصنا الفرق بين الاتنين,\nشاركونا بأرئكم ايه اكتر واجهه بتحبها,\n و لو فيه اي استفسار, اقتراح او رأي نحب نسمعها منكم\n\n#Snowflake","created_time":"2015-11-11T14:46:46+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1030690300304011","from":{"name":"Omar Sherif","id":"10158224231920062"},"message":null,"caption":"googleresearch.blogspot.com","description":"http://googleresearch.blogspot.com/2015/11/tensorflow-googles-latest-machine_9.html?m=1","created_time":"2015-11-11T09:21:56+11:00","total_likes":11,"total_comments":1},{"id":"172338516139198_1030861950286846","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"واحد بيسأل سؤال منطقي وخايف يكون هو بيعمل حاجه غلط وهو مش واخد باله.\nالسؤال ملخصه كالتالي:\nهل منطقي إن الواحد يكتب الكود اللى بيعمل\nunit test \nللبرنامج فى وقت أكبر من وقت كتابة البرنامج نفسه؟\nوهل انا كدا بعمل حاجه غلط ولا دا الطبيعي؟\n\nالإجابه عليه حلوه برضه.\n#سؤال_حلو","caption":"programmers.stackexchange.com","description":"I find tests a lot trickier and harder to write than the actual code they are testing. It's not unusual for me to spend more time writing the test than the code it is testing. Is that normal or am I","created_time":"2015-11-11T21:23:20+11:00","total_likes":25,"total_comments":0}]}