{"posts":[{"id":"172338516139198_1267694766603562","from":{"name":"Amir Abou Eesa","id":"1353018234756623"},"message":"عندنا دلوقتي عدد مهول من الاجهزه الonline الي الfirmware بتاعها مش هيسمح بايremote updates وكلهم مفيهومش اي حمايه ... ارض الزومبيز.","caption":"thehackernews.com","description":"Chinese Electronics Firm Hangzhou Xiongmai Technology to recall its vulnerable smart products whose Internet connected cameras were hacked by Mirai botnet to take down the Internet with massive ddos attack.","created_time":"2016-10-25T07:29:41+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1267773109929061","from":{"name":"Hany Ahmed","id":"10155057984387292"},"message":null,"caption":null,"description":"الكابتشا CAPTCHA\nهي اختصار لجملة طويلة شوية\nCompletely Automated Public Turing test to tell Computers and Humans Apart\nيعني اختبار تورينج العام - الأوتوماتيكي بشكل كامل - للتفرقة بين البشر والحواسب\n\nاختبار تورينج تم وضعه عام 1950 بواسطة عالم الرياضيات آلان تورينج, الاختبار دا بيستخدم للتفرقة بين الانسان والآلة\n\nطب هو ايه المشكلة أصلاً ؟\nالمشكلة كانت ان فيه برمجيات صغيرة Robots/bots كانت بتدخل على المواقع وبتتصرف كأنها انسان عادي, فممكن الروبوت دا يدخل على موقع بريد الكتروني ويعمل آلاف الحسابات الوهمية في شوية دقائق\nفكان لازم لموقع الويب اللي عليه فورم بيتملى فيها بيانات انها تتأكد ان كاتب البيانات دي عبارة عن انسان مش روبوت\n\nفكانت الفكرة ان يتم وضع صورة لكلمة معينة ولازم المستخدم يدخل نفس الكلمة\nبس المشكلة ان الحاسب ممكن يتعرف على نصوص كاملة من الكلمات باستخدام تقنية التعرف على الحروف Optical Character Recognition (OCR)\nفكان لازم الكابتشا تعرض صورة لمجموعة من الحروف الغير واضحة بوضع تأثير زي ان الحروف فيها ميل او تموج او وراها خلفية\nالحاجات دي كلها بتخلي التعرف على الحروف صعب من جهة الحاسب\n\nGoogle reCAPTCHA\nhttps://www.google.com/recaptcha/intro/index.html\n\nدا النظام اللي استحوذت عليه جوجل في 2009\nهو زود الصعوبة بإنه بيدمج الحروف مع بعضها ودا بيخلي الكمبيوتر - اللي بيفرق الحروف عن بعضها بالمسافات البينية - غير قادر على تحديد الحروف\nكمان بيحط خط بعرض الكلمات بيزيد من صعوبة التعرف على الحروف\nكمان هو بدأ يستخدم حلول تانية زي انه يعرض مجموعة صور ويطلب منك انك تختار شوية صور منها بتحتوي على أشجار مثلاً\n\nكمان النظام دا فايدته الانسانية عظيمة جداً في انه قدر يحول الأرشيف الورقي لمجلة التايمز - 13 مليون مقالة - لوثائق الكترونية\nالنظام عمل الموضوع دا بطريقة عبقرية بأنه كان بيعرض كلمتين واحدة منهم هو عارفها وهو اللي بيتأكد منها انك انسان وواحدة تانية كلمة معمولها سكان من الجريدة\nوطبعا المستخدم اللي بيدخل الكابتشا مش عارف أي كلمة هي المفروض يكتبها صح فكان بيكتب الكلمتين صح ومنها جمع كل كلمات مقالات التايمز وحولها لوثائق الكترونية","created_time":"2016-10-25T08:59:05+11:00","total_likes":8,"total_comments":1},{"id":"172338516139198_1267874213252284","from":{"name":"Ibrahim Sobh","id":"10154358640302967"},"message":"https://www.linkedin.com/pulse/deep-learning-artistic-style-algorithm-ibrahim-sobh","caption":"linkedin.com","description":"Introduction: Here we introduce an artiﬁcial system based on a Deep Neural Network that creates artistic images of high perceptual quality. The system uses neural representations to separate and","created_time":"2016-10-25T11:43:10+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1267623019944070","from":{"name":"Mostafa Mohsen Gaafar","id":"10154121075511012"},"message":"Hi all, this is an article I wrote a while back. I'd like to know how you evaluate job opportunities as there is not really a lot of good articles on this subject.","caption":"medium.com","description":"*Preferably before you take it","created_time":"2016-10-25T05:49:53+11:00","total_likes":5,"total_comments":2},{"id":"172338516139198_1267774853262220","from":{"name":"Ahmad Magdy","id":"715713385273130"},"message":"المقال ده غطى معظم الحاجات الجديدة في ES6 اللي المفروض ال Developers يعرفوها","caption":"adrianmejia.com","description":"Adrian Mejia blog about programming and software engineering. Featuring MEAN stack (AngularJS, NodeJS, MongoDB and Express), BackboneJS, RESTful APIs, Algorithms and data structures.","created_time":"2016-10-25T09:01:26+11:00","total_likes":25,"total_comments":2},{"id":"172338516139198_1268375013202204","from":{"name":"AbdelRahman Mansour","id":"10212105280245314"},"message":"https://learning.linkedin.com/week-of-learning","caption":"learning.linkedin.com","description":"Join me for the Week of Learning. Only through Oct. 30 — all courses are 100% free #AlwaysBeLearning","created_time":"2016-10-25T23:35:14+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1268534433186262","from":{"name":"Mohamed Nasr","id":"10210938850820824"},"message":"Hi i have a wordpress site with arabic post name and i want to show urls with the post name but the name in the url ignored and can't access the post but redirect me to the index can anyone help me. thanks","caption":null,"description":null,"created_time":"2016-10-26T02:55:02+11:00","total_likes":0,"total_comments":2},{"id":"172338516139198_1268404613199244","from":{"name":"M Sameh El Harty","id":"10158341597705392"},"message":"Hello fellow geeks. I'm having trouble connecting to the company's VPN in the US since about Sunday. The connection is PPTP, I was wondering if anyone is having the same issue. I have tried:\n- 2 different Windows 10 machines\n- Ubuntu Linux\n- Switching connections (TEData ADSL with static IP, Vodafone 3G USB Modem).\n\nAny suggestions, or anyone else facing this same issue?\n\nNote: I can telnet form my machine to the designated IP on the PPTP port (1723)","caption":null,"description":null,"created_time":"2016-10-26T00:18:15+11:00","total_likes":2,"total_comments":4},{"id":"172338516139198_1268246036548435","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"PhoneGap/Cordova:\ni want to create background service that run while the application closed, i found solutions work only when the application in background, any idea ?","caption":null,"description":null,"created_time":"2016-10-25T20:48:18+11:00","total_likes":0,"total_comments":4},{"id":"172338516139198_1268265699879802","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"AlMakinah is trying to bring Kyle Simpson to Egypt; The veteran JavaScript author and speaker you probably know him from his famous series \"You Don't Know JS\" and they are looking for companies to assist via sponsorship or any possible way.\n\nDisclaimer: I am affiliated with AlMakinah in a way but I am not tryintg to advertise this. I am sharing it because I believe if this guy came to Egypt it will open the door in the future for similar events to bring more rockstars.","caption":null,"description":null,"created_time":"2016-10-25T21:14:13+11:00","total_likes":23,"total_comments":3}]}