{"posts":[{"id":"172338516139198_591939967512382","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"http://alexwolfe.github.io/Buttons/","caption":"alexwolfe.github.io","description":"A CSS button library built with Sass and Compass","created_time":"2013-07-12T00:16:39+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_590917737614605","from":{"name":"Mohamed El Kerdany","id":"10155060165569919"},"message":"UI/UX Web Developer needed \n\nWe are looking for a front-end Web application developer experienced in building interfaces to rich Internet applications to join our front-end development team. We are looking for an individual skilled in highly dynamic web interface development (HTML, JavaScript, AJAX, jQuery,Silverlight,…).\n\nESSENTIAL JOB FUNCTIONS\n• Builds software applications – Follows coding standards, builds appropriate unit tests, integration tests and deployment scripts\n• Assists in defining software architectures – Collaborates with leads to explore existing systems, determines areas of complexity, potential risks to successful implementation, learns the applications capabilities\n• Owns success – Takes responsibility for successful delivery of the solutions\n• Translates designs and style guides into functional user interfaces, ensuring cross browser compatibility and performance\n• Contributes to continual improvement by suggesting improvements to user interface, software architecture or new technologies\n\nREQUIRED SKILLS\n• Bachelor’s degree in computer science or a related field.\n• Skilled at front-end engineering using Object-Oriented JavaScript, various JavaScript libraries and micro frameworks (jQuery, KnockoutJS,Angular, Prototype, Dojo, Backbone, YUI), HTML and CSS\n• Knowledge of working with JavaScript frameworks to create rich interactive content\n• Experience integrating with server-side code to produce dynamic pages\n• Excitement about emerging web technologies such as HTML5 and CSS3\n• Good Knowledge of .NET as programming skills ( ASP .NET, ASP.NET MVC is a plus )\n• Good Knowledge of database architecture and design (SQL Server, MySQL). \n• Well versed in software engineering principles, frameworks and technologies.\n• Excellent communication skills\n• Self-directed team player who thrives in a continually changing environment\n• Silverlight and XAML Design is a plus\n• 0-2 years' experience in the above competencies. \n\nIf you are interested forward your CV to mohamed.elkerdany@gmail.com","caption":null,"description":null,"created_time":"2013-07-10T00:33:09+10:00","total_likes":2,"total_comments":2},{"id":"172338516139198_592035574169488","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":null,"caption":"makeuseof.com","description":"A signature tells you something about a personality. Just as two people hardly write alike, they also sign differently. That’s how the “science” of Graphology came into being. But the digital age and the email signature have reduced the way you sign-off on a mail to a footnote. Just a typed name, an...","created_time":"2013-07-12T04:08:35+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_592292510810461","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"Aaron Skonnard writes about The Power of Teaching Online: \n","caption":"blog.pluralsight.com","description":"When I first started teaching professional courses on software development, I quickly fell in love with the process. I really enjoyed the process of breaking down difficult technologies and creatin...","created_time":"2013-07-12T12:31:46+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_592442474128798","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"For automatic deployment from TFS","caption":"blog.pluralsight.com","description":"Microsoft announced today that they've completed the acquisition of the InRelease product, team and all from InCycle Software and they're wasting no time getting the product into the hands of devel...","created_time":"2013-07-12T22:49:29+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_592957814077264","from":{"name":"Mohamed El Kerdany","id":"10155060165569919"},"message":"CMS expert ( Drupal , Joomla , ... ) needed  for freelance job , if interested contact me on mohamed.elkerdany@gmail.com","caption":null,"description":null,"created_time":"2013-07-13T21:39:42+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_592981740741538","from":{"name":"Mohammad Tayseer","id":"10154965677956341"},"message":"Estonian government released the source code for their voting system","caption":"github.com","description":"evalimine - e-hääletamise tarkvara","created_time":"2013-07-13T23:04:49+10:00","total_likes":8,"total_comments":3},{"id":"172338516139198_593128510726861","from":{"name":"Emad Mokhtar Habib","id":"10158372089300634"},"message":"تنصحوا بإيه للإدارة، انا فجأة لقيت نفسي بدير مشروع و معايا واحد كمان في التيم، الحمدلله عارف ازاي اتعامل مع العميل بس حاسس ان في حاجة غلط للتعامل مع الشخص الي معايا بجد بيعمل شغل يوم في اسبوع و للعلم احنا بنشتغل لتفسينا مافيش شركة بديرنا يعني لا شكوة لمدير ولا خصم و لا حاجة من الكلام دا نافع، انا مش فاهم اصلا العيب فيا ولا فيه و مش عارف اعمل ايه مبحبش مودوع ال micro management\nاتعمل فيا كتير و بكرهه و غالبا مبيجبش نتيجة.","caption":null,"description":null,"created_time":"2013-07-14T05:58:48+10:00","total_likes":0,"total_comments":22},{"id":"172338516139198_593532090686503","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"The Easiest Way To Document Your Project","caption":"daux.io","description":"The Easiest Way To Document Your Project","created_time":"2013-07-15T03:45:46+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_593552320684480","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"teaching-materials.org","description":"This site hosts a variety of CC-licensed web development curriculum which was developed for GirlDevelopIt SF as well as conference trainings. This curriculum is designed to be taught, but it may be useful to students as well. This table lists all the curriculum:","created_time":"2013-07-15T04:44:19+10:00","total_likes":2,"total_comments":0}]}