{"posts":[{"id":"172338516139198_857294514310258","from":{"name":"Marwa Dosoky","id":"10155139969921248"},"message":"\"Git\" gurus, could you please help me in something\n\nAs far as I know, Git access could be manipulated through server user/group authentication. but is there is any way that I can use another access authentication regardless the OS server authentication?","caption":null,"description":null,"created_time":"2014-12-07T18:16:16+11:00","total_likes":1,"total_comments":8},{"id":"172338516139198_857155507657492","from":{"name":"Ahmed Kamal","id":"10203100096301505"},"message":"Can you recommend me some resources that I could study from in the following  topics (architecture , scalability and system design) ?","caption":null,"description":null,"created_time":"2014-12-07T09:25:11+11:00","total_likes":0,"total_comments":7},{"id":"172338516139198_857366490969727","from":{"name":"Ahmed Abdurrahman","id":"1394376843970680"},"message":"Did you ever wonder what's the difference between a Geek and a Nerd?\n\nAlso, message to geeks, did you bite off the head of a live chicken? No? Then don't call yourself a geek anymore until you do :D\n\nBack in the early 1900s, when traveling carnivals were popular, there was a performer called the \"geek.\" His job was to perform bizarre and disgusting acts for the amusement of the locals. Notably, this included biting the heads off live chickens.","caption":"wikihow.com","description":"\"You're a geek!\" \"You're a nerd!\" Is that a compliment, a diss, or what? What does that even mean, anyway? It can be confusing, especially since there's some crossover between the two, making possible geeky nerds…or nerdy geeks! This a...","created_time":"2014-12-07T22:58:46+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_857394140966962","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"Does anyone here have a reccomended video to explain reqular expressions in a \"for dummies\" manner,  (absolute beginner) ?\n\nI am not interested in tools, I would like to understand them please, it seems I have some disability that has never alowwed me to make any sense of them at all.\n\nPlease put me out of my shame and misery....","caption":null,"description":null,"created_time":"2014-12-08T00:29:29+11:00","total_likes":6,"total_comments":25},{"id":"172338516139198_857390554300654","from":{"name":"Khaled Ramadan","id":"10155975474214478"},"message":"Any help concerning working on a hybrid webforms/MVC5 project?\nlocalization did not work, we have a normal master page and we successfully loaded  mvc views inside it but localization on master page stopped rendering :(","caption":null,"description":null,"created_time":"2014-12-08T00:19:02+11:00","total_likes":0,"total_comments":2},{"id":"172338516139198_857142147658828","from":{"name":"Khaled Fares","id":"1051388154965675"},"message":"لو فيه مجموعة طلبة في نفس السن بيعملوا startup إيه الأخطاء اللي المفروض مايعملوهاش من ناحية التعامل بينهم؟، و إزاي يديروا النظام الهرمي للشركة(و ياريت لو أي اقتراحات لطريقة تانية لتوزيع المهام بينهم؟).","caption":null,"description":null,"created_time":"2014-12-07T08:34:10+11:00","total_likes":7,"total_comments":25},{"id":"172338516139198_857093660997010","from":{"name":"Hady Ahmed","id":"10210684524123349"},"message":"\"I hate code, and I want as little of it as possible in our product. – Jack Diederich\nOn some of my most productive days, when I've felt that I've truly generated lots of value for my employer relative to my salary, the end result from an entire day worth of work was 3-5 lines of code . Other great efforts that I'm really proud of is removing thousands of lines of code from a project.\"\n\nDoes everyone else share the same sentiment? I personally do find this notion of how many lines of code per hour to be fundamentally wrong but it's also interesting that I too believe the very best work days I've had in the past 10 years were spent removing code than writing code.","caption":"quora.com","description":"Mattias Petter Johansson's answer: > \"I hate code, and I want as little of it as possible in our product.\" – Jack Diederich On some of my most productive days, when I've felt that I've truly generated lots of value for my employer relative to my salary, the end result from an entire day worth ...","created_time":"2014-12-07T06:21:05+11:00","total_likes":7,"total_comments":4},{"id":"172338516139198_857466410959735","from":{"name":"Mohamed El-Kholy","id":"10154903509466885"},"message":"Telnet Record/Playback tool urgently needed \nI am working in a project where I need to do a lot of telnet and then do testing/development on the stream coming from the server, I was asking if there is any known software that can record and then playback the telnet stream so I can run the test cases when I am not able to connect to the specific servers, anyone aware of such a tool ?","caption":null,"description":null,"created_time":"2014-12-08T03:46:36+11:00","total_likes":0,"total_comments":8},{"id":"172338516139198_856456794394030","from":{"name":"Ahmed Raslan","id":"10158381834070029"},"message":"What do you think ?","caption":null,"description":"بتستخدموا انهى لغة للبرمجة فى شغلكوا ؟ و قولولنا انهى الأحسن PHP اللى هى Open Source :) ولا .Net؟ و ليه؟ :D","created_time":"2014-12-05T21:05:51+11:00","total_likes":0,"total_comments":25},{"id":"172338516139198_857887974250912","from":{"name":"Mohamed Taha","id":"1330199613713708"},"message":"و ده واحد شيوعى مالناش دعوه بيه =D","caption":"thenextweb.com","description":"Has the Internet, which is now disrupting industries as disparate as media, transportation, healthcare, finance, education and commerce, benefitted society?","created_time":"2014-12-08T23:07:28+11:00","total_likes":0,"total_comments":0}]}