{"posts":[{"id":"172338516139198_903169376389438","from":{"name":"Abdelrady Fcis","id":"10211811206896077"},"message":"visibility: hidden; vs. display: none;","caption":"stackoverflow.com","description":"What is difference between Display vs. Visibility properties?","created_time":"2015-03-02T22:34:54+11:00","total_likes":3,"total_comments":10},{"id":"172338516139198_902859886420387","from":{"name":"Adham EL-Deeb","id":"1416098221767975"},"message":"Hey geeks, i created this website in order to help us find each other more easily by skills, location or university, and i hope you all sign up.\n\n#geek #geekhub","caption":"geekhub.io","description":"Geekhub helps you find geeks by their skills, domain, location or university to pair program with them or work on side project, start up or fix your code bugs.","created_time":"2015-03-02T05:33:53+11:00","total_likes":24,"total_comments":25},{"id":"172338516139198_903353636371012","from":{"name":"Mohammed Ahmed Essayyed","id":"1256492837733669"},"message":"The biggest Geeks event ever in Egypt :D \nAll Geeks and Maker's meeting point ;)\nTickets available inbox me :)","caption":null,"description":"Maker Faire Cairo is the biggest event to ever hit the Egyptian maker community!","created_time":"2015-03-03T07:37:35+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_903308343042208","from":{"name":"Mohamed Abdel Aty","id":"10212491964880718"},"message":"stackoverflow.com does not seem to work from some TEdata ip ranges , did anyone face a problem with the website ?","caption":null,"description":null,"created_time":"2015-03-03T05:29:58+11:00","total_likes":1,"total_comments":8},{"id":"172338516139198_903376513035391","from":{"name":"Islam Mustafa","id":"10158350493475716"},"message":"I have 2 group tickets (4 persons each), let me know if you are interested.","caption":"Cairo Mini Maker Faire","description":"The First Maker Faire in Egypt & Arab World\n\n\n\nكلنا واحنا صغيرين كنا بنعمل\nمراكب ورق\nطيارات\nو مسدسات الأقلام و لما يجيلك هدية عربية سابق ولاحق كنت لازم تفككها و تحاول تركبها تانى \nو مكنتش بتقاوم لو شفت سلك و لمبة إنك توصلهم عشان تنور!\nده هو الميكر!\nكتير مننا الميكر اللى جواه اختفى شوية مع الوقت! جه الوقت عشان ترجعه!\n\nالإيفينت ده لأى حد ينفع يتسمى ميكر Maker\nيعنى من أول اللى بيحب التكنولوجيا للطلاب و الفنانين والمهندسين و الحرفيين-- كل شخص ليه علاقة بمجال التصنيع أو التعليم أو حتي ريادة الأعمال -- لو نفسك ترجع الميكر بتاع زمان فده مكانك!\nفى الأول و فى الأخر كلنا ميكرز! حتى و انت بتطبخ أكلك فانت بتصنع حاجة.\n-----------------------------------------------------------------------------------------------------------------------\nفى يوم 7 مارس فى \"الجريك كامبس\" فاب لاب إيجيبت هينظم بالتعاون مع مركز معلومات بالسفارة الأمريكية بالقاهرة  و برعاية إنتل.. أكبر \"إيفينت\" فى مصر هدفه إنه  يجمع ناس مختلفة من مجالات كتير مبيجمهعمش غير حماسهم لجمع المعرفة و الشغل بالإيد..لو عندك مشروع أو فكرة ممكن تعرضها و ده يديك فرصة تبقى واحد من المشاركين فى ورشة الCrowdFundung اللى هيقدمها زووماال عشان يساعدك على عمل حملتك الخاصة.\n\nهيكون فيه ورش عمل لكل الأعمار زى:\n\nArduino \n3D Printing \nOrigami\nعمل الإكسسوارات\nRobotics\nإعادة التدوير\nCosplay\nنجارة و لحام\n\nو ممكن تشارك فى مسابقة زى \nC.O.R.D Robot Battle \nو تعمل الروبوت الخاص بيك و تكسب صحابك \n\nأو تحضر لمحاضرين كتير من بلاد مختلفة عربية و أجنبية يحكوا\n عن قصص النجاحات و عن مستقبل الصناعات\n و ال Maker Movement فى مصر! \n\nو للعلم..اليوم ده عائلى عشان كده عملنا منطقة\n مخصصة للأطفال هتقدم ورش عمل و أنشطة طول اليوم !\n\nتقدر تشترى تذاكر الميكرفير عن طريق \nEventtus أو عن طريق ال partners بتوعنا فى المناطق المختلفة\nو متنساش تشترى التذكرة قبل يوم 20 ب 30 جنيه بس !\n*ممكن نحط لوجوهات الأماكن**\n\nكايرو مينى ميكرفير هو المكان اللى بسهولة هتقابل\n ناس شبهك فى تفكيرك و تتعرف على ناس جديدة مختلفة برضه\n بس بيربط بينكم حماسكم و حبكم لجمع المعرفة و الشغل بالإيد!!\n\n--------------------------------------------------------------------\n\nالميكرفير هو يعتبر تقريبا أعظم حدث عالمي بيتعمل من سنة 2006 و لحد دلوقتى فى الولايات المتحدة الأمريكية و مناطق مختلفة فى العالم منهم أوروبا و أسيا بيجمع كل المهتمين بالتكنولوجيا و التصنيع و الحرف اليدوية و حتى ريادة الأعمال عشان يعرضوا مشاريعهم و أفكارهم فى شكل سهل و ممتع يخلى أى شخص مهما كانت خلفيته العلمية إنه ينبهر و يستمتع و يتعلم و يشارك عائلته و أصدقائه.\nفيه أكتر من 1,800,000 شخص حضروا الميكرفيرز المختلفة \nحوالين العالم من 2006 و لحد 2013!\nالسنة دى \"الميكرفير\" وصل مصر فى شكل Cairo Mini Maker Faire\n#كلنا_ميكرز، حتى و انت بتطبخ أكلك فانت بتعمل حاجة و اسمك ميكر\n\nايه هو\"مينى ميكر فير كايرو\"؟\nفى يوم 7 مارس 2015 فى الجامعة الأمريكية بالتحرير \"الجريك كامبس\" هيتعمل أكبر \"إيفينت\" فى مصر لحد دلوقتى هدفه إن يوصل و يجمع ناس مختلفة جدا مش هتشوفهم أبدا متجمعين غير فى اليوم ده..هتلاقى الناس المجانبن بالتقنيات الحديثة أو اللى بيطلق عليهم ال\"جيكس\" ، و الفنانين، و المهندسين، و أصحاب الحرف اليدوية، و رواد الأعمال و أكتر من كده هييجوا من كل حتة فى مصر عشان يعرضوا أفكارهم و مشاريعهم و يتعلموا و يكتشفوا أفكار و مشاريع جديدة و الأهم من ده المشاركة!\nده المكان اللى بسهولة هتقابل ناس شبهك فى تفكيرك و تتعرف على ناس جديدة مختلفة برضه بس بيربط بينكم حماسكم و حبكم لجمع المعرفة و الشغل بالإيد!!\nهدف الإيفينت هو تعليم و تربيط الناس مع بعض و كمان عشان الناس تستمتع و تعرف إن العلم و التكنولوجيا و التصنيع حاجة ممتعة و جوانا كلنا من زمان و مستنية بس الفرصة تطلع..كل ده عن طريق ورش تعليمية و محاضرات لناس من أماكن مختلفة فى العالم و مشاريع و مسابقات!\n\n\nليه كلمة \"مينى\"؟ هل هو عشان \"إيفينت\" صغير؟\nلأ خالص، مفيش أى حاجة ممكن يتقال عليها صغيرة فى الإيفينت ده، ما عدا طبعا ازاى البوردات الإلكتروينة بقت أصغر و أصغر و فى نفس االوفت أقوى إنها تكون مصدر الطاقة لمعظم المشاريع اللى هتشوفها فى اليوم ده..كلمة \"مينى\" معناها إن الإيفينت محلى و بيستهدف المحافظات المصرية. أول ما تشوف كلمة \"مينى\" تفتكر علطول ازاى الإيفينت بتاعنا كان مختلف!\n\nالإيفينت ده لأى حد يعنى من أول اللى بيحب التكنولوجيا للشخص المجنون بيها و المحترف،للطلاب و المهندسين و الفنانين و الحرفيين و لكل شخص ليه علاقة بمجالات التكنولوجيا أو التصنيع أو التعليم أو ريادة الأعمال لو انت شايف نفسك ميكر\n! فده مكانك و لو انت مش منهم بس بتحترمهم فده برضه مكانك\n\nممكن تحجز تذاكرك من هنا: http://goo.gl/3i4yiu\nالتذكرة للفرد 30 جنيه مصرى\nالتذكرة للعائلة (4 أفراد) 100 جنيه مصرى\nأو من فاب لاب مصر:\nhttps://www.facebook.com/fablab.egypt\nتابعنا من هنا:\nhttps://www.facebook.com/makerfairecairo\nhttps://www.twitter.com/makerfairecairo\n\nو للتواصل معانا على الإيميل ده: info@makerfairecairo.com\n\nو لأى تواصل متعلق بالPartnerships او ال Sponsorship ممكن تتواصل معانا على pr@makerfairecairo.com\n\n\nAbout Maker Faire:\nMaker Faire is the Greatest Show (and Tell) on Earth—a family-friendly showcase of invention, creativity and resourcefulness, and a celebration of the Maker movement. It’s a place where people show what they are making, and share what they are learning.\n\nMakers range from tech enthusiasts to crafters to homesteaders to scientists to garage tinkerers; they are of all ages and backgrounds.\n\n\nMini Maker Faire Cairo:\nOn March 7 , The GrEEK Campus, In collaboration with our partners, will the biggest event to ever hit the Egyptian maker community where Geeks, Artists, Engineers, Craftsmen, Entrepreneurs and more come from all over the country to show, learn and discover awesome new thing and ideas. It’s a place to meet new interesting likeminded people that share your level of passion for what you love.\nThe aim of Mini Maker Faire Cairo is to entertain, inform, connect and grow this community through workshops, sessions, projects, exhibitions and performances.\n\nWhy Mini? Is it small or for little things?\nNo, there is nothing small about this event, except for maybe how amazingly small the circuit boards have become which power some of the exhibits. The “mini” in Mini Maker Faire Cairo just means that it’s a locally-produced event. Whenever you see “mini,” just think Uniquely how the event is!","created_time":"2015-03-03T08:50:35+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_903314026374973","from":{"name":"AbdAllah Khashaba","id":"850869651733894"},"message":"Hay guys\n\ni am in a big trouble with time and making decisions :( \n\nRight now , I work as a free lancer\n\nI have a Long list of clients waiting and need Projects to be done.\n\nI have some chances to get out from egypt .\n\nI have two offers to start a new company with some serious guys from KSA and Oman.\n\nI have (wasta) to get employed in Government :)\n\nI am studying for masters degree in Electronics and Comm.\n\nI have a great ideas that i really need to implement as a personal project.\n\nEvery day in the morning i say WTF , I need to focus and start doing something\n\nwhat would you focus on if you were in my place ?","caption":null,"description":null,"created_time":"2015-03-03T05:47:34+11:00","total_likes":7,"total_comments":22},{"id":"172338516139198_903143646392011","from":{"name":"Kareem Elansary","id":"10155149930945530"},"message":"Print any array into a table, try it in your chrome console :\n\nvar teams_data = [{team: 'Chelsea', goals: 4}, {team: 'Man. Utd', goals: 3}];\nconsole.table(teams_data);","caption":null,"description":null,"created_time":"2015-03-02T20:59:43+11:00","total_likes":17,"total_comments":7},{"id":"172338516139198_903572739682435","from":{"name":"Sameh Magdy","id":"1390728197650488"},"message":"What do you think of this, guys?\nYeah, We had Android-x86 but it wasn't that good..This's the next level.","caption":"consoleos.com","description":"Introducing Console OS with Android™ Inside. We’ve taken Android apart, and put it back together for your PC. Console OS is a fork of Android designed to take everything that has made mobile awesome, and bring it back to your PC.","created_time":"2015-03-03T21:03:37+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_903152363057806","from":{"name":"Meligy","id":"10154884040385170"},"message":"Since you seem to like these things :D","caption":"medium.com","description":"As you might know that I had a problem getting back on track after my first startup faild.","created_time":"2015-03-02T21:38:14+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_903739686332407","from":{"name":"Mostafa El-marzouki","id":"1145427308900459"},"message":"الارنب والسلحفة :D ليه اشتغل فى تيم :v\nRoot (y)","caption":null,"description":null,"created_time":"2015-03-04T05:07:28+11:00","total_likes":11,"total_comments":0}]}