{"posts":[{"id":"172338516139198_1349918891714482","from":{"name":"Ahmed Kamal","id":"10203100096301505"},"message":"Why is chrome consuming too much memory. It is lagging although it is consuming more than 4 GB. When I restarted it (only one tab running and of course some extensions) it initially reserved 2.6 GB. Are there any tips to improve this ?\n\nAnd yes I know about The Great Suspender :)","caption":null,"description":null,"created_time":"2017-01-10T03:02:26+11:00","total_likes":1,"total_comments":3},{"id":"172338516139198_1349978508375187","from":{"name":"Ahmed Essam","id":"440145042983821"},"message":"How to make Audio Recording application using Python","caption":"ahmedessam.me","description":"In this quick tutorial I'm gonna show you how to make a tiny Audio Recording script using Python. First of all we need a module called `pyaudio` to manage this process.","created_time":"2017-01-10T04:45:58+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1350036018369436","from":{"name":"Mariam Armia Keriakos","id":"10154204158832382"},"message":"Dear Friends , I invite you to TechWomen Info session on the 11th of January , this is a life changing experience that invite every lady in the field of STEM (science , technology , math and engineering )to attend","caption":"Info Session about TechWomen Program 2017 (Cairo)","description":"يوم الاربع الجاى مشترك هيستضيف جلسة تعريفية عن زمالة مبادرة (TechWoman)، بالتعاون مع خريجى الزمالة من السنين السابقة . \n\nمبادرة TechWoman فى الاصل هى عبارة عن مبادرة للإرشاد والتبادل تم إعلانها فى يونيو 2010 فى الولايات المتحدة الامريكية بمشاركة 37 مشارك من الجزائر ومصر والاردن ولبنان والمغرب وفلسطين .\n\n وبمناسبة فتح باب التقديم لبرنامج TechWoman لعام 2017، مشترك بينظم جلسة تعريفية عن الزمالة للمساعدة فى التعرف على البرنامج. \nباب التقديم للزمالة هيفضل مفتوح على الرابط : \n\nلو عندك سنتين ىخبره في مجالات العلوم،  التكنولوجيا أو الهندسة أو الرياضيات STEM.. فدى فرصة انك تيجى مشترك يوم 11 يناير الجاى عشان البرنامج هينتهي في يوم 17 يناير من إستقبال طلبات التقنيات الرواد فى العلوم والتكنولوجيا والهندسة والرياضيات من  أفريقيا، جنوب و وسط اسيا و الشرق الاوسط لمدة خمس أسابيع في شهري سبتمبر و أكتوبر 2017. \n\nوخلال مدة البرنامج هتتلقى المشاركات  تدريب مهني و المشاركة في برنامج لتبادل المعرفة و الخبرات، وذلك في كبرى الشركات في ٍSilicon Valley و سان فرنسيسكو.\n\n\nعشان تتعرفوا أكتر على معلومات خاصة بالتقديم هتلاقوها على الموقع :\n  www.techwomen.org \n اخر ميعاد للتقديم في الزمالة هو 17 يناير 2017.\n\nمستانينكم يوم الأربعاء 11 يناير 2017 في مشترك، عشان نقول لكم أكتر عن ازاي تقدموا لبرنامج TechWomen.\n\nللتقديم يرجى ملئ الاستمارة: https://goo.gl/forms/dA2srEU4sizKqwoJ3","created_time":"2017-01-10T06:14:11+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1350140525025652","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"medium.com","description":"We’ve released an awesome tool curating best free stock photos, videos, mockups, icons, fonts and colors in one place.","created_time":"2017-01-10T09:12:11+11:00","total_likes":5,"total_comments":0},{"id":"172338516139198_1350001925039512","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"What do you think about the fact that MacOS is the only platform where you can develop iOS apps? \nI find it extremely exclusive and annoying, personally.","caption":null,"description":null,"created_time":"2017-01-10T05:26:44+11:00","total_likes":3,"total_comments":9},{"id":"172338516139198_1349951821711189","from":{"name":"Eslam Shaker","id":"10211766452853890"},"message":null,"caption":null,"description":null,"created_time":"2017-01-10T04:02:27+11:00","total_likes":25,"total_comments":6},{"id":"172338516139198_1347332378639800","from":{"name":"Mohamed Moshrif","id":"1235868066468537"},"message":"اكتشفت لسة دلوقتي إن هيئه تنظيم الاتصالات قفلت skype في مصر خلاص على كل الشركات. طبعا اللي شغله معتمد عليه ببساطة كده بيقوله ليه \"fuck you\" واخبط راسك فالحيط!\nالظريف إن skype مش شغال حتى عن طريق ال proxies وال VPN. بتيعمل connect عادي وتيجي تكلم حد, مفيش صوت.\nساعات ممكن يشتغل معاك بس كلمت خدمه عملاء فودافون و TE Data والاتنين بيقولوا اتقفل خلاص!","caption":null,"description":null,"created_time":"2017-01-07T03:31:54+11:00","total_likes":17,"total_comments":22},{"id":"172338516139198_1350880168285021","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"DeepStack: Expert-Level Artificial Intelligence in\nNo-Limit Poker","caption":"arxiv.org","description":"The identifier you have specified (arXiv:1701.01724v1.pdfDeepStac) appears to be invalid. Please inform help@arxiv.org if you believe that the identifier should correspond to a valid paper in arXiv.","created_time":"2017-01-11T04:42:10+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1350163528356685","from":{"name":"Mohamed Moshrif","id":"1235868066468537"},"message":"سؤال سريع لاي حد جرب يفتح شركة في مصر. نظام الضرايب بيتعمل إزاي؟ الناس فعلا بتدفع 40% من الارباح ولا بتعمل إيه؟","caption":null,"description":null,"created_time":"2017-01-10T09:59:07+11:00","total_likes":6,"total_comments":2},{"id":"172338516139198_1351128821593489","from":{"name":"Mohamed Oun","id":"10210546759477547"},"message":"The creator of Swift joins Tesla as VP of Autopilot Software.","caption":"tesla.com","description":"We would like to welcome Chris Lattner, who will join Tesla as our Vice President of Autopilot Software. Chris’s reputation for engineering excellence is well known. He comes to Tesla after 11 years at Apple where he was primarily responsible for creating Swift, the programming language for building...","created_time":"2017-01-11T12:37:25+11:00","total_likes":20,"total_comments":0}]}