{"posts":[{"id":"172338516139198_454353694604344","from":{"name":"Yasser Makram","id":"10154130456916548"},"message":null,"caption":null,"description":"هل تمتلك جهازا بدون خاصية الجي بي إس ومع ذلك يمكن تحديد مكانك بدقة عالية. لاحظت ذلك مع جهاز iPod الخاص بي فمع تأكدي من خلوه من تقنية gps إلا أن خرائطه كان يمكنها تحديد مكاني. بالبحث وجدت أن أحد التقنيات المستخدم هو سيارات تدور لتلتقط إشارات المودمات اللاسلكية وتسجيل أسمائها وأماكنها وبالتالي يمكن استخدام هذه المعلومات لتحديد مكان أي جهاز يستخدم هذه المودمات.\nولكن بعد تركيبي لمودم بأيام قليلة وجدت مكاني قد تم تحديده بدقه خارج العاصمة وبدون وجود شبكات لا سلكية أخرى قريبة تبينت أن التقنية المستخدمة ولا بد أنها تعتمد أسلوب آخر أقل تكلفة وأكثر انتشارا.\nتبينت أن معظم شركات الهاتف النقال تجمع بيانات مستمرة بالشبكات اللاسلكية وأماكنها مما يجهل كل جهاز هاتف مزود بخاصية gps جاسوس خفي يتعرف على مكانك.\nهذه التقنية بالطبع سلاح ذو حدين فهي تتيح خدمات أفضل تعتمد على المكان إلا أنها في نفس الوقت تنتهك الخصوصية وتضعك دائما تحت شكل من أشكال الرقابة.","created_time":"2012-08-29T18:11:52+10:00","total_likes":0,"total_comments":4},{"id":"172338516139198_454785041227876","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":null,"caption":"programmers.blogoverflow.com","description":"One of the very first ideas we had for this blog was to convert some of the wonderful gems of the early era of our site, the undisciplined period, to blog posts. Questions that were once enthusiastically received by the community, but no longer fit Programmer’s scope.","created_time":"2012-08-30T22:23:50+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_454788791227501","from":{"name":"Ahmed Magdy","id":"10154728972235376"},"message":"How to fix \"Namespace prefix 'xsd' is not defined.\" error in SharePoint 2010","caption":null,"description":"Microsoft SharePoint 2010: If you got \"Namespace prefix 'xsd' is not defined.\" error as in the image so to fix this:\r\n\r\n1) Set your browser to use IE8 standards - you can do this by using F12 to get the IE developer tools panel and setting Document Mode to IE8 standards in the developer tools menu/ribbon thing.\r\n\r\n2) Add the meta tag: <meta http-equiv=\"X-UA-Compatible\" content=\"IE=8\"/> to your master page. This will force the browser to use IE8 Standards.\r\n\r\nUnfortunately you lose the benefit of the IE9 rendering engine which why it might be preferable to use the first method as and when required, rather than forcing all IE9 users to effectively downgrade to view your pages.\r\n\r\nRef: http://www.spdoctor.net/Pages/message.aspx?name=namespace-prefix-xsd-is-not-defined","created_time":"2012-08-30T22:36:49+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_454849017888145","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"Free course from Pluralsight :)\nhttp://pluralsight.com/training/Courses/TableOfContents/spa","caption":null,"description":null,"created_time":"2012-08-31T02:03:24+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_454908334548880","from":{"name":"Yasser Makram","id":"10154130456916548"},"message":null,"caption":null,"description":"هل نظام براءات الاختراع يساعد فعلا على الإبداع؟\nوضع نظام براءات الاختراع للحفاظ على حقوق المبدعين وتوفير مظلة أمان من السرقة وخاصة لحماية الكيانات الصغيرة من جور الشركات ذات الميزانيات الضخمة واستغلال ميزانياتها في قتل إبداع الصغار بسرقتها وتسويقها بشكل أفضل. ذلك على المستوى النظري.\nولكن على المستوى العملي أثبت نظام البراءات أنه يسمح بتسجيل أفكار أساسية معطلة لأي شكل من الإبداع ، ولكن الإبداع والتطور مستمر  في مجال البرمجيات فكيف يمكن تفسير ذلك؟\nببساطة مجال البرمجيات حديث للغاية والتطور فيه مذهل فالشركات الكبيرة يمكنها الالتفاف على هذا النظام باتفاقيات تبادل البراءات مثل الاتفاق القائم بين مايكروسوفت وأبل. أما الأفراد والشركات الصغيرة تفلت بارتفاع تكلفة المقاضاة وحرية النشر خاصة باستخدام الويب.\nولكن انتشار متاجر التطبيقات والسلطة التي تعطيها للشركات العملاقة قد تغير ذلك. فعملية المراجعة التي تقتصر الآن على بعض شروط الأمان وخطوط عريضة لجودة التطبيق قد تمتد إلى براءات الاختراع المستخدمة في التطبيق.\nعلى سبيل المثال ميزة أساسية في التطبيقات حاليا مثل استجابة التطبيق لاستدارة الجهاز إذا كانت مسجلة كبراءة لابد من ترخيصها لتستخدم ويمكن منع أي تطبيق لا يرخصها من الدخول على سوق التطبيقات. مثل هذه السياسات غير مفعلة حاليا لأن الأسواق في مرحلة البناء والشركات ترغب في تشجيع الأفراد والشركات لدخول السوق ولكن لا يجد ما يمنع من تفعيل هذه السياسات باتفاق بين افاعلين الأكبر في هذه الأسواق.\nيبقى الويب كخط دفاع أخير ضد هذه السياسات وهنا تظهر أهمية الوقوف بالمرصاد ضد أي شكل من أشكال الرقابة الحكومية على الويب. هذا ما أرى والله أعلم.","created_time":"2012-08-31T05:29:05+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_455320341174346","from":{"name":"Ramy Said","id":"10155924142787586"},"message":null,"caption":"overclocking-tv.com","description":"Today is a great day! Not because it is raining during the summer but because we are proud to announce that our factory ","created_time":"2012-09-01T08:12:09+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_455491621157218","from":{"name":"Ahmed Magdy","id":"10154728972235376"},"message":"\"لم يتم تعيين مرجع كائن لمثيل كائن\" ورقصني يا جدع!","caption":null,"description":null,"created_time":"2012-09-01T21:28:01+10:00","total_likes":2,"total_comments":5},{"id":"172338516139198_455585681147812","from":{"name":"Moutaz Shams","id":"1647326241951498"},"message":"قبل ما ترميني في مشاريعك مش كنت تـ comment الكود؟ مش كنت تـ comment الكود؟!","caption":null,"description":null,"created_time":"2012-09-02T02:44:20+10:00","total_likes":2,"total_comments":3},{"id":"172338516139198_455794801126900","from":{"name":"Mai Omar Desouki","id":"10212162531809485"},"message":null,"caption":"Kick-off meeting for Sharing The Point in Africa is coming Dubai","description":"I am very excited to announce the kick-off meeting for \"Share The Point in Africa\" event is coming to Dubai... \n\nSpeakers:\nJoel Oleson,\nMichael Noel,\nMark Miller,\nEric Harlan,\nPaul J. Swider,\nJohn Anderson.\n\n\nExact Location:\nIn front of the Dancing Fountain at Dubai Mall.\n\nCall: 00971551663033 to find out which exact place we will have dinner but it is around the fountain so you just reach there and call.\n\nOnce settled will update the event page here.","created_time":"2012-09-02T17:10:03+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_455798794459834","from":{"name":"Mahmoud Ibrahim","id":"10154874374735831"},"message":"That's good news \n","caption":"mashable.com","description":"Anonymous has vowed to revive Demonoid, a popular torrent sharing and tracking platform shut down by authorities last week.","created_time":"2012-09-02T17:33:12+10:00","total_likes":1,"total_comments":1}]}