{"posts":[{"id":"172338516139198_950944484945260","from":{"name":"Islam Azab","id":"10154876688426014"},"message":"What do you think about swear words used in a professional environment?","caption":null,"description":null,"created_time":"2015-06-01T05:09:45+10:00","total_likes":1,"total_comments":23},{"id":"172338516139198_952701801436195","from":{"name":"Omar Ahmed","id":"1003070356461793"},"message":null,"caption":null,"description":"السلام عليكم :)\n\n#القواعد_ال20_للنجاح  =D =D =D \n\nامبارح نزلت بوست عن كورس CCNA S&R  وكان في تفاعل عليه الحمد لله ... ناس استفادت منه  وفي ناس كانت طالبه نتكلم عن كورسات تانيه  .... جميل قوي  التنوع اكيد :)  =D\n\nبصو بقا في شويه حاجات  لازم نتكلم عنها بخصوص اي كورس هتخده بعد كدا اين كان بقا  كورس CCNA S&R او غيره  ولازم الكل يعرفها لكن ان في ارقام هتكون بخصوص كورس CCNA  :)\n\n1) ان هتدرس الكورس لوحدك يبقا تضبط يومك بحيث يكون ساعتين علي الاقل في اليوم مذاكره وبكدا ان شاء الله ممكن تخلص تحضير للامتحان في حوالي شهريين بالكتير :)\n\n2) ان هتدرس في مركز اسئل كويس علي المدرب واسئل عن المركز هل هو معتمد ولا ايه ... حاول تكون بتاخد الكورس من مكان معتمد :)\n\n3) ان هتدرس الكورس في مركز ... اغلب المراكز بيكون الكورس مرتين في الاسبوع حوالي 4 ساعات ... لازم قبل ما تروح المحاضره تكون مراجع وان حتي تبص علي الفات كله لسبب مهم جدا في اجزاء معتمده علي القبلها فبكدا تكون مستوعب اكتر وتفهم اسرع الجزء الجديد :)\n\n4) ان هتاخد الكورس لوحدك او في مركز يبقا يكون معاك كشكول محترم او شويه ورق علي حسب راحتك وتكتب الخلاصه من المحاضره ... هتحتاج الخلاصه بعدين قوي قوي قوي صدقني .. وعلي فكره الخلاصه ديه هي الهتراجع منها قبل المحاضره البعدها \" افضل ليك واسرع كمان \" :)\n\n5) كل لما تخلص جزء من الكورس حاول تراجعه كله وتربطه ببعض كويس علشان تثبت المعلومه في دماغك قوي ... ساعات معلومات مش بتكمل الا لما تربط موضوع بموضوع ومحاضره بمحاضره  :)\n\n6) كل لما تاخد جزء عملي حاول تطبقه هو و الجزء القبله كمان علشان مش تنسي ... قله التطبيق بتخليك تنسي  :)\n\n7) حاول تدخل في نقاش دايما مع زمايلك ان بتاخد الكورس في مركز ... النقاشات الكتير في الكورس بتزود المعلومه و بتثبتها في دماغك قوي ... وان بتاخد الكورس لوحدك في البيت في كذا جروب ممكن تكون عليه وتسئل وغيرك يجاوب وهكذا :)\n\n8) حاول تساعد غيرك ان حاجه واقفه معاه ... مساعدتك لغيرك ليها فوايد كتير قوي ... طبعا خير بتعمله وحاجه تاني المعلومه بتثبت بردو و ممكن بسبب مساعدتك لغيرك تكتشف معلومه من كلمه في النص مش كنت مركز فيها :)\n\n9) اول ما تقرب تخلص الكورس ان بتخده  في المركز بشهر كدا ابدا اعمل اجراءت حجز الامتحان لان غالبا هتاخد شهر  وكل اسبوع تتصل بيهم وتاكد عليهم و تخلي بالك من اسمك والاميل تكتبهم صح وتتاكد من كدا  بدل المره اتنين لان غالبا بينسو  وان بتخده لوحدك حاول بردو نفس الفكره ضبط قبل معاد الامتحان بشهر و زن عليهم كل شويه ... زن قوي :)\n\n10) قبل ما تدخل الامتحان ضبط من اسبوعين لشهر علي حسن تقديرك للكورس ولقدرت  تراجع فيهم المنهج بجدول محدد .... وتحل كتير قوي لحد لما توصل لمرحله انك تحل من غير ما تقرا باقي السؤال :)\n\n11) للاسف مش كل الاسئله مفهومه في اسئله لازم تحفظها ... وعلي فكره في احتمال كبير انك ان مش حفظت الاسئله ديه ممكن لقدر الله مش تعدي في الامتحان ... لكن دايما خدها نصيحه \" افهم كويس قوي علي قد ما تقدر وبعد كدا احفظ  كل حاجه فهمتها \" هيكون افضل ليك .... وان مش قدرت تفهم ولا حد قدر يساعدك انك تفهم حاجه  احفظها :)\n\n12) قبل الامتحان بيوم اهدي خالص  وحاول تعمل 3 حاجات وبس ... \n- اول حاجه تراجع من الكشكول او الورق الكتبت فيهم النقط المهمه.\n- تاني حاجه هتحل الامتحانات الموجوده بايدك اكتر من 10 مرات لحد لما توصل لمرحله انك بتحل الدمب كله مع بعض من غير اي غلطه .\n- ثالث حاجه هتراجع العملي بايدك كل اللابات علي البرنامج .\n\n13) علشان النجاح  لازم تجيب حوالي 825 من 1000 ... درجه كبيره جدا حتي في الكليات مش بنجبها ... لكن عايز اقولك ان عملت كل القلتلك عليه هتجيب ال 1000 من 1000 ان شاء الله وبسهوله كتير قوي جابوها :)\n\n14) الامتحان حوالي ساعتين  لحوالي 51 سؤال بيكون منهم حوالي 3 لابات ... علي ما اظن وقت كتير قوي ممكن تخلص في اقل من ساعه علي فكره بس نصيحه \" براحتك خالص انت مش هتتعب التعب دا كله وفي الاخر مستعجل مش لجنه كليه هي\"  :)\n\n15) لقدر الله ان لقيت سؤال جديد مش  تقلق فكر براحه وان شاء الله هتحله بسهوله وان خلاص جاب اخره معاك حاول تبعد الاجابات المستحيل تكون صح واستعن بالله واختار افضل اجابه :)\n\n16) خلي بالك مش ينفع تعدي السؤال الا واذا انت حالل السؤال مش تقول هسيبه للاخر يعني :)\n\n17) اسمع كل التعليمات كويس من المركز  وركز في الكلام علشان الغلطه ممكن تتحسب عليك ... وخلي بالك انت بتكون متصور اوعا تعمل حاجه كدا ولا كدا ;)\n\n18) بعد اخر سؤال في الامتحان احمد ربنا واستعد للنتيجه ... ايوه هتظهر قدامك علي طول بعد اخر سؤال ... مهما كانت هي ايه قول الحمد لله .... لكن ان شاء الله هتكون جايب ال 1000 من 1000  ونقولك مبروك يا هندسه :)\n\n19) بعد ما تخلص مش تنسي تاخد ورقه من المركز تثبت انك الحمد لله نجحت هتفيدك بعد كدا  وحاول تضبط معاهم موضوع انك تطلب الشهاده اين كانت نسجه تتبعت ليك PDF او تيجي ليك لحد البيت ... هما فاهمين اكتر مننا بدل ما نبهدل الدنيا :)\n\n20)  مش تنسي تدعي لينا بقا وان في حاجه تاني ان شاء الله هنزلها مره تاني  ... وحاول توصل الكلام دا كله لصحابك بقا وفدهم كدا .... ربنا يتقبل منا ومنكم صالح الاعمال :)\n\nان حابب تتواصل معايا تقدر تتابع الاكونت بتاعي :)\nOmar Ahmed\n\n#خلي_دايما_طريقك_GO","created_time":"2015-06-02T04:06:08+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_944311515608557","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Learn to code by building projects for nonprofits. No Excuses After today :)","caption":"freecodecamp.com","description":"Free Code Camp is a community of busy people who learn to code by collaborating on projects for nonprofits. Build your full stack JavaScript Portfolio today.","created_time":"2015-05-25T08:11:44+10:00","total_likes":25,"total_comments":2},{"id":"172338516139198_952450078128034","from":{"name":"Anas Rabei","id":"621823724675667"},"message":"wanna try new taste of linux distro \nI tried ubuntu, mint and trisquel. \n\nAny suggestion :) :)","caption":null,"description":null,"created_time":"2015-06-01T19:15:14+10:00","total_likes":1,"total_comments":22},{"id":"172338516139198_942737795765929","from":{"name":"Ahmed Zain Mohammed","id":"10155252594718081"},"message":"[PHP coders only]\nI never liked the idea of using a framework. Like many of us, I always had an opinion about everything in these frameworks, and I wanted things to be done MY way. \nAfter 7+ years writing PHP using my own frameworks (started with something called Unique, then Zonda and finally Rhino), I started looking at frameworks like Phalcon and Laravel, and I said to myself: it's time to use someone else 's code!\nSo, what is your framework of choice?","caption":null,"description":null,"created_time":"2015-05-22T05:12:14+10:00","total_likes":2,"total_comments":13},{"id":"172338516139198_952624271443948","from":{"name":"Ahmed Mabrook","id":"10210329906978730"},"message":"حل لمشكلة chrome و استهلاكه للـ Memory","caption":null,"description":null,"created_time":"2015-06-02T00:48:40+10:00","total_likes":25,"total_comments":17},{"id":"172338516139198_952930574746651","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"egyptiangeeks.com Was mentioned in this Radio Channel :) Well done Mohamed A. Baset :)","caption":"youtube.com","description":"Hosts: Steve Gibson with Leo Laporte Starbucks discovers the downside of convenience over security, the \"Venom\" vulnerability, and a look at how crooks are r...","created_time":"2015-06-02T17:06:27+10:00","total_likes":8,"total_comments":3},{"id":"172338516139198_952943488078693","from":{"name":"Ayman Ashmawey","id":"10207037587816735"},"message":"#ادعم_عبدالحميد","caption":null,"description":null,"created_time":"2015-06-02T18:12:39+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_952966441409731","from":{"name":"Ahmad Abubakr","id":"10211135002706823"},"message":"A good start for geeks in finance.","caption":"ericsink.com","description":"On my weblog I write a series of articles entitled Marketing for Geeks. The concept of these articles is that a lot of technically-oriented people actually do end up involved in marketing decisions. Most software startups are founded by one or more geeks, often without the presence of experienced pe…","created_time":"2015-06-02T19:59:35+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_952917418081300","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Very addictive game: Kuku Kube\n\nFind the different cube. Share on Moments to see who beats the most players.","caption":"106.186.25.143","description":null,"created_time":"2015-06-02T15:53:20+10:00","total_likes":8,"total_comments":5}]}