{"posts":[{"id":"172338516139198_751344204905290","from":{"name":"Ahmed Hassan","id":"10155190776529497"},"message":"Guys, I would really like to be able to look at the source code of some intermediate (in size and how difficult the code is to understand) projects. Where do you think I could find such open source stuff to look at? It's for study purposes basically, because I feel there's a gap in my knowledge that can only be filled with real world source code to look at but all I found in that regard is very complex applications. So any help would be appreciated.","caption":null,"description":null,"created_time":"2014-05-23T11:24:10+10:00","total_likes":0,"total_comments":4},{"id":"172338516139198_751262234913487","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Glue is a simple command line tool to generate sprites: ","caption":"glue.readthedocs.org","description":null,"created_time":"2014-05-23T06:54:37+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_751698291536548","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"We just released Borium as Open source: http://getborium.com/\n\nBorium is a lean queue job library to execute jobs in the background of web applications. It plays well with JavaScript, Python, Ruby, Bash.\n\nIt’s got two parts\n\nThe Server: In charge to keep the pending tasks organized and acts as the central task broker.\n\nThe Worker: Processing unit that run the actual tasks.","caption":null,"description":null,"created_time":"2014-05-24T03:58:42+10:00","total_likes":6,"total_comments":1},{"id":"172338516139198_751780888194955","from":{"name":"Ahmad El-Melegy","id":"10212913583341165"},"message":"Functional Programming and Thinking in Types in Haskell Online Course","caption":"Functional Programming and Thinking in Types in Haskell Course","description":"About the course : \n===============\nThis is a tailored course for developers who want to get their brains around the Functional Programming Paradigm, how to think functionally and what do you need to break the barriers and become a functional programmers, what are the benefits and how will this affect you even if you stick to your imperative language. The course will focus on the Haskell programming language but just as an illustration language, the concepts and ideas demonstrated in this course are the same in most languages and the lessons you will learn during this course will affect the way your brain work and eventually will make you a better and more conscious programmer.\n\nWe will cover the basics of Haskell programming language and eventually you will be able to understand the meaning of those words properly: Types, Type Variables, Monads, Type Classes, Value Types, Kinds, Applicatives, Functors, Pure Functions, Recursion, Tail Recursion Optimisation, Pattern Matching, Set/List Comprehensions, Currying, Algebraic Types.\n\nIf you are a life-long imperative programmer (Java, C, and etc.) you will enjoy this brain wrestling and I will challenge you to change the way your brain works.\n\nThe course is totally free, and will be delivered online.\n\nAbout the instructor :\n================\nAhmed Soliman is an entrepreneur, software and systems architect coming from a diverse background of highly scalable applications design, mission-critical systems, asynchronous data analytics, social networks design, reactive distributed systems, and systems administration and engineering. He also published a US technology patent in distributed computer-based virtual laboratories and designed numerous large-scale distributed systems for massive-scale enterprise customers.\n\nA software engineer at heart, he is experienced in over 10 programming languages, but most recently, he is busy designing and writing applications in Python, Ruby, and Scala for several customers. He is also an open source evangelist and activist. He co-founded CAT Reloaded students community and Nozom NGO.\n\nAhmed is a co-founder of Cloud Niners Ltd., a software and services venture focused on highly scalable cloud-based applications that have been delivering private and public cloud computing services to customers in the MEA region on different platforms and technologies. It’s the company behind TeeksForGeeks.com, SimTry.com, J25 Framework, Redique, and etc.\n\nHe is the author of [Packt Publishing] Getting Started With Memcached book (http://amzn.to/1gbh1T8) and the primary reviewer of [Packt Publishing] Python Network Programming Cookbook (http://amzn.to/1iTrrBC)\n\nHow to attend ? \n=============\n1- Register NOW : http://bit.ly/HaskellCourse\n2- Get the confirmation mail.\n3- Follow any new updates posted in the event page.","created_time":"2014-05-24T05:23:34+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_751820901524287","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"السلام عليكم, مايكروسوفت أصدرت فى شهر فبراير اللى فات إضافه للفيجوال ستوديو 2013 أكثر من رائعه وهى : \n# Bing Code Search for C \nبإختصار دى إضافه بتخليك تعمل بحث عن حلول للمشاكل الشائعه وانت شغال جوه الفيجوال ستوديو, وبتجيلك نتائج البحث على شكل فقرات كود جاهزه للإستخدام (Snippets).\nهم حالياً شغالين مع كذا موقع من ضمنهم طبعاً MSDN و StackOverflow واتنين كمان.\nدا رابط للإضافه هتلاقي معاه شرح بسيط لكيفية إستعمالها: http://visualstudiogallery.msdn.microsoft.com/a1166718-a2d9-4a48-a5fd-504ff4ad1b65\n\nودا فيديو بيشرح إستخدام الإضافه بشكل عملى: http://research.microsoft.com/apps/video/default.aspx?id=208961&r=1\n\nإستمتعوا :)","caption":"visualstudiogallery.msdn.microsoft.com","description":"This package allows you to search for snippets from the cloud and inserts them into your code without leaving Visual Studio.","created_time":"2014-05-24T06:20:02+10:00","total_likes":5,"total_comments":0},{"id":"172338516139198_751535271552850","from":{"name":"Mohammed Morsi","id":"10212986144227875"},"message":"2 dribbble invitations are available\n\n1- Follow me on dribbble \n2- Share this shot so everyone can participate \n3- Send me your work on twitter\n\nI'll announce the winners next month :)\n\n","caption":"dribbble.com","description":"2 dribbble invitations are available 1- Follow me on dribbble 2- Share this shot so everyone can participate 3- Send me your work on twitter I'll announce the winners next month :)","created_time":"2014-05-23T21:20:19+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_752155408157503","from":{"name":"Prog MB","id":"1827133047552706"},"message":"Gnu linux course session 8\n8- linux help (documention)\n","caption":"youtube.com","description":"Gnu Linux course كورس جنو لينكس facebook page: https://www.facebook.com/TechShare.mb facebook group: https://www.facebook.com/groups/techshare.mb","created_time":"2014-05-24T18:26:13+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_752172658155778","from":{"name":"Meligy","id":"10154884040385170"},"message":"Google \"dearest creature in creation\" :)\n\nText: http://www.mipmip.org/tidbits/pronunciation.shtml\n\nVideo Attempts: https://www.youtube.com/results?search_query=dearest+creature+in+creation","caption":"youtube.com","description":"Share your videos with friends, family, and the world","created_time":"2014-05-24T19:29:18+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_752178848155159","from":{"name":"Elsharnouby Mohamed","id":"10155040034611904"},"message":"Neutralizing the iOS camera click sound through active sound cancellation http://t.co/k03h9ZcuUo :-D","caption":null,"description":null,"created_time":"2014-05-24T19:49:56+10:00","total_likes":2,"total_comments":1},{"id":"172338516139198_751543934885317","from":{"name":"Eslam Hamouda","id":"10210277573008432"},"message":"واحدة من أفضل الـ Presentations اللي ممكن تشوفها عن الـ Security اليومين دول بالذات.\nالجزء الخاص بـ SQL Injection مضحك جداً جداً","caption":"youtube.com","description":"The prevalence of online attacks against websites has accelerated quickly recently and the same risks continue to be exploited. However, these are often easi...","created_time":"2014-05-23T21:47:41+10:00","total_likes":16,"total_comments":2}]}