{"posts":[{"id":"172338516139198_725358084170569","from":{"id":"540788204","name":"Ahmed Hassan"},"message":null,"caption":"الدليل الكامل لتعلم Angular JS في يوم واحد\n\nAngularJS هو إطار عمل JavaScript لطرف العميل يتبع بنية Model-View-Controller/Model-View-View-Model، ويعتبر اليوم مُهمًا لبناء تطبيقات ويب وحيدة الصفحة (SAP) أو حتى المواقع العادية. يُعتبر Angular JS قفزة كبيرة نحو مستقبل HTML وما يجلبه الإصدار الخامس منها (مع التطورات على صعيد JavaScript بالطبع!)، ويبعث الحياة من جديد في تعاملنا مع الويب الحديث. هذا المقال جولة شاملة في Angular JS مستخلصة من تجاربي ونصائح وممارسات تعلمتها خلال استخدامي.\n\nاقرأ المقال كاملا: http://goo.gl/hAPl4T على webtuts.me","description":null,"created_time":"2014-04-04T21:50:24+03:00","total_likes":1,"total_comments":3},{"id":"172338516139198_726543584052019","from":{"id":"100008079004211","name":"Dev Mustafa"},"message":"PHP / Drupal Developer\nAn excellent opportunity for an experienced in-house PHP web developer to help us on several challenging, on-going projects. The ideal candidate works with minimal direct supervision in a small team environment and has the capability of working under pressure to meet the deadlines and comfortable in a \"high-octane\" environment. Selected candidate(s) need experience in the entire software development lifecycle including: requirements, design, development, testing, and deployment. This position reports to the Manager of the applications development team.\nDuties and Responsibilities\n• Develop and maintain websites and functionality for various state agencies\n• Create and enhance database structures in accordance with web application design and reports;\n• Develop and promote the use of development standards to improve web security and enhance application design\n• Provide presentations and technical support for clients in relation to web application development\n• Understand user needs, requirements and requests to identify priorities, escalating urgent/conflicting requests\n• Proactively identify, develop and deploy solutions to improve effectiveness of technology delivered materials/information\n• Integrate systems using internal and third-party APIs\n• Develop Drupal Pages, Views, Blocks and Modules\n\nDesired Qualifications\n• 2+ years development experience in a LAMP environment (Linux, Apache MySQL, PHP)\n• 2+ years Basic Drupal Modules development experience.\n• Develop and implement modules in PHP and Drupal supporting web application functionality as necessary to meet requirements and design.• Drupal module development experience and an extensive knowledge of the Drupal core API and hook system\n• Strong understanding of object-oriented design principles\n• Experience with PHP MVC frameworks such as Zend, CakePHP, Symfony, etc.\n• Strong database skills\n• Experience working on the command line\n• Experience with Git, Subversion or other revision control system including merging, branching and tagging\n• Experience with standards-based HTML/CSS\n• Experience with Test Driven Development\nPersonal Skills\n• Dependable with a make it happen attitude\n• Excellent communication skills and ability to work in a team\n• Solution oriented\n• Team player in an agile environment. \nMinimum Qualifications:\n• 2  years web and database experience including creating & updating table structures and views as well as CSS development\n• Any equivalent combination of experience and/or education from which comparable knowledge, skills and abilities have been achieved.\n\nPlease Send CV to hr@boraqdigital.com with Job Title:Junior PHP / Drupal Developer","caption":null,"description":null,"created_time":"2014-04-07T10:51:33+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_726543667385344","from":{"id":"100008079004211","name":"Dev Mustafa"},"message":"Software Tester\n\n· A Bachelor degree in computer science or related discipline.\n\n· At least 1 year experience as a tester\n\n· Good knowledge in preparing and automation of testing plans\n\n· High attention to details\n\n· Familiarity with bug tracking and collaborative development systems, e.g., Team Foundation Sever (TFS) and Microsoft Test Manager is a plus\n\n· An ISTQB certificate is a plus\n\nJob description:\n\n· Testing web-based applications written in PHP against specification.\n\n· Report bugs to developers via TFS with sufficient details to reproduce the bugs.\n\n· Documenting testing scenario/cases that covers different types/level of testing\n \n· Experience with reviewing requirements and developing test cases based on those requirements.\n\n· Whitebox testing experience at the unit, integration and system levels.\n\n· Strong written and verbal communication skills are a must.\n\n· A good understanding of the software development process.\n\n· A good understanding of the business approach.\n\n· A good understanding of Software testing process and types.\n\n· Must be able to multitask and meet deadlines in a fast-paced start-up environment.\n\n· Attention to detail and strong problem-solving skills are critical.\n\nPlease Send CV to hr@boraqdigital.com with Job Title: Software tester","caption":null,"description":null,"created_time":"2014-04-07T10:51:57+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_726552174051160","from":{"id":"100000116116716","name":"Mohamed Sameeh Sharaf"},"message":"Urgent Required Asp.net MVC Developer\nat least one year experience on MVC \nsend cv at Sara.Ahmed@automationconsultants.com.eg\nor inbox me\nMust be graduated From Computer Science Faculty or Engineering Faculty and Not graduated from private university","caption":null,"description":null,"created_time":"2014-04-07T11:35:44+03:00","total_likes":1,"total_comments":1},{"id":"172338516139198_726108657428845","from":{"id":"100000116116716","name":"Mohamed Sameeh Sharaf"},"message":":)","caption":"apeoholic.se","description":"Download all the videos from Build 20146. April 2014 04:51 / Jimmy Engström / .NET Micro Framework . Gadgets . Windows 8 . Windows Phone / Comments (0)Build 2014 was packed with announcements and fun stuff.Still have a lot of videos to watch =)Here is an updated version of my script I previously blo...","created_time":"2014-04-06T13:50:04+03:00","total_likes":1,"total_comments":2},{"id":"172338516139198_726578837381827","from":{"id":"683805169","name":"Mohamed El Sayed"},"message":"I think it's not just for kids, some of you should relate ;)\nhttp://blog.pluralsight.com/kids-diy-programming-kits","caption":"blog.pluralsight.com","description":"If you’ve seen your kid take to your iPhone like a fish to water, maybe you’ve thought about how to get them interested in DIY, or introducing...","created_time":"2014-04-07T13:32:55+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_726698910703153","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-04-07T19:20:02+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_726700857369625","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-04-07T19:22:19+03:00","total_likes":0,"total_comments":0},{"id":"172338516139198_726723264034051","from":{"id":"652024918","name":"Amr Eldib"},"message":"For the small group of web developers who use Buttons :)\nhttp://tympanus.net/Development/ProgressButtonStyles/","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-04-07T19:58:50+03:00","total_likes":2,"total_comments":0},{"id":"172338516139198_726805160692528","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"130+ sites, apps & books that I recommend any designer should check out.","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-04-07T23:19:58+03:00","total_likes":2,"total_comments":0}]}