{"posts":[{"id":"172338516139198_1363512700355101","from":{"name":"Mohamed Galal","id":"10211997405714282"},"message":"ياشباب عايز اسجل android merchant account \nالمشكلة ان فيزا البنك الاهلي مش شغالة مع جوجل لدفع 25 دولار مع انها متفعلة للشرا من الانترنت\nلو حد عنده اكونت ممكن يقولي نوع الفيزا من بنك ايه اللى نفعت معاه","caption":null,"description":null,"created_time":"2017-01-24T08:04:28+11:00","total_likes":2,"total_comments":6},{"id":"172338516139198_1363841763655528","from":{"name":"Mohamed Gamal","id":"10155052545932328"},"message":"#python\nIs there a smarter way to check that fib.array exists?","caption":null,"description":null,"created_time":"2017-01-24T12:56:59+11:00","total_likes":1,"total_comments":5},{"id":"172338516139198_1363170807055957","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"Guys, I recently met 2 talented students who participated in a recent RubyConf in Portugal. They are focusing on empowering female students and teaching them how to code. If anyone is familiar with RailsGirls this is one of their activities.\nCurrently they are looking for coaches who are willing to volunteer and participate in a workshop where the get to introduce Rails to a group of students. If anyone is interested please let me know and I will put you in contact :)\nThank you","caption":null,"description":null,"created_time":"2017-01-24T03:22:50+11:00","total_likes":25,"total_comments":11},{"id":"172338516139198_1361448960561475","from":{"name":"Osama Soliman","id":"709206249239999"},"message":"تفتكروا انها حاجه مفيدة للFront-end Developer انه يحل Algorithms بشكل عام وبشكل خاص لو هو مش جاي من CS Background؟\nFor more about what kind of algorithms check my profile on this Online Judge ... \nleetcode.com/microsmsm","caption":null,"description":null,"created_time":"2017-01-22T10:46:03+11:00","total_likes":9,"total_comments":7},{"id":"172338516139198_1364665460239825","from":{"name":"AbdElkader Zaid","id":"1317087911681406"},"message":"السلام عليكم \nشباب فى موقع للمستقلين نازل قريب , الموقع هدفه هو حل المشكلات اللى بتقابل ال freelancers فى الدول العربيه فى المواقع الموجوده دلوقتى زى موقع خمسات او مستقل او نبش او غيره \nوبتقابل العملاء برضو فى انهم يضمنو يلاقو خدمه مضمونه \nمحتاجين يعرفو اكتر عن المشكلات اللى قابلت الفرى لانسر ويتمنى يلاقيلها حل زى مثلا طرق الدفع  وخصوصا فى مصر وهم مركزين جدا على مصر لان كتير من المستقلين مصريين او ان لو المستقل جديد بيلاقى صعوبه انه يحصل على اول شغل او الثقه والحياد فى تعامل الاداره فى ادارة اى مشكله تحصل بين المستقل والعميل واللى مش موجوده خالص فى موقع مستقل للاسف وفى ناس خسرت مجهود وتعب بسبب الموضوع ده \nياريت الناس اللى بيقابلها اى مشكله تشارك وكل التعليقات هوصلها لادارة الشركة اللى شغاله على المشروع ان شاء الله","caption":null,"description":null,"created_time":"2017-01-25T04:51:47+11:00","total_likes":8,"total_comments":1},{"id":"172338516139198_1365784310127940","from":{"name":"Mohamed Radwan","id":"10158356933185192"},"message":"All #Monitoring #tools in one page","caption":"bigpanda.io","description":"An overview of modern monitoring tools, including network, server, application, website monitoring and more.","created_time":"2017-01-26T00:07:59+11:00","total_likes":14,"total_comments":0},{"id":"172338516139198_1365767193462985","from":{"name":"Mahmoud Mortda","id":"1480228465362952"},"message":"Hi Guys, recommendation for a good java or c++  course in Cairo.  certified or noncertified training center??? \nThanks in advance","caption":null,"description":null,"created_time":"2017-01-25T23:43:35+11:00","total_likes":0,"total_comments":3},{"id":"172338516139198_1366002626772775","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"weave.works","description":"We look at our Grafana dashboards to understand our system. Make the most out of Grafana. Put your dashboards & configuration in version control.","created_time":"2017-01-26T03:10:54+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1366020096771028","from":{"name":"Hassan Saad","id":"303806276703088"},"message":null,"caption":null,"description":"طبعا كلنا عارفين Mr Robot والبروباجندا الرهيبة ال حصلت عليه على الفيس وكده بس مش ده موضوعنا دلوقتى , الـ عيزين نتكلم عليه دلوقتى الـ Attacks الـ حصلت فيه هل هى فعلا حقيقة وﻻ مازال فيها افورة السينما الامريكية , بصراحة هو يعتبر اكتر حاجة قريبا من الواقع بس مش اوى برده يعنى هم بيتكلموا على Attacks فعليا موجودة وصح بس تحس انهم بيعملوا Skip لخطوات فى النص يعنى يقولك شوية معلومات بس مش معلومات كافية خالص توضح فعلا الموضوع شغال ازاى واحنا حبينا نجرب السيناريو ده على اول Attack حصلت فى Mr Robot والـ هى Cafe Wifi , يلا نبدء :-\n\nايه بقه موضوع الـ Cafe Wifi ده وازاى الموضوع ده حصل اصلا حنحاول نوضح الموضوع على قد ما نقدر وعلى قد ما قدرنا نفهم من الـ Series تمام \n\nفى البداية عمو ايليوت دخل الكافيه وقابل الراجل صاحب الكافيه وبدء يقوله الكافيه ده النت فيه سريع جدا وده حاجة ممتازة جدا ونادرا ما بيلاقى ناس مستخدمة Fiber Optics وده نوع من الاسلاك سريع جدا بيخلى النت طلقة شبه TE Data :3 المهم فكمل ايليوت كلامه بان الموضوع ده خلاه يتسأل ليه النت سريع كده واكيد الباشا مش عمله عشان خاطر عيون الناس اكيد فى سبب ورا سرعة النت العالية دى فا ايليوت قرر انه يخش على الواى فاى ويبدء يIntercept كل الـ Packets الـ طالعة والـ داخلة الـ Network والموضوع نوعا ما سهل جدا لو هى فعلا واى فاى فا الـ Traffic المفروض سهل جدا انك تشوفه وتقراه وحتى لو مكنتش واى فاى وكان الموضوع نتورك بس عن طريق اسلاك مش واى فاى فكان بر ده ممكن يتعمل حاجة اسمها ARP Spoofing وتقدر برده تشوف الـ Packets الـ طالعة والـ داخلة من النتورك وممكن هنا تستخدم حاجة زى الـ Wireshark كده او اى Packet Sniffer تانى , بس هنا بقه عمو ايليوت متكلمش على ان الـ Traffic ممكن يكون مشفر مثلا زى HTTPS وكده هو كل الـ قاله انه قعد يراقب النتورك بتاعتهم وﻻحظ حاجات غريبة ومقلش ايه هى برده بس المهم ان الحاجات الغريبة ده الـ ﻻحظها خلته يقرر انه يخترق الراجل صاحب الكافيه عشان يعرف ايه الموضوع بس مقلش برده ازاى قدر يخترق الراجل ده ولو افترضنا انه فى الوضع ده ايليوت هو Cyber Security Engineer يعنى حد جامد جدا فا ممكن نقول انه عمل زى DNS Spoofing وخله عمو صاحب المطعم ده لما يكتب Facebook.com مثلا يبعته على Website تانى ويقدر ينفذ اى Exploit مثلا عليه امممممم بس ده على اعتقاد برده ان فيه Vulnerability فى الـ Browser بتاعه اعتقد حاجة كده ولو حد عنده اقتراح تانى ياريت يقوله :3 المهم ايليوت قدر يخترق الراجل ده واكتشف انه بيدير اكبر شبكة Porn على النت او يعنى بيدير موقع زى كده وخلاص بس الراجل صاحب الكافيه ده كان عامل حسابه برده وكان مستخدم شبكة TOR و دى ببساطة بتخلى الطلب بتاعك بدل ما يروح على طول للفيس مثلا ﻻ يعدى فى السكة على شوية سيرفرات كده وبعد كده يوصل للفيس بوك ده شرح كروته كده بس المهم ان TOR فعليا فيه مشاكل وهو مش Secure بشكل كامل والـ Point الـ ايليوت اتكلم عليها هنا ان الـ Exit Node هو قدر يتحكم فيها وبطريقة ما قدر يعمل مقارنة مابين مثلا الحجم والوقت بتاع الـ Packets عشان يعرف دى تبع الراجل صاحب الكافيه ده وﻻ ﻻء وحتلاقوا لينك تحت لو حد عايز يفهم الموضوع بشكل اكبر بس الفكرة هنا انه قدر يعمل Deanonymizing وقدر يعرف انه صاحب فعلا الموقع ده وسعتها بلغ عليه الموضوع فى كروته كتير و الموضوع مش منظم ومش منسق بس غالبا ده كان السيناريو عشان يقدر يخترق الراجل ده ويعمل Copy لكل ملفاته :3 \n\nده كده كان مثال بسيط على الاختراقات الـ حصلت فيه المسلسل ده , لو حد مهتم باننا ننزل باقى الـ Attacks وممكن نشرح الطرق عملى كمان على الـ Channel بتاعنا على اليوتيوب https://www.youtube.com/c/NineHackers ياريت يقولنا ^_^\n\nTOR Safe or Not : https://www.quora.com/Has-the-Tor-Network-really-been-compromised-by-the-US-government-What-are-the-loop-holes-present-in-the-exit-and-entry-nodes-of-Tor-network-that-can-be-used-to-track-the-real-ip-of-the-user\n\nReal Hacks Mr Robot : http://www.darkreading.com/careers-and-people/5-mr-robot-hacks-that-could-happen-in-real-life/a/d-id/1326329","created_time":"2017-01-26T03:37:10+11:00","total_likes":8,"total_comments":0},{"id":"172338516139198_1366053526767685","from":{"name":"Meligy","id":"10154884040385170"},"message":"For those using Angular CLI\nhttps://www.facebook.com/Mohamed.Meligy/posts/10154781277105170","caption":null,"description":null,"created_time":"2017-01-26T04:13:35+11:00","total_likes":8,"total_comments":0}]}