{"posts":[{"id":"172338516139198_832062233500153","from":{"name":"Islam Mousa","id":"10154738656069823"},"message":"Html Game build in the last weekend\nuse Font-Awesome 3 , Animate.css  , normalize.css\nsure jQuery  and compile my java script with closure-compiler\n\nhttps://play.google.com/store/apps/details?id=com.havebreak.matchcolor","caption":null,"description":null,"created_time":"2014-10-18T05:52:35+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_832105116829198","from":{"name":"Mostafa Muhammad","id":"10154873940166210"},"message":"Ever wondered how assign  a probabilistic weight to an event? E.g. Make an item produce a critical strike 10% of the time or making a certain reward 50% more likely to pop up than others.\n\nQuite frankly I never thought it is that simple! It really fascinated me","caption":"stackoverflow.com","description":"I have some functions which generate double, float, short, long random values. I have another function to which I pass the datatype and which should return a random value. Now I need to choose in t...","created_time":"2014-10-18T07:50:12+11:00","total_likes":1,"total_comments":6},{"id":"172338516139198_831767436862966","from":{"name":"Bassam Abd Elhamid","id":"1811475205784288"},"message":"كيلو جرام = 1000 جرام\nميجا هيرتز = 1000 كيلو هرتز\nجيجا هيرتز = 1000 ميجا هيرتز\nميجا بيت = 1024 كيلو بيت\nجيجا بيت= 1024 ميجا بيت\nتيرا بيت = 1024 جيجا بيت\nواشترى هارد تيرا بيت الى المفروض يكون 1024 جيجا مش محصل 940 جيجا :(","caption":null,"description":null,"created_time":"2014-10-17T17:55:18+11:00","total_likes":1,"total_comments":8},{"id":"172338516139198_832786650094378","from":{"name":"Ahmed Elbaz","id":"1417631521615418"},"message":null,"caption":"developer.telerik.com","description":"The web is evolving at a crazy pace. Every day new frameworks, tools, and libraries are released with the ambition, if not the potential, to become the next jQuery. As a developer, I feel that sometimes it’s really hard to stay up-to-date with all the new software, techniques and practices introduce…","created_time":"2014-10-19T15:20:59+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_832846846755025","from":{"name":"Ahmed Saleh","id":"1384434324953403"},"message":"Hi, how do you find someone to work with on projects? Any ideas?","caption":null,"description":null,"created_time":"2014-10-19T18:46:30+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_832833663423010","from":{"name":"Salah Jr Ahmed","id":"10154647662667880"},"message":"Any recommendations .. .. I need to have an professional profiling tool to examine carefully my web site behavior over certain internet speed. And to determine which part of the stake take a time .. I need something more powerful than YSlow - firebug or fiddler .. some tool to generate reporting for modules - functions behavior across the web site.","caption":null,"description":null,"created_time":"2014-10-19T17:50:17+11:00","total_likes":1,"total_comments":6},{"id":"172338516139198_832882090084834","from":{"name":"Mostafa Abd El-Salam Maklad","id":"10155019385899870"},"message":"http://www.sitepoint.com/good-developer/?utm_content=buffera527d&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer","caption":"sitepoint.com","description":"George speaks from experience when he explains how one can be a good developer, or even, a professional.","created_time":"2014-10-19T20:43:19+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_833022070070836","from":{"name":"Meligy","id":"10154884040385170"},"message":null,"caption":null,"description":null,"created_time":"2014-10-20T01:33:06+11:00","total_likes":4,"total_comments":0},{"id":"172338516139198_832651633441213","from":{"name":"Aya E Mahmoud","id":"781082622041370"},"message":"I can't think of any helpful idea for my graduation project, any help?","caption":null,"description":null,"created_time":"2014-10-19T09:04:50+11:00","total_likes":1,"total_comments":10},{"id":"172338516139198_833255506714159","from":{"name":"Mostafa El Malah","id":"1830233070575028"},"message":"5 افكار لتحقق اكبر استفادة من موجة ريادة الاعمال في العالم العربي","caption":null,"description":"5 افكار لتحقق اكبر استفادة من موجة ريادة الاعمال في العالم العربي :\n\nرأي شخصي | عن ريادة الاعمال و الي أين تتجه ؟ و كيف نحقق منها أعلي استفادة في عالمنا العربي \n\nرائد أعمال \nاو \nentrepreneur\n\nكلمة تعني هذا الشخص الذي لديه فكرة يقوم علي تطويرها و تنفيذها علي ارض الواقع \n\nارجو الا تكون موضة او هوجة تندثر و لا تحقق منها استفادة كبيرة في عالمنا العربي مثل موجات التنمية البشرية \nالتي اثرت المحتوي العربي و ايضا ملئته بالكثيرين من المتحدثين بغير علم الذين اثروا سلباً علي سمعة مجال التدريب و مجال التنمية البشرية \n\nو في رأيي الشخصي هناك أشياء يمكن عملها حتي تستفيد من هذه الموجة :\n\n1 - اثراء المحتوي العربي من خلال التدوين و الترجمة للمقالات و الكتب الاجنبية و هذا باب استفادة للمدونين و لمواقع النشر مثل ومضة .. اراجيك .. عالم التقنية و ساسة بوست و غيرها من المواقع التي تتحدث في ريادة الاعمال بشكل اساسي او كجزء من المحتوي المقدم عليها \n\n2 - التدريب لكل رواد الاعمال و اصحاب الافكار و هذا بالطبع موجه لمن لهم القدرة علي التدريب و اعطاء المحاضرات و تنظيم الفعاليات سواء المجانية او المدفوعة و علي من يقدم التدريب ان يلتزم \nبالمصداقية \nو ايضاح مصادر اخري للبحث و التعلم \nو تمييز الغث من الثمين للمتدربين الجدد من المصادر و المراجع \nو يهتم بالاسلوب العلمي في الشرح \nو عليه ان يخوض تجربة واحدة علي الاقل او يشرف و يساعد اكثر من تجربة لعمل ريادي ناشئ حتي يتسم تدريبه و حديثه بالواقعية\n\n3 - نشر الخبرات او التغذية الراجعة الايجابية\npositive feed back\n و هذا هو دورك صديقي رائد الاعمال العربي في ترجيح افضل الكتب التي افادتك \nو كذلك افضل المدربين الذين افادوك لتقدم بذلك تفنيد \nومساعدة لكل رائد اعمال جديد \nو حتي لا ينتشر بيننا فيروس اولئك الذين يجيدون تسويق انفسهم \nو ليس لديهم العلم الكافي و المناسب و للأسف يقوم المتدربين الجدد بنشر كلامهم و صناعتهم كنجوم \n\nلا أقول انك يجب عليك فضح هؤلاء لكن يجب عليك نشر توصيات و اراء ايجابية ممن تري ان لهم دور مؤثر و يجتهدون لإيصال علم نافع \n\n4 - اقامة مشروعات ربحية و غير هادفة للربح لدعم رواد الاعمال تقنياً و علمياً \n\nالمشروعات الربحية في رأيي تقوم بتسريع سير اي عمل إصلاحي في المجتمع \nهناك مشروعات ربحية تخدم رواد الاعمال مثل حاضنات الاعمال و التي توفر مكان للتدريب و مكان للعمل مقابل مشاركة في ارباح المشروع الناشئ \nو ايضاً مسابقات دعم رواد الاعمال التي تقوم بتقييم الافكار و تعطي جوائز للرابحين و كذلك تقدم دعم مالي مقابل شراكة او بدون مقابل و هكذا مراكز الاستشارات و المدربين \nوكذلك شركات برمجة التطبيقات مثل شركة XApps Solutions حيث تهتم بمساعدة رواد الاعمال علي برمجة و تصميم تطبيقات الجوال للاندرويد والايفون باسعار مناسبة و تعمل علي تقديم محتوي يناسب رواد الاعمال في العالم العربي\n\nو لا ننسي بعض الجمعيات او التنظميات الخيرية و الغير هادفة للربح التي تقدم المحاضرات و التدريبات و المسابقات لرواد الاعمال \n\n5- تكوين علاقات من خلال الانترنت و مواقع التواصل الاجتماعي \nالحمد لله يتوفر لنا اليوم التواصل بشكل جيد عبر الكثير من الوسائل لذا يمكنك التواصل مع المدربين و رواد الاعمال مثلك في كل العالم العربي فلا تبخل في استخدام هذه الوسائل و تواصل مع رفقائك من رواد الاعمال في العالم العربي بشكل احترافي لصنع علاقات جيدة بما يسمي \nNetworking\n\nتلك خمسة افكار لتحقق افضل استفادة من موجة ريادة الاعمال في العالم العربي\n\n-- اذا كنت تري ان هناك طرق اخري لدعم رواد الاعمال لم تذكر في المقال اذكرها حتي يستفيد منها الجميع .\n\nمصطفي الملاح","created_time":"2014-10-20T12:28:59+11:00","total_likes":1,"total_comments":0}]}