{"posts":[{"id":"172338516139198_1107288495977524","from":{"name":"Ahmed Aswani","id":"10158476825265637"},"message":null,"caption":"www.quora.com","description":"Answer by Jonathan Paulson, can code and speak (some) French","created_time":"2016-03-25T23:07:51+11:00","total_likes":2,"total_comments":1},{"id":"172338516139198_1107499595956414","from":{"name":"Ahmed Mahmoud","id":"1360592964014097"},"message":"even before INTERNET","caption":"youtube.com","description":"My old Fidonet BBS is still operational after over two decades of service to the bbs community and still going strong in 2015. This video tour is similar to ...","created_time":"2016-03-26T03:24:27+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1105412336165140","from":{"name":"Mahmoud Tantawy","id":"10155099548114764"},"message":"During my quest to make better use of my time, i started listening to podcasts a couple of months ago and that really helped me save time and make use of otherwise wasted time, so i wrote a blog post about some of my favorite podcasts.\n\nIn the blog post i wrote short description about each podcast along with average duration of episodes, podcast website, and direct RSS feed URL to add to your podcast app.\n\n=========================\nThe tl;dr version:\nPHP-related Podcasts\n- /dev/hell\n- PHP Town Hall\nLaravel-related Podcasts\n- Laravel News\n- The Laravel Podcast\nLinux-related Podcasts\n- LINUX Unplugged\n- The Linux Action Show\n=========================\n\nThis is the first part, i'll write another post about podcasts concerned with security and software development in general.","caption":"mtantawy.com","description":"As developers we are expected to be always up-to-date, which is a very exhausting task, some developers follow RSS feeds, subscribe to newsletters, or follow twitter accounts, i used to do all that…","created_time":"2016-03-24T06:07:33+11:00","total_likes":8,"total_comments":3},{"id":"172338516139198_1107910775915296","from":{"name":"Mohamed Elsherif","id":"10158483817400314"},"message":null,"caption":null,"description":"Big list of naughty strings, great for validation","created_time":"2016-03-26T12:54:20+11:00","total_likes":11,"total_comments":0},{"id":"172338516139198_1108432042529836","from":{"name":"Amr Reda","id":"10158460397575372"},"message":null,"caption":"youtube.com","description":"holoportation is a new type of 3D capture technology that allows high quality 3D models of people to be reconstructed, compressed, and transmitted anywhere i...","created_time":"2016-03-26T23:24:12+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1108596009180106","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":"Another \"Why X started using Go\" post :D\nThe referenced post \"Handling 1 Million Requests per Minute with Go\" is also very nice.","caption":"medium.com","description":"Making the Switch from Node.js to Golang","created_time":"2016-03-27T02:35:51+11:00","total_likes":4,"total_comments":1},{"id":"172338516139198_1108268019212905","from":{"name":"Yasser Mohamed Ahmed Al-barbary","id":"10208981228392449"},"message":"Hi every one\nI have two free tickets for collision conference 2016\n New Orleans. Collision 2016\nhttps://collisionconf.com/\nany one  interested can contact me","caption":"collisionconf.com","description":"It's been called 'the best technology conference on the planet'. But we just think it's different. And that difference works for our attendees, ranging from Fortune 500 companies to the most exciting startups in the world. Our speakers may be world class, but our networking is simply legendary","created_time":"2016-03-26T20:49:47+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1108915032481537","from":{"name":"Sameh Saeed","id":"10154266644607344"},"message":":) BOOTFLAT is an open source Flat UI KIT based on Bootstrap 3.3.0 CSS framework.","caption":"bootflat.github.io","description":"BOOTFLAT is an open source Flat UI KIT based on Bootstrap CSS framework. And, for the designers, we offer a free PSD Download. It provides a faster, easier and less repetitive way for web developers or designers to create elegant web apps.","created_time":"2016-03-27T09:04:50+11:00","total_likes":25,"total_comments":0},{"id":"172338516139198_1108843445822029","from":{"name":"Mohamed A. Alqrwash","id":"10210601405564635"},"message":"for who work in Node.js consider this video , you may change your mind #reactive #typesafe #play #akka #java8\n\n","caption":"youtube.com","description":"Node.js v.s. Play Framework lecture by Yevgeniy(Jim) Brikman at ScalaMatsuri on 9/6/2014 http://scalamatsuri.org/en/","created_time":"2016-03-27T07:34:39+11:00","total_likes":7,"total_comments":3},{"id":"172338516139198_1104422916264082","from":{"name":"Ahmed Mamdouh","id":"10154219402090800"},"message":"الإخوة الجيكس،\nده أول بوست ليا واتمنى تشاركوني بعض الإجابات من خبرتكم.\nمن مميزات تكنولوجيا المعلومات إنها مجال مفتوح ومصادره متوفرة شبه مجانا على شبكة الإنترنت على الأقل في مجالات البرمجة وتطوير برامج الويب مقارنة بمجالات أخرى صعب دخولها زي مثلا الصناعات الدقيقة أو التكنولوجيا النووية.\nبلد زي مصر فيه 90 مليون نسمة عنده إمكانية إنه يكون فيه مناخ تكنولوجي ثري جدا ومبدع لكن مع ذلك مستوى الآي تي بصفة عامة في مصر منخفض. طبعا فيه ناس كويسة وبنسمع عن ستارتأبس في مجال التكنولوجيا لكن مازلنا لا نقارن بدول تانية أقل مننا في السكان وأماكن زي بانجالور في الهند اللي هي دولة فقيرة زي حالاتنا لكن مركز ضخم لتكنولوجيا المعلومات. لو نبص عندنا في السوق نلاقي القدرات إلى حد ما متواضعة. \n- شركات كتير بتعمل بأنظمة ورقية وتستخدم الكمبيوتر على نطاق ضيق. \n- مافيش killer app عربي. يعني مثلا برنامج مجاني  للحسابات أو متابعة العملاء اللي تلاقي كل الشركات بتستخدمه وكان عمله مجموعة شباب في وقت فراغهم.\n- المواقع الإخبارية بدائية مابتعملش مثلا رسوم بيانية تفاعلية مع ألأخبار علشان توصل المعلومة. تصميم الموقع في يبقى فيه أخطاء وده مؤشر إن السوق نفسه مش بيوفر مهارات عالية بسهولة.\n- مابنلاقيش مواقع خدمية بالعربي ... يعني موقع يعمل حاجة مش يعرض معلومات ... يحسب حسبة يحول أو صورة لبي دي إف وهكذا على سبيل المثال. بنلاقي منتديات ومواقع عرض بيانات فقط.\n\nالسؤال إللى أنا بأطرحه هو:\nليه قدراتنا متواضعة ؟ وهل فيه حاجة نقدر نعملها مع بعض لتمنية هذه القدرات؟ (سؤالين مش سؤال ماعلهش)\n\nبعض الإجابات إلي أنا فكرت فيها:\n- مافيش الكلام ده. إحنا قدراتنا جامدة جدا والبوست ده كله أي كلام.\n- التعليم الأساسي في مصر ضعيف فهناك نقص في الشباب اللي عنده القاعدة المطلوبة من الرياضيات والتفكير المنطقي للتفوق في تكنولوجيا المعلومات.\n- السوق نفسه ضعيف مش بيخلق طلب علشان ناس تطور من نفسها وتملاه.\n- مصادر المعلومات باللغة الإنجليزية وده بيمثل عائق عند قطاعات كبيرة لتنمية مهاراتهم.\n- مافيش محتوى كافي باللغة العربية.\n- مافيش رعاية كافية من الممجتمع ومؤسساته زي المسابقات والدورات المجانية.\n- مافيش تواصل كافي بين أعضاء المجال.\n\nأنا مش بأطلب أن حد يقيم الإحتمالات اللي أنا قلتها. أنا ذكرتها فقط كنقط تفتح مجال للتفكير. السؤال هو: ليه المستوى منخفض وهل فيه حاجة نقدر نعملها لو المستوى فعلا منخفض؟","caption":null,"description":null,"created_time":"2016-03-23T08:10:15+11:00","total_likes":6,"total_comments":8}]}