{"posts":[{"id":"172338516139198_735064306533280","from":{"id":"100002177522306","name":"Mahmoud Mohsen"},"message":"ايه رأيكوا في موضوع ال big data analytics \nوالموضوع ده ليه شغل في مصر ولا لأ","caption":null,"description":null,"created_time":"2014-04-22T08:49:42-07:00","total_likes":1,"total_comments":3},{"id":"172338516139198_734631743243203","from":{"id":"100000116116716","name":"Mohamed Sameeh Sharaf"},"message":"هو ازاى أتعلم  regex :(","caption":null,"description":null,"created_time":"2014-04-21T11:08:00-07:00","total_likes":2,"total_comments":18},{"id":"172338516139198_734202766619434","from":{"id":"627907956","name":"Emad Elsaid"},"message":"Good news, \nالبوت اللى كنت شغال عليه خلصته دلوقتى حالآ، البوت عبارة عن سكريبت مع اكونت فيسبوك انا اضفته للجروب دلوقتى، البوت لو حد عمله منشن فى كومنت و كتب بعد الإسم لغة برمجة من دول : \nc, c++, fortran, haskell, io,javascript, lua, ocaml, php, perl, python, ruby, slash, assembly\nو بعدين سطور الكود هياخد السطور مع اسم اللغة و يروح يبعتهم على موقع eval.in و يجيب الناتج و يرد بكومنت على نفس البوست، انا هاجربه على البوست ده دلوقتى و هاقفله وانا بقفل الجهاز ، هانحتاج سيرفر نحط عليه السكريبت لحد ماجيب سيرفر شخصى احطه عليه.\nهيا بنا نلعب","caption":null,"description":null,"created_time":"2014-04-20T17:53:49-07:00","total_likes":25,"total_comments":25},{"id":"172338516139198_728910657148645","from":{"id":"652024918","name":"Amr Eldib"},"message":"I need some advice from Virtualization experts:\n\nI did my fair share of research and can't find some solid solution that matches what I'm looking for.\n\nHere's some background: \n- We have a test center where every analyst works on resolving number of test cases.\n- We work with a big number of software stacks. A stack is a combination of different software versions that makes for a unique environment. Sometimes, installing a Service Pack can be a big change, so it has to have its own stack.\n- Each person, of course, can have only one stack on their own machine.\n- We do have a vCenter/vSphere solution in place and it's pretty good but we're looking to improve.\n\nHere's what we're trying do:\n- I'd like to have one VM per stack. That VM would be installed by IT (or someone assigned to that task).\n- When a support case comes in, the analyst would choose the VM that best machines their case and then creates a separate instance of that VM and give it a name related to their case number.\n- This is, of course, possible in a number of ways. Templates and Clones do this.\n- My idea was to use Linked Clones, they can save on disk space and they're very quick to create. However, I have number of problems with how linked clones are created in vSphere:\n1- They require the user to know a lot of technical details about the VM infrastructure (similar to creating new machines). It would be safer and easier to have a specialist do the cloning (which is not convenient given the big number of VM that has to be created).\n2- I'm not clear on permissions in vSphere but how can I control giving users permission to create these clones while not giving them full permissions.\n- I'd like to be able to do something like: right click -> create new instance -> Enter machine name -> Done. Basically, \"give me an instance of this machine\", like how Vagrant works.\n\nAny suggestions on vSphere (or VMware products) or any other vendor are welcomed.\nLet me know if you have any questions\n\nThanks in advance!","caption":null,"description":null,"created_time":"2014-04-11T11:47:49-07:00","total_likes":1,"total_comments":25},{"id":"172338516139198_735459219827122","from":{"id":"1502874741","name":"Fatma EL-Sayed"},"message":"hi guys,,plz any one can help\n... انا عاوزا اعرف ال submit button \n بيبعت علي فين؟؟\nhttps://www.facebook.com/MothersBrideGroup/app_596549677076405?ref=ts","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-04-23T03:29:22-07:00","total_likes":0,"total_comments":8},{"id":"172338516139198_735488029824241","from":{"id":"826905424","name":"Mohamed Qamar"},"message":"سؤال يا جماعة\nأنا عاوز اعمل setup and deployment project على الدوت نت لبرنامج، البرنامج ده مخصص انه يشغل جهاز معين، الجهاز ده له 2 drivers واحد منهم msi والتاني  exe الفكرة اني بحاول احط التعريفين دول مع البروجيكت ده بحيث اضيف checkboxs dialog في الinterfaces بتاعت الsetup project يبقى فيه 2 checkbox كل واحد فيهم مسؤول عن درايفر من الاتنين دول بحيث يتسطبوا مع البرنامج وهوا بيتسطب، بس انا خبرتي محدودة في الموضوع ده فمش عارف ايه اللي المفروض يتعمل عشان اعمل حاجة زي دي، ودورت في الموضوع ده على النت وما وصلتش لحاجة مفيدة قوي في الموضوع ده، ياريت لو حد يقدر بفيدني في الموضوع ده يبقى كتر الف خيره وجزاكم الله خيرا","caption":null,"description":null,"created_time":"2014-04-23T05:03:44-07:00","total_likes":0,"total_comments":1},{"id":"172338516139198_735541713152206","from":{"id":"519195287","name":"Mahmoud Abd El-Fattah"},"message":null,"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","description":null,"created_time":"2014-04-23T07:44:33-07:00","total_likes":2,"total_comments":0},{"id":"172338516139198_735194919853552","from":{"id":"652024918","name":"Amr Eldib"},"message":"Emad Elsaid's bot/script along with a number of other scripts I'm using now are getting me to wonder about this question:\nWhat platforms/tools are available to store and quickly execute those small scripts? Either on-demand or automatically (scheduled or on-event)?\nOne example is GitHub't Hubot, but it's limited in that it needs a chat room and the scripts I've seen are written in CoffeeScript.\nAny other similar platforms?","caption":null,"description":null,"created_time":"2014-04-22T14:11:38-07:00","total_likes":0,"total_comments":8},{"id":"172338516139198_735792839793760","from":{"id":"100000193960321","name":"Abdalla Elnaggar"},"message":"بعد اذن صاحب الكومنت \nبس ده فعلا مشكله بتقابل الواحد واظن ان كل المبتدئين اللى زى حالاتى عندهم نفس المشكله انه يشتغل على فكره بجد ويعمل شغل حتى لو الشغل ده مش هيجيب دخل او حتى ينفع يبقى مشروع بكلم عليه بس الواحد هياخد خبره ويتعلم ويستغل وقته \nبس الكسل هو اللى بيمنع وان الواحد بيقول لنفسه ده فكره اى كلام وملهاش لازمه ويحبط نفسه","caption":null,"description":null,"created_time":"2014-04-23T17:25:03-07:00","total_likes":6,"total_comments":0},{"id":"172338516139198_735687453137632","from":{"id":"100004658621932","name":"Mohamed Fotouh Shalan"},"message":"is there any free software that enable me to write a perfect cv ?","caption":null,"description":null,"created_time":"2014-04-23T13:49:01-07:00","total_likes":0,"total_comments":3}]}