{"posts":[{"id":"172338516139198_504487966257583","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Awesome plugin to fake Referrer and many other variables in Firefox ;)","caption":"addons.mozilla.org","description":"If you suspect this add-on violates our policies or has security or privacy issues, please use the form below to describe your concerns. Please do not use this form for any other reason.","created_time":"2012-12-28T03:32:16+11:00","total_likes":1,"total_comments":3},{"id":"172338516139198_503303053042741","from":{"name":"Kareem Elansary","id":"10155149930945530"},"message":"A UI Designer/Developer wanted for a big company in Egypt .. please fill this form http://goo.gl/0gfB8","caption":"docs.google.com","description":null,"created_time":"2012-12-25T08:34:36+11:00","total_likes":0,"total_comments":2},{"id":"172338516139198_504561346250245","from":{"name":"Mahmoud Rizk","id":"10155608278007565"},"message":"urgent Web Designer needed to build custom wordpress theme from scratch for a big client, budget 10,000LE please send you cv to info@taswek.com","caption":null,"description":null,"created_time":"2012-12-28T07:05:54+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_504512476255132","from":{"name":"Mohamed Sameeh Sharaf","id":"1704851202862067"},"message":"عايزين يقطعوا عيشنا\n\nلو هتبتدوا وقفات صدقونى انتم اللى هتخسروا","caption":"بيان صحفى - ممثلو مجتمع البرمجيات الحرة يطالبون وزير الاتصالات بتنفيذ وعوده","description":"ممثلي مجتمع البرمجيات الحرة يطالبون وزير الاتصالات بإستكمال وعوده بتطبيق سياسات للإنتقال التدريجي الى الاعتماد على البرمجيات الحرة في الحكومة\n \nفي شأن تعاقد الحكومة مع ميكروسوفت\n \nتسببت السياسات الخاطئة للحكومات السابقة في توغل شركة ميكروسوفت وشركات أخرى ذات طابع احتكاري في القطاع الحكومي بحيث أصبحت حلولها التقنية هي البنية التحتية الوحيدة التي تقوم عليها مشاريع قومية استراتيجية هامة مثل مشروع خدمات الحكومة الإلكترونية، مما أدى إلى احتياج الحكومة الدائم لهذه الشركات، واضطرار الحكومة إلى تجديد عقود تراخيص باهظة الثمن لضمان استمرار الخدمات و عمل المرافق الرقمية.\n \nكذلك سمحت الحكومات السابقة لهذه الشركات بالتدخل في مناهج تعليم المعلوماتية في المدارس والجامعات بذريعة تقديم منتجات رخيصة للطلبة، مما أدى إلى أن تصبح العملية التعليمية في مجال التقنية تدريبا على استخدام منتجات تلك الشركات مما يؤدي إلى تخريج أجيال لا تعرف سوى منتجاتها مرادفا لتكنولوجيا المعلومات في حين تتوافر مقابلات حرّة مجانية لا تقل جودة.\n \nبسبب ذلك كلّه وجدت الحكومة الحالية نفسها في مأزق عندما انتهى التعاقد المبرم مع شركة ميكروسوفت بإيجار تراخيص البرمجيات فأصبح من غير الممكن استمرار الحكومة في استخدام البرمجيات في اكثر من 200 ألف حاسوب في هيئات الحكومة المصرية على نحو قانوني.\n \nبتقييم الموقف استنتجت الحكومة الحالية أفضلية المضي قدما في شراء الرُّخص التي كانت تؤجرها خلال المدة السابقة بمبرر أنه أفضل الحلول المطروحة وأقلها تكلفة، حسب تفسير وزير الاتصالات وتكنولوجيا المعلومات المهندس هاني محمود خلال الاجتماع مع ممثلي مجتمع البرمجيات الحرة يوم ٣٠ ديسمبر عقب الوقفة التي تم تنظيمها احتجاجا على موافقة وزارة الاتصالات ورئاسة الوزراء على شروع الحكومة في دفع مبلغ ٢٧٠ مليون جنيه مصري مقابل تراخيص تلك البرمجيات، فيما يراه مجتمع البرمجيات الحرة في مصر إهدارا للمال العام و تضييعا لفرص تحفيز قطاع إنتاجي مصري و عمل اختيارات تقنية غير مناسبة استراتيجيا. حضرت الاجتماع هدى بركة مساعد أول وزير الاتصالات ورئيسة اللجنة الاستشارية لوضع استراتيجية البرمجيات الحرة كما حضره أحمد الحفناوي عضو اللجنة وهيثم نبيل عضو اللجنة ومدير وحدة البرمجيات في وزارة التنمية الادارية ودينا حامد مقررة اللجنة.\n \nحسب الوزير، كان التعاقد الأصلي مع ميكروسوفت من سنة ٢٠٠٩ الى ٢٠١٢ على إيجار تراخيص البرمجيات لا شرائها، مع إمكانية دفع قيمة إيجار سنة ونصف عند نهاية العقد مقابل تملك الرخص. وبناء عليه دفعت الحكومة ٩٠ مليون دولار تقريبا سعر إيجار البرمجيات في السنوات الثلاثة الماضية.\n \nعلى الدوام تسعى ميكروسوفت وشركات أخرى ذات ممارسات احتكارية ألا تفقد المكاسب التي تدرها عليها تعاقداتها القائمة، لذا فإنها تحاول التدخل الآن لتخفيض القيمة و تقديم محفّزات أخرى تضمن استمرار تعاقدها مع الحكومة.\n \nيأتي تحرك ناشطي البرمجيات الحرة لتوضيح أن ما تفعله ميكروسوفت وشركات ذات ممارسة احتكارية منذ زمن بعيد قد ساهم  في الاقتطاع من قوتهم اليومي مقابل برمجيات أقل جودة في حين أن البرمجيات الحرة التي لم يُبحث فيها كبديل لا يتعين دفع مقابل لاستخدامها  و عليه فإن الإنفاق الحكومي فيها يعود على الاستثمار في القدرات البشرية و تحفيز قطاع إنتاجي مصري.\n \nكما يرى النشطاء أن دعم الابتكار و التطوير - بدل الاقتصار على البيع لحساب شركات أجنبية - يؤدي إلى زيادة حصة و وزن مصر في الإنتاج الفكري و المعرفي بدل اقتصار دور الحكومة على كونها حارسة على الملكية الفكرية لصالح شركات أجنبية بموجب اتفاقيات غير عادلة و استمرار نزيف العقول المصرية و تكريس بيئة غير ملائمة للإبداع محليا.\n \nوترى المجموعة أن الحكومة بتصرفها هذا تدفع ثمنا كان قد سبق لها أن دفعته من قبل مقابل استخدام تلك البرمجيات، و هي في مجملها برمجيات قديمة تجاوزتها التقنية، و مع هذا لا تكفل الرُّخصة للحكومة إلا ترقية محدودة من منتجات ذات الشركة مع إغبان حق تحسينها  و تطويرها لملائمة احتياجات الحكومة التي اشترتها، وعليه:\n \n\n    يجب على الوزارة الكشف عن التفاصيل المالية و الفنية للتعاقدات المبرمة مع ميكروسوفت ما شابهها من الشركات المنتجة للبرمجيات ونظم التشغيل غير الحرة (البرمجيات الاحتكارية)، على الأقل بدءا من 2009 الى الآن لتقييمها اقتصاديا و فنيا\n    على الحكومة الإفصاح عن التقرير والتوصيات الخاصة بتقييم بدائل تقنين وضع رخص منتجات ميكروسوفت، التي بني عليها قرار الحكومة في ديسمبر 2012 بشراء الرخص بشكل نهائي\n    ستتخذ المجموعة إجراءات قانونية لوقف التعاقد إلى حين البت في إمكانية تخفيض الاحتياج الى هذا العدد الضخم من رخص الاستخدام، و استبداله كلّه أو بعض منه ببرمجيات حرّة لا يتطلب استخدامها دفع مقابل لتراخيص.\n\n \nبخصوص سياسة الحكومة تجاه البرمجيات الحرة\nتطالب المجموعة وزارة الاتصالات بتفعيل ما سبق لها أن أعلنته من سياسات بشأن مشروعات نظم المعلومات  الحكومية:\n \n\n    الالتزام بإعطاء تطبيقات البرمجيات حرة وضعا تفضيليا فيما لا يقل عن 50% من المشروعات الحكومية\n    الاعلان والالتزام بما وعدت به وزارة الاتصالات من جدول زمني لخطة تدريب للكوادر الحكومية اللازمة للانتقال التدريجي الى الاعتماد على برمجيات حرة تستبدل البرمجيات المغلقة في مختلف تطبيقات القطاعات الحكومية\n    وضع خطة زمنية  للانتقال الكامل إلى الاعتماد على البرمجيات الحرة في مشروعات الحكومة لما في ذلك من ميزات استراتيجية فنية و اقتصادية\n    أن تقوم وزارة الاتصالات فورا - بناء على ما أبدته من استعداد - باعتماد أنظمة تشغيل وبرمجيات حرة  في كل ما يتعلق بتطبيقات سطح المكتب بحيث لا تتطلب إعادة بناء تطبيقات الخواديم فورا، و أن تبدأ وزارة الاتصالات بنفسها كنموذج تنطلق منه التجربة إلى بقية مؤسسات الدولة كما كانت هي الرائدة في مجال تقنية المعلومات الحكومية من قبل.\n    إدارة الممارسة التقنية الحكومية بشفافية لفتح المجال أمام الشركات المصرية ومجموعات المجتمع المدني المهتمة بالبرمجيات الحرة للقيام بدور أساسي في التدريب والتخطيط اللازمين للتحول الى العمل ببرمجيات ذات رخص حرة ومفتوحة المصدر بما يحقق نموا جذريا في قطاع صناعة البرمجيات وحلول تقنية المعلوماتية في مصر بالتحوّل إلى الابتكار و التطوير بدل الاقتصار على البيع لحساب شركات أجنبية\n    إعادة تصميم مناهج المراحل الدراسية المختلفة بحيث يتعلّم الطلبة الأساسيات و المفاهيم بالتطبيق على برمجيات حرة يمكنهم الحصول عليها مجانا بغير الاعتداء على الملكية الفكرية لشركات\n\n \nالمجموعة الناشطة تجمع ممارسين و خبراء في صناعة البرمجيات و أصحاب شركات مصرية و مجموعات مستقلة و منظمات مجتمع مدني و هواة و طلبة يطالبون بالبدء فورا بتطبيق هذه الاجراءات حتى لا نجد نفسنا بعد برهة في نفس المأزق مضطرين لشراء رخص جديدة و إهدار المزيد من الأموال و تضييع فرص النمو.\n \nعلما بأن مجتمع البرمجيات الحرة في مصر مجتمع مزدهر يجمع ما بين القدرات الفنية و الخبرات العملية و الرغبة في تطوير و تقدّم المجتمع كلّه لا القطاع الصناعي فقط، و يظهر ذلك في الأنشطة المتنوعة التي يمارسها المنخرطون في حركة البرمجيات الحُرَّة، ما بين تطوير النظم تجاريا و تصميم الحلول، و الانخراط في مجتمع البرمجيات الحُرَّة العالمي و أنشطته، و تنظيم الأنشطة التعريفية و التوعوية الجماهرية محليا، و زيادة المحتوى التقني باللغة العربية و التدريب، و تطوير المناهج المفتوحة تشاركيا.\n \nالمجموعة التي شاركت في اللقاء مع الوزير عن مجتمع البرمجيات الحرة:\n \nأحمد العزبي - متخصص أمن معلومات وعضو مؤسس في الجمعية المصرية للمصادر الحرة (أوبن ايجبت)  \nعلي شعث - عضو مؤسس في الجمعية المصرية للمصادر الحرة ومؤسسة التعبير الرقمي العربي (أضف)\nشادي سمير - استشاري تقنيات الويب وعضو في مؤسسة التعبير الرقمي العربي (أضف)\nعبدالرحمن غريب - مبرمج حر\nأحمد مكاوي - شركة سبيرولا للأنظمة المتخصصة فى دعم البرمجيات الحرة مفتوحة المصدر\nأحمد طولان - أحد مؤسسى فريق اوبونتو مصر\nافرونيا عازر - التقنيين العرب\nمحمود درويش - تقني\nنادين نعمان - فريق تروس فى الاسماعيلية\nسارة بدوي - فريق تروس فى الاسماعيلية\nاحمد رأفت - عضو فريق أوبونتو مصر الداعي للوقفة امام مجلس الوزراء\n\n\nhttp://www.openegypt.org/%D8%A8%D9%8A%D8%A7%D9%86-%D8%B5%D8%AD%D9%81%D9%89-2\n \n* تجدر الاشارة ان ممثلي مجتمع البرمجيات الحرة كانوا قد نشروا يوم ٢٩ ديسمبر ٢٠١٢ بيان رفضهم قرار مجلس الوزراء بالتعاقد مجددا مع ميكروسوفت، و الإعراب عن دعمهم لتحرك ناشطي البرمجيات الحرة الذين دعوا الى الوقفة أمام مجلس الوزراء. ويعد ذلك القرار أول قرار مع الشركة الاحتكارية منذ اندلاع ثورة ٢٥ يناير. وقد اهتمت وسائل إعلام بهذا التحرك الذي يُظهر قوة مجتمع البرمجيات الحرة في مصر.","created_time":"2012-12-28T04:43:13+11:00","total_likes":2,"total_comments":22},{"id":"172338516139198_504722442900802","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"Yet another Product developed in house ;) Drag photos from the desktop to the Image you want and see the magic ;)","caption":"placeit.breezi.com","description":"Your iPhone, iPad and other device screenshots automatically processed on the fly to be placed within a realistic environment of your choosing","created_time":"2012-12-28T15:28:55+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_504837392889307","from":{"name":"Amr Reda","id":"10158460397575372"},"message":"Crowd of developers says \"It's more productive to work less and learn new stuff more\", What do you think ??","caption":null,"description":null,"created_time":"2012-12-28T23:00:27+11:00","total_likes":0,"total_comments":1},{"id":"172338516139198_505139929525720","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"My 2nd Chrome App: Install, Rate it, Share it and Tweet it please :)","caption":"chrome.google.com","description":"الحصول على المعاينة من المنتجات الخاصة بك على الأجهزة المحمولة أو سطح المكتب! مجرد سحب وإسقاط لقطات من المنتجات الخاصة بك، يمكنك…","created_time":"2012-12-29T12:45:40+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_505609822812064","from":{"name":"Eslam Hamouda","id":"10210277573008432"},"message":"Eric Lippert is a principal developer on the C# compiler team. \n","caption":"blogs.msdn.com","description":null,"created_time":"2012-12-30T13:50:34+11:00","total_likes":2,"total_comments":1},{"id":"172338516139198_506103042762742","from":{"name":"Ahmed Adel","id":"10155949666619129"},"message":"Amazing!","caption":"html5quintus.com","description":"Demo Gamea platfomer in ~60 lines of code, you can edit the code on the left. Click to focus, arrow keys to move.A breakdown of the example is below.","created_time":"2012-12-31T16:23:17+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_506276669412046","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"http://cheeaun.github.com/","caption":"cheeaun.github.com","description":null,"created_time":"2013-01-01T02:44:25+11:00","total_likes":0,"total_comments":0}]}