{"posts":[{"id":"172338516139198_954955397877502","from":{"name":"Sameh Ammar","id":"10213034289519773"},"message":"Ruby or Python for job automation and System administration Tasks. Anyone recommend Go-lang ?","caption":null,"description":null,"created_time":"2015-06-06T22:41:22+10:00","total_likes":1,"total_comments":6},{"id":"172338516139198_955126781193697","from":{"name":"Sameh Saeed","id":"10154266644607344"},"message":"I'm trying to make a simple (Check & un-check All) in a grid view with \"AngularJS\" but all examples that i found depends on ng-repeat which not my case.\n\nthe issue is i used (ng-checked) to achieve my target but when the master checkbox is checked the child checkboxes not firing onchange event so i couldn't complete my task to make some changes depend on whether the child checkbox is checked or not\n\nlive example:","caption":"jsfiddle.net","description":null,"created_time":"2015-06-07T08:31:23+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_955331344506574","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"blog.ingineering.it","description":"Emerging methodologies such as Agile, DevOps, cloud, and microservices both reflect and contribute to IT’s growing complexity. It’s no longer possible (assuming it ever was) to fully specify how...","created_time":"2015-06-07T20:21:23+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_955332787839763","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":null,"caption":"speakerdeck.com","description":"Talk at Infosecurity Europe all about the intersection of security and devops, focusing on the continuous delivery pipeline as an opportunity for conversation and automated security testing.","created_time":"2015-06-07T20:28:12+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_955334171172958","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"#devops #sysadmin #monitoring tool","caption":"sysdig.com","description":"In a single phrase: csysdig offers a simple, intuitive, and fully customizable curses UI for sysdig. Think of it as strace + htop + Lua + container support","created_time":"2015-06-07T20:35:07+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_955340267839015","from":{"name":"Ahmed Al-Amir","id":"10155179919799180"},"message":"For the network geeks out there, I get internet in my house via some mysterious wireless device on my roof that connects to an internet provider about 3 Kms away.\n\nAnyway, those people are seriously incompetent, and I never run out of internet problems on a daily basis. The latest issues is randomly getting 404 errors. The issue is completely random, not related to a certain site or a certain time.\n\nI tried changing my DNS server to 8.8.8.8 to no effect. The issue only goes away when I use an SSH tunnel to a USA server, which of course is too slow for daily usage.\n\nI appreciate any help on this matter, since my incompetent ISP do not even know where to start looking.","caption":null,"description":null,"created_time":"2015-06-07T21:05:28+10:00","total_likes":1,"total_comments":13},{"id":"172338516139198_955371151169260","from":{"name":"Diaa Sami","id":"10212782797230132"},"message":"One of the not-very-famous tools that I find indispensable in my daily workflow, on Linux I use Klipper, parcelite or even Glipper but on Windows it must be a third-party tool and Ditto does the job very well.\n\nI use Windows+V to invoke it but this stopped working since Windows 8, so I switched to Alt+Shift+V\n\n","caption":"sourceforge.net","description":"Ditto download. Ditto 2015-01-11 04:30:43 free download. Ditto Ditto is an extension to the standard windows clipboard. It saves each item placed on the clipboard allowing you access to any of those items at a later t","created_time":"2015-06-07T23:31:19+10:00","total_likes":1,"total_comments":0},{"id":"172338516139198_955400284499680","from":{"name":"Adham EL-Deeb","id":"1416098221767975"},"message":"Record and share your terminal sessions, the right way :D","caption":"asciinema.org","description":"Any time you see a command you'd like to try in your own terminal just pause the player and copy-paste the content you want. It's just a text after all!","created_time":"2015-06-08T00:59:39+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_955343364505372","from":{"name":"Ahmed Imam","id":"1869368279977636"},"message":"Hi Guys,\nI'm a lone developer from Egypt. My new game \"Space Platform\" just get approved by Apple and is ready for a 24 June release. Hope you like the preview. If you have any questions, I'll be happy to answer them. Your support and backing is very important. cheers :-)","caption":null,"description":"Hi,\nHere is The App Preview for \"Space Platform\". The game is done and in the submission process. Scheduled release around mid June. I'm really looking forward to your feedback and hope you'll enjoy the game when it comes out. Support me by sharing and telling your friends. Peace.","created_time":"2015-06-07T21:21:34+10:00","total_likes":3,"total_comments":14},{"id":"172338516139198_955273127845729","from":{"name":"Osama Soliman","id":"709206249239999"},"message":"Hi, :)\n3 problems 3:) .. #chrome_dev #Ionic #Angularjs\n\nThe #1 problem: I need to open dev tools in new window while \"Emulation\"\nI tried googling q=open+inspect+element+in+new+window+chrome\nbut in chrome 43.0.2357.81 I can't find the little box which can separate it to a new window ... \nhttp://stackoverflow.com/questions/30690877\n\n#2 things go behind header in Ionic project ..\nI tried googling q=ionic+header+over+content \nbut Couldn't find a working answer\n\n#3 should I master JS to use Angularjs ?? I know the basics but want to work on an API using Angularjs $http get .. and find that quiet hard ...","caption":null,"description":null,"created_time":"2015-06-07T16:38:34+10:00","total_likes":1,"total_comments":15}]}