{"posts":[{"id":"172338516139198_1159580750748298","from":{"name":"Yahya Elharony","id":"710364945810903"},"message":"انا عاوز اسأل حد عنده معلومة بالتفصيل اكتر عن الــ CLEP فى مصر .\nدورت فى الموضوع بس مش لاقى مصر ,, بس لقيت الاميد ايست فى السعودية موجود فيها.\nعاوز اعرف اذا كان فى مكان فى مصر عن معرفة شخصية لإنى ملقتش ع النت للأسف ؟\nولو انا رحت السعودية وعملت الـ CLEP هناك هرجع اخش الجيش فى مصر عادى وابقى كدة جاهز للماجستير ؟\n\n*تعديل : اسف موضحتش السؤال ,, الـ CLEP ده المفروض نظام بيخلينى اذاكر المواد مع نفسى وامتحن ولو عديت من الامتحانات المطلوبة فى القسم اللى انا عاوزوا هاخد بكارليوس فيه فى خلال سنة او اقل حسب قدراتى .","caption":null,"description":null,"created_time":"2016-06-10T22:53:30+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1159650030741370","from":{"name":"Mostafa Saady","id":"10206685319731894"},"message":"لو حد عنده أي معلومة إضافية أو تجربة ممكن يقولها","caption":null,"description":null,"created_time":"2016-06-11T01:28:48+10:00","total_likes":1,"total_comments":4},{"id":"172338516139198_1159448804094826","from":{"name":"Muhammad Negm","id":"10212131509466411"},"message":"Hey guys, lets talk about it again, and again until it changes!\n\nThis is just part one, about the companies' systems written in Clear Arabic, next one will be around another topic","caption":"manegm.com","description":"مقدمة الهدف من المقال نقد الذات حتى لا يتدهور السوق المصري أكثر مما يتدهور حالياً بما يعانيه من هروب المواهب للخارج او هروبهم من الشركات وتوظيف أنفسهم عبر الانترنت املين الا يروا وجه مديرهم السباق القبيح مرة اخري. بدون الخوض...","created_time":"2016-06-10T18:13:38+10:00","total_likes":24,"total_comments":6},{"id":"172338516139198_1160240214015685","from":{"name":"Ahmad Naser","id":"765927810225286"},"message":"مقالة جديدة على موقع اخبار التطبيقات عن دوراتي الجديدة","caption":"arabapps.org","description":"لا شك أن تطوير التطبيقات والألعاب من أفضل المجالات وأكثرها أهمية في الوقت الحالي، حيث وصلت مبيعات الألعاب على متاجر التطبيقات المختلفة إلى أكثر من 40 مليار","created_time":"2016-06-11T23:53:34+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1160353520671021","from":{"name":"Muhammad El-Hennawy","id":"10210432517001560"},"message":"Does Blockchain technology have the potential to be a game changer and create a more innovated business models? ","caption":"cointelegraph.com","description":"Bitcoin, when explained through the allegory of a fictional village’s primitive accounting system, becomes much easier to understand by simply replacing paper records with digital data.","created_time":"2016-06-12T04:00:34+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_1159874360718937","from":{"name":"Ahmad Abdel-Halim","id":"1933903146842707"},"message":"https://surge.sh/","caption":"surge.sh","description":"Shipping web projects should be fast, easy, and low risk. Surge is static web publishing for Front-End Developers, right from the CLI.","created_time":"2016-06-11T08:38:25+10:00","total_likes":5,"total_comments":1},{"id":"172338516139198_1160013007371739","from":{"name":"Amira Yusuf","id":"1449007778452252"},"message":"any feedback about this course plz ? \nis this stack well known and used here in egyptian companies ?","caption":"edx.org","description":"Learn everything you need to know to develop a retail application using MongoDB, Node.js and the MEAN Stack.","created_time":"2016-06-11T14:28:39+10:00","total_likes":2,"total_comments":8},{"id":"172338516139198_1160566540649719","from":{"name":"Alaa Ali","id":"10154999548701303"},"message":"Looking for cheap email packages. any recommendations?","caption":null,"description":null,"created_time":"2016-06-12T12:38:51+10:00","total_likes":0,"total_comments":4},{"id":"172338516139198_1160411823998524","from":{"name":"Muhammad Negm","id":"10212131509466411"},"message":"مساء الخير تاني","caption":"manegm.com","description":"المقدمة لا أجد الا ان افتتح هذا المقال الا بتلك المقولة التي تخلد سوق العمل في مصر انا عايز كلمات خفيفة كلمات رشيقة كلمات تافهة عايزين ناكل عيش يابا.. اديني في الهايف وانا احبك يا ننس مزاجنجي - الكيف لذا...","created_time":"2016-06-12T06:02:33+10:00","total_likes":20,"total_comments":2},{"id":"172338516139198_1159552877417752","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"عن الـ bump ... أو Bring up my post\nبامب \"سأكتبها هذا حتى تستقيم الحروف العربية مع الإنجليزية في المشاركة\" هي مشاركات كانت تكتب قديما في المنتديات بغرض اعادة إحياء موضوع رُدِمَ تحت مشاركات كثيرة ... في البداية كانت وسيلة من الأعضاء لرفع المشاركات الجادة والهامة \"اذا اعتبرنا الموضوعات الحديثة في الأعلى والقديمة في الأسفل\" من أجل فصل الغث من السمين ...\nبعد فترة بدأ الأعضاء في اساءة استخدام بامب لإعادة احياء مشاركاتهم التي لم تلق اهتمام من الأعضاء الآخرين لضعفها ... وبدأت بعض المنتديات والخدمات في وضع عقوبات على مشاركات بامب عندما يقوم صاحب المشاركة نفسها ببامب مشاركته :)  والسماح للآخرين ببامب المشاركات ...\nفما كان من المستخدمين إلا ان يسيؤوا استخدام النظام مرة أخرى من خلال سؤال آخرين ليقوموا ببامب مشاركاتهم أو قيامهم بإنشاء حسابات اخرى لبامب المشاركة حتى يفلتوا من العقاب ...\nبامب في المحتوى العربي موجودة وبكترة ... مشكوووور\" ، \"يسلموأأأأ\" ، \"إيه يا جماغة فين الردود\" وما شابه من الردود التي سأمنا منها جميعا وبسببها هجرنا تلك المنتديات بحثا عن أماكن اخرى يتم فيها تقييم المحتوى بناء على محتواه وليس على مشاركات السادة الأعضاء وبدأت المنصات المختلفة في العثور على حلول من أجل ازالة تلك الآفة فولدت منصات مثل Stackoverflow وReddit و Digg رحمة الله عليه وغيرها.\nكانت هذه المقدمة الطويلة للحديث عن أصل تلك الآفة ووصولها إلى مجتمعنا التقني الصغير هنا. فيس بوك يقوم بترتيب المشاركات بناءاً على التعليقات. \nكل من كتب محتوى من قبل سواءاً كان تقنيا أو لم يكن يعرف جيداً نشوة تعليق وتجاوب الآخرين معه. ويعرف جيداً كم الإحباط الذي تواجهه في حال عدم مشاركة وتجاوب الأخرين معه. في النهاية القاعدة الذهبية تقول: CONTENT IS KING ... المحتوى هو الملك. فإن لم تجد تجاوب معك فاعلم انه لضعف في المحتوى أو لخلل في المتلقيين (ضعفهم أو عدم اهتمامهم بما كتبت). في النهاية اما ان تقوم بتحسين هذا المحتوى أو المحتويات الأخرى التي ستشارك بها في المستقبل ... فمشاركات مثل \"إيه تاني يا شباب\" و إضافة تعليقات لا تضيف للنقاش بهدف إعادة احياء المشاركة لن تعيدها للحياة.\nبقى ان تعلم ان المشرفين يحذفون تلك المشاركات :) فلا تضع مجهودك هباء. نحن مجتمع تقني متعلم ومعظمه اناس طيبون. لنرقى جميعا في نقاشاتنا ولنسموا عن تلك الأفعال :)\nوكل عام وانتم بخير","caption":null,"description":null,"created_time":"2016-06-10T21:45:25+10:00","total_likes":25,"total_comments":5}]}