{"posts":[{"id":"172338516139198_905796402793402","from":{"name":"Mohamed Abdel Aty","id":"10212491964880718"},"message":"i know websites like shodan constantly scan ip addresses for public information , my question is there any other website provide similar service that allow downloading the complete scan result ?","caption":null,"description":null,"created_time":"2015-03-08T05:10:29+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_905834059456303","from":{"name":"Ahmed Magdy","id":"10154728972235376"},"message":"This webinar is for anyone excited (or mildly interested) in learning Scrum. It will cover the Scrum framework, team roles, and an example of how you can implement Scrum with your team.","caption":"youtube.com","description":"If you’re new to Scrum or looking to learn more about the basics, check out this webinar by Axosoft. This webinar is targeted for anyone new to Scrum, hungry...","created_time":"2015-03-08T06:53:59+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_905907932782249","from":{"name":"Ahmed Elshaer","id":"1320087908034535"},"message":"To learn how the code Changed many lives..and how make the full use of Coding and Programming to make a Difference in any Career . \nJoin us :D\n#GSAMENA\n#GSAEgypt\n#GSAMNF","caption":"Semicolon | Faculty of Electronic Engineering","description":"The Power of Coding;\n\nCoding now rules our world, everything in our world now is depending essentially on code, machines in factories, copying machines and printers and even your washing machine, beside all these desktop programs and  mobile applications that we spend most of our time using it, coding makes our life much easier and much faster as well.\n\nSo GSA thought it’s important for students in The Faculty of Electronic Engineering to know more about coding and its importance and how to deal with it?!\n\nSo we brought you “ Semicolon ; ”\nFor the first time in The Faculty of Electronic Engineering, a specialist event in coding.\n \nSo, if you ever had an idea and you think it can make a difference into people’s life, you’re more than welcome to join us in our first event for the second semester.  \n( “ Semicolon ; ” Never Runs Without It )\n\nThe event will be held on Wednesday 11/3/2015 at the celebrations hall.\n\nStay tuned for more details about the speakers and the agenda.\n\n#GSAMENA\n#GSAEgypt \n#GSAMNF","created_time":"2015-03-08T10:34:41+11:00","total_likes":0,"total_comments":0},{"id":"172338516139198_905948802778162","from":{"name":"Bahy Maghrabia","id":"1424611524279210"},"message":"Announcing the MDN Fellowship Program","caption":"hacks.mozilla.org","description":"For nearly a decade, the Mozilla Developer Network (MDN) has been a vital source of technical information for millions of web and mobile developers. And ...","created_time":"2015-03-08T12:22:16+11:00","total_likes":3,"total_comments":1},{"id":"172338516139198_906204276085948","from":{"name":"Ahmad Alfy","id":"10154097389365670"},"message":"I apologize I had to give up my no ban policy ... Not because of the content of the post someone create but ... He was playing smart and he blocked me .... I couldn't see his profile or comment on the post to tell him what exactly this group is about and why he shouldn't post an ad for selling cell phones here ... I am sorry if anyone is offended but I had to ban this guy ...","caption":null,"description":null,"created_time":"2015-03-09T01:19:34+11:00","total_likes":8,"total_comments":8},{"id":"172338516139198_906226386083737","from":{"name":"Mahmoud Ibrahim","id":"10154874374735831"},"message":"Egyptian Geeks group is made to share knowledge, experience even Geeks jokes can posted or shared between all our members.\n\nWho is this group for:\n- Software Engineers/Developers.\n- UX / UI Designers.\n- Business Analysts.\n... not just Egyptians, but any Arab or Arabic speaking or those who are interested in those markets.\n\nThings we would like to avoid in our Group:\none of the main reason that we keep our group growing is our NON-SPAM contents, helpful topics, sharing problems and solutions and YOUR Participation :) . We will appreciate your help in keeping this group SPAM FREE and into the point. such as \"Ads, Non-Free Courses, etc...\"\n\nAUTO-POSTING Apps-bots are not permitted in our Group.\n\nWE ARE NOT GOOGLE! Do your research before posting any question. Don't waste our time and efforts while you didn't do the minimum to resolve your problem.\n\nFor Job Ads, please use out Job Board:\nhttps://www.facebook.com/groups/EgyptianGeeksJobs/\n\nCheck out our Archive:\nhttp://egyptian-geeks.github.io/EgyptianGeeksArchive/\n\nEGYPTIAN GEEKS","caption":null,"description":null,"created_time":"2015-03-09T02:09:31+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_906206302752412","from":{"name":"Hisham Abd El-Hafez Eid","id":"10155080508766171"},"message":"In the about section of this group, this is written: \n\n\"WE ARE NOT GOOGLE! Do your research before posting any question. Don't waist out time and efforts while you didn't do the minimum to resolve your problem.\"\n\nwaist out time?!! Can we get this corrected? \n\nI don't know who wrote this, so this is not personal :)","caption":null,"description":null,"created_time":"2015-03-09T01:25:05+11:00","total_likes":3,"total_comments":3},{"id":"172338516139198_903796332993409","from":{"name":"Mohamed Amin","id":"1858939887697579"},"message":"Crazy stuff !!","caption":"www.quora.com","description":"Answer (1 of 102): [code]* { background-color: rgba(255,0,0,.2); } * * { background-color: rgba(0,255,0,.2); } * * * { background-color: rgba(0,0,255,.2); } * * * * { background-color: rgba(255,0,255,.2); } * * * * * { background-color: rgba(0,255,255,.2); } * * * * * * { background-color: rgba(2...","created_time":"2015-03-04T08:06:09+11:00","total_likes":13,"total_comments":10},{"id":"172338516139198_905267949512914","from":{"name":"Mohamed Samy","id":"10158821643510355"},"message":"Dear Geeks,\n\nI have decided to never pay any money for software ever again, I made this decision 3 years ago and so far have not paid a single pence or even paid any subscriptions to any service. All software I use is free software and I have nothing cracked.\n\nI have also not paid for any music whatsoever, and am looking for a way to get books totally free. I currently have no trouble getting the information I need and only once 4 years ago paid for a book online.\n\nWhat do you think of trying a simialr experiment? Please tell me your experiences/opinions.\n\nBR,\nMSAMY\n\nA free geek :) A Sufi Geek :)","caption":null,"description":null,"created_time":"2015-03-07T07:01:06+11:00","total_likes":7,"total_comments":23},{"id":"172338516139198_906308229408886","from":{"name":"Mohammed EL-barbeer","id":"629098840630607"},"message":"Mozilla Egypt Tour #1 - Cairo ;) .","caption":"Mozilla Egypt Tour - Cairo","description":"أخيرا وبعد عدة محطات فى محافظات مصر  جولة موزيلا مصر تصل العاصمة - القاهرة الكبرى \n\nاتعلم - طور - ابتكر - اتحدى - استمر ......\n\nاعرف اكتر عن موزيلا - اتعلم ويب - صمم تطبيقات - انضم لمجتمع موزيلا المصرى .\n\nنحن فى انتظاركم و سعداء بمشاركتكم الحدث الاكبر لموزيلا فى مصر  يوم السبت 21/3 \n\nمركز التعليم المفتوح - جامعة القاهرة  - مبنى تعليمي 2 \n\nاليوم سيبدأ من 9 صباحًا و معكم حتى 5 مساءًا\n\nاليوم سينقسم إلى جزئين أساسيين\nالجزء الأول:\nو هو خاص بموزيلا ، المؤسسة، المجتمعات، المنتجات و كل ماله علاقة بها و أيضًا فتح الباب أمامكم للمشاركة معنا\nكممثلين لمجتمع موزيلا، أو كسفراء للطلاب في مدينتكم .. أو متطوعين معنا في مجتمع موزيلا مصر\n\nالجزء الثاني:\nوهو تقديم نظام Firefox OS والتعرف عليه وعلى كيفية تطوير تطبيق باستخدامه عن طريق عمل Circles لمشاركة الأفكار ومعرفة كل ماهو متعلق بالنظام، أيضًا سنقوم بتغطية لـ Firefox Webmaker فكونوا مستعدين لهذا اليوم الحافل بالمعلومات والإفادة.\n\nاستعد فيما بعد للحدث الأكبر \"Mozilla Egypt Camp\" حيث ستتاح لك فرصة المنافسة في تطوير وابتكار تطبيقات لنظام التشغيل فيرفُكس Firefox OS، اسع لتكن الرابح ضمن أفضل خمسة تطبيقات سيحصلون على جوائز قيمة من موزيلا.\n\nhttp://mozillaegypttour1.mozilla-eg.org/\n\nسجل الآن\nhttp://mozillaegypttour1.mozilla-eg.org/Cairo.html","created_time":"2015-03-09T04:50:15+11:00","total_likes":1,"total_comments":0}]}