{"posts":[{"id":"172338516139198_663470243692687","from":{"id":"766790573","name":"Amr Saafan"},"message":"We are looking for a Senior Web Developer to be responsible for developing innovative, reusable Web-based tools for progressive online activism and community building.\nOur web developers are capable of full cycle project leadership including application architecture, design input, site layout/user interface, database design/programming, and .NET development.\n\nRequired Technical Skills\n\n5+ years of experience in software development utilizing MS Visual Studio 2010/2012 (.Net Framework 3.5/4.0/4.5 C#, VB.NET, ASP.NET, MVC , HTML, AJAX, JavaScript, JQuery, Entity Framework, WCF, Web Services)\n5+ years of experience working with MS SQL Server Databases and Stored Procedures (SQL 2005, 2008 or 2012 preferred).\nStrong Object Oriented design and development skills.\nStrong experience designing and working with n-tier architectures (UI, Business Logic Layer, Data Access Layer) along with some experience with service-oriented architectures (SOA).\nExperience with source control tools (TFS/VSS/SVN/Github)\nExperience with issue tracking and bug tracking systems\nSupport day-to-day running of applications.\nExperience with Third party controls like Telerik is a plus\nExperience with CMS Systems like Dotnetnuke is a plus.\nDetail oriented with good communication skills\nFollow software development best practices with respect to documentation and configuration management.\nWork remotely with development team to build and improve overall product quality.\nself-motivated, independent, detail oriented, responsible team-player and exhibit exceptional relationship management skills\n\nPlease send you resume to amr.saafan@gmail.com with Subject: SL-WBDV","created_time":"2013-12-02T07:30:20+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_663498917023153","from":{"id":"873615634","name":"Christy Badry"},"message":"An innovative healthcare technology Company is hiring a qualified caliber :\n\nTitle (Software Developer ):\n\nBasic Functions:\n\n• Perform translation of designs into software, development of code, documentation, and software testing\n• Perform modification of software, fixing software “bugs” in existing code, and troubleshooting issues on production and test systems.\n\nPrincipal areas of activity:\n\n• Modify existing software to adapt it to new hardware and improve the performance.\n• Design and develop software systems.\n• Analyze information, determine, recommend and plan installation of a new system or modification of an existing system.\n• Develop software system testing and validation procedures.\n• Plan software programming and development of documentation.\n• Consult with customers, other departments on project status, proposals and technical issues.\n• Store, retrieve and manipulate data for analysis of system capabilities and requirements.\nKey Measurement:\n• 3+ years’ experience writing web application in .NET\n• Strong knowledge in HTML and CSS\n• Strong knowledge in SQL Server development.\n• Strong knowledge in ECMA JavaScript\n• Strong knowledge in jQuery is a must\n• familiarity with ASP.NET MVC is a must \n• familiarity with Entity Framework is a plus\n• familiarity with Web Service, XML and JSON is a plus\n\nTo Apply please send your CV at : (Christina.saber@drbridge.com)","created_time":"2013-12-02T09:40:43+0000","total_likes":1,"total_comments":11},{"id":"172338516139198_663542707018774","from":{"id":"705284790","name":"Gaith Ahmed"},"message":"Lebanese Hardware startup littleBits raises $11.1 million launches Synth Kit http://bit.ly/1cgYMH5","caption":"arabcrunch.com","description":"Lebanese hardware startup littlebits who got its feed investment round from mostly Arab investors like Fadi Ghandour Chairman of Wamda and founder of Aramex, has secured series B in funding of $11 ...","created_time":"2013-12-02T11:55:54+0000","total_likes":1,"total_comments":1},{"id":"172338516139198_663885473651164","from":{"id":"553824563","name":"Mohamed Ameen Demiry"},"message":"I did share this before but just in case you missed it.. Hilo is a great starting point if you like to learn how to design build E2E Windows Store application..\nDon't forget to read the accompanied book..","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","created_time":"2013-12-03T01:49:25+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_664016243638087","from":{"id":"100000224131120","name":"Moutaz Shams"},"message":"إمنعوا الضحك :D","caption":"www.youm7.com","description":"يقول المهندس ياسر عبد الحميد، الخبير التقنى ومدير مركز تكنولوجيا المعلومات بأسيوط إن","created_time":"2013-12-03T10:48:44+0000","total_likes":4,"total_comments":6},{"id":"172338516139198_664230806949964","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","created_time":"2013-12-03T18:19:50+0000","total_likes":5,"total_comments":2},{"id":"172338516139198_664468856926159","from":{"id":"739679845","name":"Hany Khaled"},"message":"\"Communication Magazine\" Page: Please click Like to the page and we are honored for joining, comments and opinions.\n\nhttps://www.facebook.com/CommunicationMagazine","description":"www.communication-mag.com\nwww.facebook.com/CommunicationMagazine\nwww.twitter.com/CommunicationMg\ninfo@communication-mag.com","created_time":"2013-12-04T03:19:12+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_664499396923105","from":{"id":"1550251001","name":"Amr Selim"},"message":"مساعده يا جماعه وياريت الي عنده اي معلومه ما يبخل بيها\n-------------------------------\nسلام عليكم انا الدومين بتاعي واخد بان من الفيس بقالو سنتين اشتريت دومين جديد قعد اسبوع واخد بان انا قولت يمكن السوفت وير بتعتي فيها مشكله وبالفعل عملت فحص على virustotal.com وكلمت كتير من الشركات الي كانت مصنفاني اني milcation website الحمد لله البان اتفك اسبوع ورجع تاني مش عارف المشكله من ايه انا عملت كل الي اقدر على وبعت كتييير Reports ولا حياة لمن تنادي\n\nاتمنى لو عند اي اي احد  وسيله او معلومه يفدني بيها اكون متشكر جدا جدا ليه واسف جدا على الازعاج يا \n\nefhamcomputer .com\n efhamcomputer .net","created_time":"2013-12-04T04:55:27+0000","total_likes":0,"total_comments":7},{"id":"172338516139198_664545473585164","from":{"id":"100002045429029","name":"مُحَمَّد أبو آدم"},"message":"I hate when i see a good plugin that doesn't have a destroy method. Well i did the pull request for Bootstrap Carousel plugin and I added the destroy function give it +1 if you like it so they can approve the pull request faster :)\n\nhttps://github.com/twbs/bootstrap/pull/11704","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","created_time":"2013-12-04T08:11:23+0000","total_likes":1,"total_comments":1}]}