{"posts":[{"id":"172338516139198_1394751363897901","from":{"name":"Mohamed Alaa El Din","id":"1252478278163674"},"message":"I was looking for a good email client that allow me to manage multiple accounts at once in my mac. i've used before Airmail but the sync is crappy and you have to reindex every once in a while. then a friend recommended me this email client SHIFT where I can have multiple gmail account and switch easily between my calendars and docs. Very highly recommended Geeks!","caption":"tryshift.com","description":"Shift into higher gear with the email client that makes navigating between Mail, Calendar and Drive accounts fast, easy, and beautiful.","created_time":"2017-02-20T18:09:33+11:00","total_likes":4,"total_comments":2},{"id":"172338516139198_1393936987312672","from":{"name":"Mohamed G. Hafez","id":"451272495264074"},"message":"حد اشتغل بالـ tool دى قبل كده ؟https://pusher.com عشان يعمل real time notifications or messages مثلا ؟","caption":"pusher.com","description":"Add interactive and engaging features to your apps with APIs, libraries and developer tools in a matter of minutes, not weeks.","created_time":"2017-02-19T22:34:47+11:00","total_likes":2,"total_comments":5},{"id":"172338516139198_1393952843977753","from":{"name":"Mohamed H. Safey","id":"10212080923883556"},"message":"السلام عليكم\nدلوقتي انا خلصت كورس علي udemy.com web development تحديد front end فيه html,css,bootstrap,javascript,jquery و كنت عاويز اعمل cv او resume كويسة و حل لمشكلة الportfolio","caption":null,"description":null,"created_time":"2017-02-19T23:00:54+11:00","total_likes":6,"total_comments":4},{"id":"172338516139198_1395142897192081","from":{"name":"Mohamed Nawito","id":"440376099647399"},"message":"For any entrepreneur willing to build a tech startup, the post contain some interesting links about investment sources and consider that you know nothing about startups & entrepreneurship.","caption":null,"description":null,"created_time":"2017-02-21T00:33:32+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1395148903858147","from":{"name":"Ahmed Mahmoud","id":"1744998545829875"},"message":"Hi \ni would like to share with you simple HTML5  puzzle game i made using javascript \non codecanyon  \n\nfeedback plz \n\nhttps://goo.gl/H2nvea\nvideo :  https://goo.gl/gnl2fq\nplay it : https://goo.gl/MojVRz","caption":"codecanyon.net","description":"- Colorize is Html5 mobile game made with phaser framework with admob support . – It is one touch control puzzle game . , drag the monster and release to lunch it Features 1- cross platform 2- e...","created_time":"2017-02-21T00:43:20+11:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1388169031222801","from":{"name":"Tony Raoul Iscaros","id":"10155085965723420"},"message":"Anyone knows who is sarahah website owner ? I found many catastrophic vulnerabilities in it\n\nUpdate: I contacted Him , He said he know that his website is vulnerable.","caption":null,"description":null,"created_time":"2017-02-15T02:44:55+11:00","total_likes":6,"total_comments":9},{"id":"172338516139198_1395056320534072","from":{"name":"Mohamed G. Hafez","id":"451272495264074"},"message":null,"caption":null,"description":"ايه الحاجات اللى بتميز لينكس وبتخليه مفيد خصوصا للمبرمجين \n1- اللينكس مش نظام تشغيل .. \nاللينكس هو Kernel (نواة) لآلاف الاصدارات من أنظمة التشغيل ...يعنى ايه o.O ؟ ..\nيعنى هو الحاجة اللى بيتبنى عليها نظام التشغيل و ممكن يتطور عليها اكتر من نظام تشغيل تانى ﻻنه ببساطة Open Source\n2- ممكن تجربه من غير ما تسطبه \nانت مش محتاج تشيل الويندوز وتنزل linux عشان تجربه ... لا ده انت ممكن تجربه باستخدام Virtual machine او تنزل liveUSB version\n3- ممكن تستخدم اكتر من ديسكتوب \nتخيل نفسك شغال على جهاز واحد باكتر من desktop .. كل واحد عليه اللى انت محتاجه فى وقت معين ... تقدر تفصل بسهوله وتركز فى اللى انت بتعمله\n4- اللينكس بيحتاج configurations اقل من الويندوز \nساعات كتير لما بنوصل فلاشة أو ماوس جديد بالكمبيوتر مبيشتغلش عشان مش لاقى الـ Driver بتاعه المشكلة دى مش موجودة فى اللينكس لانه بيدور على الـ Driver وبينزله automatic\n5- الـ Linux سهل تعدله وتشكله لاكتر حاجة مناسبه لإستخدامك وده لإنه Open source يعنى كل حاجة فيه قابلة للتعديل بس ده للمستويات المتقدمة مش اى حد يكتب يعدل فيه بسهولة\n6- بيشتغل بكفائة عالية على الأجهزة القديمة\nاللينكس صغير وخفيف وممكن تتسخدمه على انواع كتير من الـ Electronics زى الـ DVD players والعربيات\n7- الـ Command System\nاللينكس فيه Command system بتتيح انك تعمل tools سريعة تستخدمها من غير ما تحتاج بيئة عمل خاصة و ده بيوفرلك امكانيات كتير جدا وبيوفرلك مجهود ووقتك على عكس ما الناس متخيلة وبيخافوا من شاشة الـ Terminal :D\n8- اللينكس مجانى ... ولكن يدعم من شركات كبيرة \nزى ما كلنا بنسمع انه مجانى .. بس نسخ الـ linux المعروفة بتدعمها شركات كبيرة وده بيخليها رغم انها مجانية .. الا ان دعمها زى النسخ المدفوعة ومش هتحتاج تنزل كراكات عشان تشغله :D\n9- الـ Update مبيحتاجش restart ^_^\nانسى ان الكمبيوتر يعمل restart خمس ست مرات عشان ينزل الـ Updates\nالـ Linux بينزل الـ updates كلها مرة واحدة من غير ولا Restart واحد\n10 - ممكن تشغل عليه برامج الويندوز :)\nفى مشروع كبير اسمه WINE وده بيسمحلك انك تشغل معظم برامج الويندوز على الـ linux\n11 . بينزل عليه حاجات كتير جاهزة زى Python مثلا وممكن تسطب عليه PHP, Git, Apache, MySQL بمجرد انت بتكتب كوماند واحد لكل حاجة تقريبا","created_time":"2017-02-20T23:32:56+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_1394419227264448","from":{"name":"Salem Attia","id":"616981045157640"},"message":"السلام عليكم \nدلوقتى وانا بعمل الداتا بيز بتاع مشروع شغال فيه ف 2tables student  and doctor\nالفكرة بقااا انا فى حاجات هتكون موجوده ف table ومش هتكن ف التانى زى مثلا student هيكون ليه stage \nو doctor  هيكون فى علاقة بينه وبين subject table \nفا انا فضلت اعملهم ف 2  table عشان الاختلافت زى اللى زكرتها فوق بس فكرة بقاا لما يجى اليوزر اول ما  يعمل login على ال system هيعمل check ف doctor , student table \nكدا هياخد وقت وااهندل جزء زى ده رخم ومش حلو \nف لو حد عندو اقتراح  وتعديل طريقة احسن ملحوظ صفحة ال login واحدة للكل نفس الroute","caption":null,"description":null,"created_time":"2017-02-20T08:37:31+11:00","total_likes":1,"total_comments":7},{"id":"172338516139198_1394880827218288","from":{"name":"Nareman Atia","id":"1869639703258290"},"message":"السلام عليكم\nكنت عاوزة اعرف ايه أفضل موقع حجزhosting\ngodaddy,winhost,myasp.net,smarter\nاوموقع تاني غيرهم\nانا هعمل hosting لمواقع كتير مش موقع واحد\nهل الأفضل احجزhostingلكل موقع لوحده ولا multiple sites. ,ولا Ultimate \nاستخدم أي plan","caption":null,"description":null,"created_time":"2017-02-20T20:20:26+11:00","total_likes":0,"total_comments":4},{"id":"172338516139198_1395621957144175","from":{"name":"Mohamed AbuIssa","id":"1364997500240454"},"message":null,"caption":"youtu.be","description":"Tech debt works kind of like debt in real life. You can accept tech debt to *get what you want quickly*, but in return you’ll have to do *more work later*. A...","created_time":"2017-02-21T09:09:07+11:00","total_likes":4,"total_comments":1}]}