{"posts":[{"id":"172338516139198_945244875515221","from":{"name":"Ashraf Abdel Aleem","id":"1809964769326531"},"message":null,"caption":null,"description":null,"created_time":"2015-05-26T11:09:09+10:00","total_likes":0,"total_comments":2},{"id":"172338516139198_945365802169795","from":{"name":"Ashraf Abdel Aleem","id":"1809964769326531"},"message":"Think twice before you reply to this:\nWhy would you use \"DevExpress\" or similar reporting plugins while you may spent more hours developing your own reports using HTML and CSS and win the performance battle?","caption":null,"description":null,"created_time":"2015-05-26T13:58:35+10:00","total_likes":1,"total_comments":3},{"id":"172338516139198_945711932135182","from":{"name":"Emad Elsaid","id":"10154379038212957"},"message":":D يحنن يابنى","caption":"youtube.com","description":"An ode to developers everywhere...","created_time":"2015-05-26T23:01:12+10:00","total_likes":12,"total_comments":1},{"id":"172338516139198_945951872111188","from":{"name":"Muhammad Sherbeeny","id":"10158237074750527"},"message":null,"caption":null,"description":"اخيرا... التقديم على اقامة استونيا الالكترونية بقى متاح اونلاين:\nEstronia's E-Residency Online Application\n\nانا الحمد لله قدمت واسلمتها وبتكون صالحة لمدة ٣ سنوات وعليها الاسم الأول والأخير من باسبورك او بطاقتك:\nhttps://www.facebook.com/810340526/posts/10155895364485527/\n\nحسب اللي حصل معايا.. فالموافقة عليها سهلة جدا طالما مفيش شكوك اجرامية في صاحب الطلب... ودفعت ٥١ يورو (بقت ١٠٠ يورو والدفع اونلاين بالكريدت كارد وانت بتكتب الطلب اونلاين)... قالوا الاستلام اخره من اسبوعين لشهر.. لكن انا استلمتها بعد حوالي شهرين ونص... ولما سألتهم قالولي ان التأخير نتيجة الضغط غير المتوقع عليهم.\n\nنقول تاني \"بعض\" فوائد الاقامة الالكترونية الاستونية:\n1. تقدر تعمل حساب بنك في استونيا وتتعامل بيه اونلاين.\n(تحديث: حاليا لازم تروح إستونيا ولو مرة واحدة لفتح حساب بنكي هناك وتقنعهم.. ممكن يوافقوا وممكن يرفضوا.. تفاصيل في التعليقات.. وبيشتغلوا على اصدار قانون لتمكين البنوك من فتح حسابات بعد اجراء مقابلة فيديو اونلاين دون الاحتياج لزيارة البنك فعليا)\n2. لو البزنس بتاعك اونلاين مثلا او مش محتاج التواجد الجغرافي في مكان محدد.. فتقدر تأسس شركة الكترونية في استونيا وتديرها اونلاين من اي مكان في العالم. (بيقولوا  اجراءات التأسيس بتتم في 18 دقيقة فقط!)\n3. الضرائب مطلوبة فقط عند توزيع الارباح على المساهمين.\n4. جميع الشركات بيتم تسجيلها في الاتحاد الاوروبي.\n5. أقل مايمكن من البيروقراطية واسهل واسرع مايمكن في الاجراءات.\n6. اوضح مايمكن من الشروط وهياكل العمل.\n7. اقل مصاريف لانشاء حساب البنك او الشركة.\n8. الامضاءات الالكترونية في استونيا متساوية 100% بالامضاءات الورقية.\n\nكل ده على حسب كلامهم.. هما شرحوا اكتر عن الفوائد في اللينك ده:\nhttps://e-estonia.com/e-residents/services-and-benefits/\n\nاستونيا دولة رائدة جدا في تقديم خدمات الكترونية لمواطنيها وزائريها... حتى الانتخابات بيعملوها اونلاين بالموبايل. (الاوائل والوحيدين حتى الآن على حد علمي) واللي عملوا برنامج سكايب ناس من استونيا\n\nاتمنى بس الناس كلها تستوعب ان دي اقامة الالكترونية... وبس... لاتعطيك حق الاقامة الفعلية في استونيا ولا حتى فيزا لدخولها.\n\nلينك تقديم الطلب اونلاين:\nhttps://apply.e-estonia.com/\n\nاتمنى ان ماتحصلش حاجة من الحكومة او المصريين نفسهم تجبر استونيا على منع الاقامة الالكترونية عن المصريين.\n\nياريت اللي جربها او جرب حاجة تانية شبهها يشاركنا ويقولنا خبرته.\n\nو بالتوفيق للجميع :)","created_time":"2015-05-27T03:08:02+10:00","total_likes":5,"total_comments":0},{"id":"172338516139198_945741252132250","from":{"name":"Mohamed Fawzy","id":"1319206024863148"},"message":"Fedora22 is here :D \n\nthe official release of Fedora 22 now available\nin Cloud, Server, and Workstation editions.\n\n jump over to Get Fedora to download or for current users, run the FedUp upgrade tool.\n\nhttps://getfedora.org/\nhttps://fedoraproject.org/wiki/FedUp","caption":"getfedora.org","description":"Fedora Workstation is a polished, easy to use operating system for laptop and desktop computers, with a complete set of tools and helpers for developers and makers of all kinds.","created_time":"2015-05-27T00:24:05+10:00","total_likes":1,"total_comments":1},{"id":"172338516139198_945117078861334","from":{"name":"Mohamed Mansour","id":"10154610780577326"},"message":null,"caption":null,"description":"ما هي افضل الطرق لبرمجة تطبيقات الهواتف الذكية و الاجهزة اللوحية ؟ \n\n- افضل الطرق ان يتم برمجة كل تطبيق علي حدة وفق النظام الذي سيعمل عليه \nيسمي ذلك البرمجة بطريقة \nNative \nمثلا يتم برمجة تطبيق الاندرويد وحده بنظام يتوافق معه\nو هكذا مع تطبيق الايفون و تطبيق الويندوز فون و لا مانع ان يتفقوا معاً في شكل الاخراج و ان يتم امداهم بالمعلومات من نفس قاعدة البيانات \n\nNative \nهي الافضل و لكنها تحتاج إلي المزيد من الوقت في البرمجة لانها تطلب برمجة التطبيق او الفكرة ولكن عدة مرات حيث يتم برمجة كل نظام تشغيل بلغة برمجة مختلفة و بالتالي يكون سعرها أغلي \nو المثال الاشهر لها لتدرك الفارق هو العمل من خلال تطبيق\nFacebook for Android - Facebook for iPhone \nاما الطرق الاخري الاقل في ثمن و وقت البرمجة و لها عيوبها اشهرها طريقتين :\n \n\nWeb Mobile \nو هو ليس تطبيق ولكن هنا يتم عمل موقع علي الانترنت بشكل عادي جدا ولكنه يكون متناسب مع احجام الهواتف الذكية Responsive ثم يكون الدخول اليه فقط عن طريق المتصفح و بالتالي فيكون سعره اقل حيث يحتاج لوقت اقل فى برمجته لكنه يكون بطئ \nحيث يستغرق وقتاً بين عملية الطلب والرد بين المتصفح والخادم\n\nCross Platform  \nو هي ميزة سريعة في وقت برمجتها حيث يتم برمجة تطبيق واحد فقط و يتم عمل نسخ منه علي انظمة التشغيل المختلفة مثل الاندرويد و الايفون و الويندوز فون و البلاك بيري ايضاً \n\nيبقي العيب الخطير لهذه الطريقة عند حدوث اي تحديث في اي نظام من نظم التشغيل تلك تبدء التطبيقات في اظهار اعطال و بالتالي تحتاج إلي اعادة التصميم من جديد \n\nفي نهاية الامر ان تصميم تطبيقات الهواتف الذكية و الاجهزة اللوحية يحتاج الي استثمار في الطريقة الاكثر كفاءة التي تجنبك المشاكل المستقبلية و تؤدي للريادة اثناء المنافسة \n\nو أخيراً .. اذا كنت تري ان المقال أعجبك واضاف لك معلومة جديدة فشاركه مع اصدقائك","created_time":"2015-05-26T09:18:24+10:00","total_likes":3,"total_comments":3},{"id":"172338516139198_946329348740107","from":{"name":"Morad Edwar","id":"10212482712403270"},"message":null,"caption":"www.lifehacker.com.au","description":"Even if you don’t care about the privacy implications of tracking cookies and other technologies sites use to identify us online, you might want...","created_time":"2015-05-27T17:48:51+10:00","total_likes":0,"total_comments":0},{"id":"172338516139198_946152682091107","from":{"name":"Mohammed El Sayed","id":"10154884040390170"},"message":"عن برمجة البرنامج اللى بيبرمجوا بيه البرمجه أتحدث :D","caption":null,"description":null,"created_time":"2015-05-27T09:51:41+10:00","total_likes":25,"total_comments":5},{"id":"172338516139198_945820255457683","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"عندي اقتراح اننا نعمل جروب علي الواتس نتكلم فيه مع بعض ونناقش اي مواضيع تقنية ايه رأيكم في الاقتراح ؟ اللي عنده اعتراض او تأييد يتفضل؟ اللي يحب يشارك معانا يسجل الرقم ده ويبعتلي رسالة عالواتس وهضيفه علي الجروب\n\n01148886415","caption":null,"description":null,"created_time":"2015-05-27T01:45:57+10:00","total_likes":17,"total_comments":20},{"id":"172338516139198_946727012033674","from":{"name":"Tamer Sharkas","id":"1319583798122147"},"message":"A new Egyptian Freelancer Marketplace\n\nAvailable Categories:\nAdvertising - Business - Graphics & Design - Music & Audio - Online Marketing - Programming & Tech - Video & Animation - Writing & Translation","caption":"fillingaz.com","description":"Posted in Advertising, Banner Ads, Banner Advertising, Business Cards & Stationery, Graphics & Design, Social Media Design, Web & Mobile Design","created_time":"2015-05-28T01:40:05+10:00","total_likes":8,"total_comments":8}]}