{"posts":[{"id":"172338516139198_1366793763360328","from":{"name":"Mohamed Moshrif","id":"1235868066468537"},"message":"سؤال بيطرح نفسه. بما إني رجعت مصر, الفتره اللي فاتت قبل شغلي الحالي كنت اتكلمت مع أكتر من شركة ولاحظت حاجة مشتركه مابين شركات كتير وهي التركيز غير الطبيعي على المسميات!\nمن أيام ما كنا طلبة في كلية حاسبات, من أكتر الحاجات اللي كنا بنكرهها في حياتنا هو اسئله ال essays اللي من نوع \"عرف الفرق مابين ال stack وال queue\" والحاجات ديه.\nالمشكلة هنا بقي إن فيه شركات بتتعمل انترفيو مع حد معروف انه عنده خبره فوق ال 13 سنة والمفروض انه مقدم على وظيفة architect أو حاجة مشابهة والتركيز كله على اسئله من نوعيه \"عرف ال BDD واشرح الفرق ما بينه ومابين ال TDD\"\nطب بجد هو ده المفروض كده يختبر خبره 13 سنة إزاي؟! يعني نوعيه الاسئله ديه ممكن واحد لسة متخرج أول امبارح يقعد يقعد على الانترنت في weekend يحفظها وهيجاوب على كل الاسئله ديه زي القرد, يبقي بجد إيه الحكمه؟!\nشخصيا كنت فاكر إن لما حد يطلب Architect إن الاختبار هيبقي من نوع \"بص, احنا عندنا المشكلة ديه ومحتاجين نعرف هنحلها إزاي\" ويبقي النقاش على إزاي ال architecture نفسه هيتبني مش هيبقي على أساس \"ايه الفرق مابين ال microservices وال SOA\"\nمش ده المفروض الطبيعي؟! يعني أنت عايز تجيب واحد عنده خبره 13 سنة وتديله مرتب حد عنده خبره 13 سنة, مش المفروض تختبر هو هيعمل إيه في المشاكل اللي عندك حاليا واللي أنت جايبة أصلا علشان يحلها؟!\nالله يكرم اصله, كان واحد partner architect في مايكروسوفت قالي مره: لما تيجي تعمل انترفيو, أي سؤال ممكن يتجاوب في اقل من 30 ثانية على جوجل, هيبقي سؤال ملوش أي ستين لازمة!","caption":null,"description":null,"created_time":"2017-01-26T21:44:10+11:00","total_likes":25,"total_comments":11},{"id":"172338516139198_1366117240094647","from":{"name":"Ahmed Soliman","id":"10154895123660943"},"message":"While looking for an effective way to estimate time for some types of project I got some funny but serious talks \n\nThe best you can do is break the task down into the smallest pieces possible (no more than 1/2 day each) and then triple the final number you come up with.(Spolsky Method) ... \n\nAny opinions ?\n\n","caption":"stackoverflow.com","description":"I am having a difficult time with management asking for estimates on programming tasks that are using third-party controls that I have no prior experience with. I definitely understand why they wo...","created_time":"2017-01-26T05:21:44+11:00","total_likes":12,"total_comments":2},{"id":"172338516139198_1371655366207501","from":{"name":"Mohamed AbuIssa","id":"1364997500240454"},"message":null,"caption":"medium.freecodecamp.com","description":"Github has made it easy for millions of developers to publicize their projects so they can attract users and collaborators. But these…","created_time":"2017-01-30T09:44:53+11:00","total_likes":8,"total_comments":0},{"id":"172338516139198_1371677506205287","from":{"name":"Tito Sadek","id":"10212411312182266"},"message":"share please !\nhttps://www.facebook.com/events/407590886255612/","caption":"فتح باب التقديم لمجاستير هندسة البرمجيات - جامعة حلوان","description":"تعلن جامعه حلوان - كلية الحاسبات والمعلومات - برنامج ماجستير هندسة البرمجيات \nعن فتح باب التقديم فى البرنامج وذلك ابتدءاً من يوم الاحد الموافق 29 يناير على أن ينتهى فى يوم الاتنين الموافق 13 فبراير","created_time":"2017-01-30T10:27:27+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_1371749236198114","from":{"name":"Mohammed Hussien","id":"10154099730567024"},"message":null,"caption":null,"description":"مقابلة منذ قليل مع Mohamed Elsherif على قناة سكاي نيوز عربية و موضوع عن Ask Developer Podcast و أنشطلتها المختلفة في مجتمع المطورين و التحديات التي تواجه المبرمجين المصريين و العرب في المنطقة العربية.","created_time":"2017-01-30T11:47:56+11:00","total_likes":4,"total_comments":1},{"id":"172338516139198_1371542539552117","from":{"name":"Shady Atef","id":"10210653485386787"},"message":"Howa Codeblocks bycrash m3a 7d for no reason on linux ?","caption":null,"description":null,"created_time":"2017-01-30T08:26:01+11:00","total_likes":2,"total_comments":11},{"id":"172338516139198_1369120413127663","from":{"name":"Ali Elzantot","id":"10212879252044234"},"message":"In your opinion what is the best JavaScript book?","caption":null,"description":null,"created_time":"2017-01-28T08:19:45+11:00","total_likes":2,"total_comments":8},{"id":"172338516139198_1371105489595822","from":{"name":"Sam Almahy","id":"10158386141730165"},"message":"هوا ايه اللي جرا فالدنيا ؟؟؟\nو ريتها جت على كده\n\nhttps://microsoft.github.io/","caption":null,"description":null,"created_time":"2017-01-30T00:02:26+11:00","total_likes":8,"total_comments":6},{"id":"172338516139198_1372055006167537","from":{"name":"Ahmed Zain Mohammed","id":"10155252594718081"},"message":null,"caption":"positech.co.uk","description":"What is it with TV executives and non-tech savvy journalists? Can they not do the vaguest bit of research and kill of this myth about ‘gifted child genius programmers and hackers’? its so off-base its laughable, especially to anyone my age who works as a software engineer. If it isn’t immediately ob...","created_time":"2017-01-30T18:53:53+11:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1371253526247685","from":{"name":"Mohamed A-Abd El Monim","id":"10210258298647086"},"message":"Should I go on with the security career or I am too late that I won't reach anything? I am a level 2 computer science student.\nI just have the fear that I am wasting my time trying to learn about something and when the time comes and I graduate I find no job as I don't have enough experience or I am not good enough, so any advice?","caption":null,"description":null,"created_time":"2017-01-30T02:11:39+11:00","total_likes":3,"total_comments":5}]}