{"posts":[{"id":"172338516139198_1131028580270182","from":{"name":"Hisham Hassan","id":"10155120512779187"},"message":"I have an idea and would like to know how many of you interested in it. I want Egyptian developers with successful Android apps to refer to other apps from inside app (cross promoting)","caption":null,"description":null,"created_time":"2016-04-25T06:06:15+10:00","total_likes":8,"total_comments":5},{"id":"172338516139198_1132396823466691","from":{"name":"Amir Abou Eesa","id":"1353018234756623"},"message":"What is your experience using a NoSql DB i.e. Mongo with .NET im using MEAN now and its a heaven as JS is type-less so dealing with JSON documents is perfect , what difficulties you face with .NET \"or may be any type based languages\".","caption":null,"description":null,"created_time":"2016-04-27T06:59:25+10:00","total_likes":2,"total_comments":0},{"id":"172338516139198_1132402293466144","from":{"name":"Ahmed Ramadan","id":"1845740719014792"},"message":"i am using oracle DB 11 g XE to connect it with C# \nbut when i am trying to add connection this error will display \n[[Error while trying to retrieve text for error ora-01019 ]]\ni used some ways to solve it but all failed \nany help to solve it ?","caption":null,"description":null,"created_time":"2016-04-27T07:11:53+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1131317980241242","from":{"name":"Khaled M. Diab","id":"10212550395463324"},"message":"I read this article about HTTP requests throughput using python3 and aiohttp library. The author attempts to write an async http client to generate the max. number of requests. I think that this type of articles shows us how NOT to write a benchmarking article :D\n \nAlthough the HTTP request is realistic (requesting a file from disk; not just an echo) and the introduction is catchy, the author failed to benchmark the library very well. First, the article didn't mention benchmark setup: client & server specifications (CPU/memory/network interface etc...). Second, the title is actually misleading: the author failed to write 1M requests per what time unit! Third, the author is adding non realistic delay values between 0-1 seconds; these delays usually follow a distribution and not uniformly distributed as the author used. Fourth, it's clearly that the author didn't do his homework by reading some benchmarking articles/software (it's obvious from the questions he asks in the end).\n\nMore importantly, and from the technical viewpoint, this article actually shows that python sucks :D (I used python daily btw). Generating 1M requests in 52 minutes means that the async client can generate ~320 req/sec which is really a small number (the CPUs are fully utilized as the author mentioned). To put this number in perspective, the old \"ab\" can simply generate 1K req/sec. JMeter can generate 30K req/sec, and \"wrk\" can generate 750K req/sec!\n\nI think that such articles shed the light on how we should benchmark HTTP request generating tools: workload and delay specifications, minimum CPU/memory requirements, etc..\n\nWhat do you think?","caption":"pawelmhm.github.io","description":"In this post I’d like to test limits of python aiohttp and check its performance in terms of requests per minute. Everyone knows that asynchronous code perf...","created_time":"2016-04-25T17:52:28+10:00","total_likes":2,"total_comments":1},{"id":"172338516139198_1132461263460247","from":{"name":"Anas Rabei","id":"621823724675667"},"message":"A question to python/Django geeks\nWhat is the preferred way to use MongoDb with Django?","caption":null,"description":null,"created_time":"2016-04-27T09:31:14+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1132471616792545","from":{"name":"مصطفى يحيي","id":"1613943885300033"},"message":"is there a software/way to convert a pdf/word file into file that is formatted as one sentence per line . \nand if it is not ...can you help me start making a one ? \n.\n.\nalready googled but no promising results.","caption":null,"description":null,"created_time":"2016-04-27T10:01:53+10:00","total_likes":0,"total_comments":1},{"id":"172338516139198_1132223976817309","from":{"name":"Morad Edwar","id":"10212482712403270"},"message":"هو مش اختراع ولا حاجة خالص هو مجرد فكرة وجت فى دماغي للتسهيل على الناس بدل ما يفتحوا adb ويعملوا دة manual ... الكود اوبن سورس على github ياريت لو حد حابب يساهم معايا خصوصا فى الـ UI عشان مش احسن حاجة خالص ومعمولة على استعجال.","caption":null,"description":null,"created_time":"2016-04-27T02:00:55+10:00","total_likes":25,"total_comments":6},{"id":"172338516139198_1132011710171869","from":{"name":"Mohammad Fouad","id":"10154777096910845"},"message":"Aside from the journalistic social media hype, bash on windows explained by technical guys. And it is actually impressive.\nTo sum up:\n- This is a kernel emulator, it emulates kernel APIs for Linux programs.\n- it handles File Modes and permissions and inserts them in NTFS extended attributes.\n- Currently IPv6 might have some issues. if you have IPv4 it should work fine.\n- You can run Ruby or Python and most of the GNU/Linux tools.\n- Currently the Linux process is separate from the Win32 world, it runs in its own session (a windows term that is somewhat similar to a container), so /bin/ps will not show Windows processes running on Windows. (Confirm?)\n- In the future they plan to span multiple Linux instances in multiple sessions, so each bash can be its own container (this might mean native docker support?)\n- Difference from Cygwin and Msys, these are compiled ports to Win32 processes, while now you can run actual linux compiled code.\n- Difference from the discontinued SFU that exists in Windows Server (Windows Subsystem [or Services] for Unix).\nThe difference is that SFU was emulating user mode calls to Win32 equivalents which is a much larger number of API than the Kernel mode.\n- Not all the Kernel syscalls are implemented yet.\n- Linux apps run in a pico-process (search DrawBridge), so a linux app cannot call a win32 user-mode APIs (also win32 apps cannot invoke linux syscalls),","caption":"channel9.msdn.com","description":"In this video Deepu Thomas lays down the real scoop behind the Windows Subsystem for Linux. There was a lot of speculation surrounding how this feature actually worked so I decided to find out. This","created_time":"2016-04-26T19:34:40+10:00","total_likes":8,"total_comments":5},{"id":"172338516139198_1132704776769229","from":{"name":"Abdelrhman Talat","id":"10209099395744449"},"message":"Developing Android Apps? You should know about DI \n","caption":"frogermcs.github.io","description":"Coding with love {❤️}","created_time":"2016-04-27T20:02:14+10:00","total_likes":3,"total_comments":0},{"id":"172338516139198_1131511773555196","from":{"name":"Muhammad Salem Elhady","id":"1016971585071771"},"message":"Is there anyone could successfully install Tensorflow using docker image on windows ?","caption":null,"description":null,"created_time":"2016-04-26T01:16:13+10:00","total_likes":1,"total_comments":5}]}