{"posts":[{"id":"172338516139198_726167020756342","from":{"id":"545680830","name":"Mahmoud Ibrahim"},"caption":"www.engadget.com","description":"We came, we saw, we barked orders into a phone. Though Microsoft's annual developer conference is technically called \"Build Windows,\" we actually spent","created_time":"2014-04-06T13:41:26+0000","total_likes":1,"total_comments":0},{"id":"172338516139198_726309294075448","from":{"id":"100007732170769","name":"Shareef Nazzal"},"message":"small comparison between bootstrap foundation pure and Gumby by me  \nComponents wise \nhope it would be useful http://goo.gl/SZsBCN","caption":"stackedit.io","description":"Full-featured, open-source Markdown editor based on PageDown, the Markdown library used by Stack Overflow and the other Stack Exchange sites.","created_time":"2014-04-06T19:29:48+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_726319637407747","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"It took a week, but now I have added links to each of the tools mentioned in my developer toolset blog post. Check them out :)\n\nhttp://gurustop.net/blog/2014/04/01/tools-i-use-when-developing-on-net/","caption":"gurustop.net","description":"There was a question in a tech facebook group I co-manage about what tools you'd use if starting a new project today. I don't know for sure. It depends -of course- is the expected answer. For examp...","created_time":"2014-04-06T19:59:25+0000","total_likes":3,"total_comments":0},{"id":"172338516139198_726359470737097","from":{"id":"100001034322278","name":"Adham EL-Deeb"},"message":"مين يعرف شركات شغاله Rails في القاهرة؟!","created_time":"2014-04-06T21:35:02+0000","total_likes":2,"total_comments":10},{"id":"172338516139198_726543584052019","from":{"id":"100008079004211","name":"Dev Mustafa"},"message":"PHP / Drupal Developer\nAn excellent opportunity for an experienced in-house PHP web developer to help us on several challenging, on-going projects. The ideal candidate works with minimal direct supervision in a small team environment and has the capability of working under pressure to meet the deadlines and comfortable in a \"high-octane\" environment. Selected candidate(s) need experience in the entire software development lifecycle including: requirements, design, development, testing, and deployment. This position reports to the Manager of the applications development team.\nDuties and Responsibilities\n• Develop and maintain websites and functionality for various state agencies\n• Create and enhance database structures in accordance with web application design and reports;\n• Develop and promote the use of development standards to improve web security and enhance application design\n• Provide presentations and technical support for clients in relation to web application development\n• Understand user needs, requirements and requests to identify priorities, escalating urgent/conflicting requests\n• Proactively identify, develop and deploy solutions to improve effectiveness of technology delivered materials/information\n• Integrate systems using internal and third-party APIs\n• Develop Drupal Pages, Views, Blocks and Modules\n\nDesired Qualifications\n• 2+ years development experience in a LAMP environment (Linux, Apache MySQL, PHP)\n• 2+ years Basic Drupal Modules development experience.\n• Develop and implement modules in PHP and Drupal supporting web application functionality as necessary to meet requirements and design.• Drupal module development experience and an extensive knowledge of the Drupal core API and hook system\n• Strong understanding of object-oriented design principles\n• Experience with PHP MVC frameworks such as Zend, CakePHP, Symfony, etc.\n• Strong database skills\n• Experience working on the command line\n• Experience with Git, Subversion or other revision control system including merging, branching and tagging\n• Experience with standards-based HTML/CSS\n• Experience with Test Driven Development\nPersonal Skills\n• Dependable with a make it happen attitude\n• Excellent communication skills and ability to work in a team\n• Solution oriented\n• Team player in an agile environment. \nMinimum Qualifications:\n• 2  years web and database experience including creating & updating table structures and views as well as CSS development\n• Any equivalent combination of experience and/or education from which comparable knowledge, skills and abilities have been achieved.\n\nPlease Send CV to hr@boraqdigital.com with Job Title:Junior PHP / Drupal Developer","created_time":"2014-04-07T07:51:33+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_726543667385344","from":{"id":"100008079004211","name":"Dev Mustafa"},"message":"Software Tester\n\n· A Bachelor degree in computer science or related discipline.\n\n· At least 1 year experience as a tester\n\n· Good knowledge in preparing and automation of testing plans\n\n· High attention to details\n\n· Familiarity with bug tracking and collaborative development systems, e.g., Team Foundation Sever (TFS) and Microsoft Test Manager is a plus\n\n· An ISTQB certificate is a plus\n\nJob description:\n\n· Testing web-based applications written in PHP against specification.\n\n· Report bugs to developers via TFS with sufficient details to reproduce the bugs.\n\n· Documenting testing scenario/cases that covers different types/level of testing\n \n· Experience with reviewing requirements and developing test cases based on those requirements.\n\n· Whitebox testing experience at the unit, integration and system levels.\n\n· Strong written and verbal communication skills are a must.\n\n· A good understanding of the software development process.\n\n· A good understanding of the business approach.\n\n· A good understanding of Software testing process and types.\n\n· Must be able to multitask and meet deadlines in a fast-paced start-up environment.\n\n· Attention to detail and strong problem-solving skills are critical.\n\nPlease Send CV to hr@boraqdigital.com with Job Title: Software tester","created_time":"2014-04-07T07:51:57+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_726552174051160","from":{"id":"100000116116716","name":"Mohamed Sameeh Sharaf"},"message":"Urgent Required Asp.net MVC Developer\nat least one year experience on MVC \nsend cv at Sara.Ahmed@automationconsultants.com.eg\nor inbox me\nMust be graduated From Computer Science Faculty or Engineering Faculty and Not graduated from private university","created_time":"2014-04-07T08:35:44+0000","total_likes":1,"total_comments":1},{"id":"172338516139198_726578837381827","from":{"id":"683805169","name":"Mohamed El Sayed"},"message":"I think it's not just for kids, some of you should relate ;)\nhttp://blog.pluralsight.com/kids-diy-programming-kits","caption":"blog.pluralsight.com","description":"If you’ve seen your kid take to your iPhone like a fish to water, maybe you’ve thought about how to get them interested in DIY, or introducing...","created_time":"2014-04-07T10:32:55+0000","total_likes":0,"total_comments":0},{"id":"172338516139198_726633117376399","from":{"id":"794574128","name":"Ahmed Adel"},"message":"http://about.king.com/jobs/open-positions?jvi=oRNAYfwW,Job","caption":"about.king.com","description":"All applications must be submitted in English. We do not accept unsolicited, speculative CV's fro","created_time":"2014-04-07T13:30:58+0000","total_likes":0,"total_comments":1}]}