{"posts":[{"id":"172338516139198_893407740698935","from":{"name":"Khaled Ramadan","id":"10155975474214478"},"message":"Salam ALLAH\nI want to ask about Angular and SEO ?!! :)\nCurrently we are working on a big eCommerce website and i preferred to use Angular, signalR and some of technologies but i surprised when i got a recommendation from one of the biggest SEO companies on the glob that they asked me what about if the user disabled his java script?!!!\nI got confused shall i repeat my work again to overcome that issue!!\nPlease advise  :(","caption":null,"description":null,"created_time":"2015-02-11T01:53:31+11:00","total_likes":4,"total_comments":16},{"id":"172338516139198_895775060462203","from":{"name":"Muhammad Bassem","id":"10209993936899469"},"message":"I googled a lot before posting here but I didn't find what I'm searching for. I need some recommendations for books about architecture in general. Most of the books that I found are old and I guess will be outdated. Web servers, Caching, In-memory stores, Key value stores,  Proxies, Load balancers, Message queues, Sharding and Replication of stores. I'm really interested in this kind of posts : https://github.com/blog/530-how-we-made-github-fast & http://highscalability.com/blog/2011/3/3/stack-overflow-architecture-update-now-at-95-million-page-vi.html . The idea of thinking of and architecturing highly scalable systems and the design patterns used. Maybe what I'm asking for is too much for a single book but at least you got my point. I'd be really thankful if you could recommend some books or even the proper search keywords. Thank you.\nEDIT: The closest to what I'm searching for was \"Service-Oriented design with Ruby and Rails\" ( http://www.amazon.com/Service-Oriented-Design-Addison-Wesley-Professional-Series/dp/0321659368 ) it contains chapters about Load balancing, caching and messaging.","caption":null,"description":null,"created_time":"2015-02-16T12:05:01+11:00","total_likes":5,"total_comments":5},{"id":"172338516139198_896837350355974","from":{"name":"Khaled Ramadan","id":"10155975474214478"},"message":"I  have a complex issue :(\ncurrently we are working on hybrid solution MVC + Webforms.\nI did a master page that holds both MVC views and traditional web controls.\nIt works fine, but there are some controls in the .ascx files not working probably!! when i click on button in .ascx controls it did not hit its click events!!\nDid anyone see that issue before?!","caption":null,"description":null,"created_time":"2015-02-18T21:35:26+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_896980003675042","from":{"name":"Sameh Magdy","id":"1390728197650488"},"message":"CSS Puns & Jokes. :D","caption":"saijogeorge.com","description":"Handpicked collection of CSS Puns and CSS Jokes, curated by Saijo George","created_time":"2015-02-19T04:33:26+11:00","total_likes":6,"total_comments":0},{"id":"172338516139198_896983220341387","from":{"name":"Mohammed EL-barbeer","id":"629098840630607"},"message":"موزيلا مصر فى المنصورة , قريبا ;) \n#mozillaEgyptTour1","caption":null,"description":null,"created_time":"2015-02-19T04:44:56+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_896983623674680","from":{"name":"Ahmed Mohammad","id":"10155186366899791"},"message":"Wael Ghonim Famous Egyptian Protester Launches in Private Beta Parlio a Social Network for Discussions With Funding from Marissa Mayer and Others  ","caption":"arabcrunch.com","description":"Wael Ghonim has been silent politically since Al Sisi coup in Egypt, his twitter account had around 6 tweets only since July 2013 the date of the coup. Wael was google MENA marketing head when his ...","created_time":"2015-02-19T04:46:38+11:00","total_likes":8,"total_comments":1},{"id":"172338516139198_897025783670464","from":{"name":"Ahmed Ezz","id":"10154919378101955"},"message":null,"caption":"thenextweb.com","description":"There are a lot of beautiful tools on the internet – here are 300+ of them that are awesome and – best of all – free to use. Enjoy!","created_time":"2015-02-19T06:34:03+11:00","total_likes":1,"total_comments":1},{"id":"172338516139198_896789673694075","from":{"name":"Adel K. Khalil","id":"10158375948495584"},"message":null,"caption":"thenextweb.com","description":"Today, the next major version of HTTP took a big step toward becoming a reality; it’s been officially finalized and now moves towards being fully standardized.<p>According to a blog by Mark Nottingham, the chair of the IETF HTTP Working Group, the standard was completed today and is on its way to the RFC Editor to go through editorial processes before being published as a standard.<p>HTTP/2 is a huge deal; it’s the next big version of the Hypertext Transfer Protocol, marking the largest change since 1999 when HTTP 1.1 was adopted.<p>The new standard brings a number of benefits to one of the Web’s core technologies, such as faster page loads, longer-lived connections, more items arriving sooner and server push. HTTP/2 uses the same HTTP APIs that developers are familiar with, but offers a number of new features they can adopt.<p>One notable change is that HTTP requests will be ‘cheaper’ to make. The Web community has often told developers to avoid adding too many HTTP requests to their pages, which lead to optimization techniques like code inlining or concatenation to reduce the requests. With HTTP/2, a new multiplexing feature allows lots of requests to be delivered at the same time, so the page load isn’t blocked.<p>HTTP/2 also uses significantly fewer connections, hopefully resulting in lower load for servers and networks. Nottingham previously published a number of other improvements coming to the standard on his blog.<p>The new HTTP standard was based on Google’s SPDY protocol, which is used today by some technologies to manipulate traffic which helps improve latency and security, delivering faster page load times. Google announced just a few days ago that it plans to switch fully to HTTP/2 in Chrome.<p>Developers wishing to test HTTP/2 before it becomes official can already do so now in Firefox and Chrome, along with downloadable test servers to try improvements for themselves. More information is available in the HTTP/2 FAQ.<p>It should be a relatively short time before the standard is passed through the Request-For-Comments Editor and published for use in its final form.<p>➤ HTTP/2 is Done [mnot’s blog]","created_time":"2015-02-18T18:06:00+11:00","total_likes":13,"total_comments":0},{"id":"172338516139198_897124183660624","from":{"name":"Ahmed Koraïem","id":"10158351896530402"},"message":"Dataset containing 1000+ indices about Egypt, from the World Bank. excel format w/ metadata.","caption":null,"description":null,"created_time":"2015-02-19T10:52:34+11:00","total_likes":1,"total_comments":0},{"id":"172338516139198_897124580327251","from":{"name":"Ahmed Koraïem","id":"10158351896530402"},"message":"Dataset containing 1000+ indices about Egypt, from the World Bank. csvformat w/out metadata.","caption":null,"description":null,"created_time":"2015-02-19T10:53:20+11:00","total_likes":1,"total_comments":0}]}