{"posts":[{"id":"172338516139198_468531883186525","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Very nice presentation recording and slides. The driver is very interesting, pretty clean and truly well thought. One thing to note though is that we're back to separating storage concerns from model aspects. What you see is another mapper like ORMs, except the storage happens to be not exactly relational.","caption":"www.10gen.com","description":"Recent releases of the .NET driver have added lots of cool new features. In this webinar we will highlight some of the most important ones. We will begin by discussing serialization. We will describe how serialization is normally handled, and how you can customize the process when you need to, inclu...","created_time":"2012-10-06T05:45:03+0000","total_likes":1,"total_comments":0},{"id":"172338516139198_468532749853105","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Anyone interested in voting this feature request up a bit?\nhttp://typescript.codeplex.com/workitem/76","caption":"typescript.codeplex.com","description":"This will be very useful for automating the compiler from an asset management / bundling code without having to write to intermediate files.So, if the compiler can output to console, any process that calls the compiler can then redirect the standard output stream when calling the compiler and use th...","created_time":"2012-10-06T05:47:45+0000","total_likes":0,"total_comments":1},{"id":"172338516139198_468628269843553","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"For what it's worth, for the sake of geekiness...","caption":"www.codeproject.com","description":"I've been away from the business about 20 years now. I studied CS in the early 90's when C++ was the upcoming star, to find out that it is old hat now-a-days.\n \nI've been side-tracked by accounting and it would be interesting to find out your take as to what an Old Fart like me should update my skil...","created_time":"2012-10-06T12:31:36+0000","total_likes":2,"total_comments":0},{"id":"172338516139198_468630686509978","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"A snap into the (far?) future: Getting (Officially) Started on HTTP/2.0 http://bit.ly/QS2rOo","caption":"lists.w3.org","created_time":"2012-10-06T12:41:07+0000","total_likes":1,"total_comments":0},{"id":"172338516139198_468645799841800","from":{"id":"1614120164","name":"Eslam Hamouda"},"message":"حدش عنده أي ريسورسز إزاي اعمل تصميم مشابه للـ Metro Style سواء ملفات .psd  أو أي توتريالز , طبعاً اللي عامله ده لا يمس للميترو ستايل بشئ بس كانت مجرد تجربه :)","caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","created_time":"2012-10-06T13:29:12+0000","total_likes":0,"total_comments":6},{"id":"172338516139198_468650286508018","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"I found this by accident, looks nice:\nhttp://favbulous.com/post/738/12-popular-wireframe-ui-stencils-for-quick-prototyping","caption":"favbulous.com","description":"Prototyping is a proven technique to generate ideas and discover requirement of a project. It's a very effective method to show clients the visual and UI of a project. Not only that, it enhances the communication between, designers, developers and product","created_time":"2012-10-06T13:42:31+0000","total_likes":2,"total_comments":0},{"id":"172338516139198_468687683170945","from":{"id":"544815169","name":"Mohamed Meligy"},"message":"Great to see my impression of TypeScript (which I have mentioned a few times already) is exactly how the creators of TypeScript see it:\n\n\"CoffeeScript is to Ruby as TypeScript is to Java/C#/C++.\" \n- Luke Hoban (co-creator of TypeScript)","caption":"www.hanselman.com","description":"Scott Hanselman on Programming, User Experience, The Zen of Computers and Life in General","created_time":"2012-10-06T15:28:28+0000","total_likes":1,"total_comments":11},{"id":"172338516139198_468747153164998","from":{"id":"100000224131120","name":"Moutaz Shams"},"message":"بفكر أعمل مشروع يكون شبيه بالسيلفرلايت كدا لكن:\n\nSilverlight = XAML + C# code + Subset of the .net Framework + a framework for animation.. etc + Browser plugin + Expression Blend and Visual Studio\n\nMy Project = SVG (and some HTML5) + C# code that will be converted to JS with something like Script# + Subset of the .net Framework written in JS + a framework for animation.. etc written in JS like Raphaël + Visual Studio Extension/addins\n\nيعني بالنسبة للمطور هيكون زي السيلفرلايت تماما لكن التطبيق هيشتغل من غير plugin في كل مكان، حاجه زي Adobe Edge لكن بالروح الميكروسوفتاويه، فيه شيء مشابه للمشروع ده؟ وإيه رأيك فيه؟ و ليه ميكروسوفت لحد دلوقتي مافكرتش تعمل حاجه زيه أصلا رغم أنه يبدو أنه التطور الطبيعي للسيلفرلايت بعد القلق بتاع الـ HTML5 وكنت متوقع شيء شبيه يقدموه في فيجوال ستوديو 2012 بس أظن مافيش","created_time":"2012-10-06T18:06:25+0000","total_likes":2,"total_comments":6},{"id":"172338516139198_468965959809784","from":{"id":"544815169","name":"Mohamed Meligy"},"caption":"Attachment UnavailableThis attachment may have been removed or the person who shared it may not have permission to share it with you.","created_time":"2012-10-07T06:42:21+0000","total_likes":1,"total_comments":0}]}