{"id":"172338516139198_1362161733823531","from":{"name":"Hassan Saad","id":"303806276703088"},"story":"Hassan Saad shared Nine Hackers's post to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"303806276703088","name":"Hassan Saad","type":"user","offset":0,"length":11}],"19":[{"id":"624721821020891","name":"Nine Hackers","type":"page","offset":19,"length":12}],"53":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":53,"length":14}]},"picture":"https://fb-s-b-a.akamaihd.net/h-ak-xta1/v/t1.0-0/s130x130/16142912_689059447920461_7530713061632981098_n.png?oh=95e3381236d87eea467c8cb694f92e54&oe=596DCA03&__gda__=1499987788_106d1eae495dc54b6ad13e9060e4ee1f","link":"https://www.facebook.com/NineHackers/photos/a.627558434070563.1073741828.624721821020891/689059447920461/?type=3","name":"Nine Hackers","description":"ابدء ازاى ؟\nالسؤال ده اتسأل كتير اوى و اتجاوب عليه كتير اوى بس برده مازال عامل مشكلة عن عدد كبير جدا من الناس وبالذات اى حد لسه بيسمى وبيقول يا هادى فا ﻻزم طبعا يسأل السؤال ده , ابدء ازاى ؟\n\nخلينا نتفق ان مفيش اجابة واحده للسؤال ده وفى مليون طريق ممكن يوصلوا لنفس الهدف .\n\nاحنا بس دايما بنفضل اننا نمسك الموضوع ده اوله عشان نحاول نفهم \n\nيعنى فى البداية خالص الموضوع كله عبارة عن شوية Devices ومتوصلين ببعض عن طريق اسلاك الموضوع منطقى جدا \n\nزى الصور الـ تحت دى عندك شوية اجهزة ممكن بقه تكون PC او Laptop او Smart Phone او Server او Router و عامل Network بسيطة مابينهم عن طريق شوية اسلاك عشان يقدروا يبعتوا رسايل لبعض عن طريق الـ Wires دى بس كده دى هى الصورة المبسطة جدا لازاى العالم ده كله متوصل ببعض :3 بس صدقنى الموضوع مش بالبساطة دى :3\n\nفا يجي بقه حد لسه عايز يبدء ويسأل سؤال ازاى ابدء فى مجال الـ Hacking :3 بص هو اصلا والله مفيش مجال اسمه Hacking المفروض يعنى هو ده مصطلح اطلق على اى حد بيحاول يخلى حاجة تعمل عكس ما هى المفروض تعمله :3 فهمت حاجة \n\nيعنى من الاخر انك تBreak حاجة او تTest هل حد يقدر ممكن يBreak الحاجة دى :3 \n\nبص انت عايز تتعلم Hacking تمام احنا معندناش مشكلة بس الفكرة انت عايز تخترق ايه , اصل مينفعش انك تقول Hacking وخلاص يكون افضل يعنى لو تربطها بمصطلح تانى زي مثلا تقول Network Hacking او Software Hacking يعنى حاجة زي كده \n\nفا دلوقتى زي ما عرفنا ان العالم ده كله عبارة عن شوية اجهزة ومتوصلين ببعض عن طريق اسلاك , فا انت عايز تعمل ايه بقه , هل عايز تخترق الـ Network الـ مابينهم وتشوف مثلا الرسايل الـ بتتبعت مابينهم وﻻ مثلا عايز تخترق الجهاز ذات نفسه عشان مثلا تمسح او تنقل بعض الملفات :3 \n\nحتى لو حددت قرارك بأنه Network security او Computer security انت متعرفش ان الكلمتين دول كبار جدا جدا جدا جدا \n\nطب لو قلنا computer security فا هل انت محدد نوع الـ Device ده عشان الـ Router بيشتغل بطريقة مختلفة عن الـ Smart Phone والـ برده بيتشغل بطريقة مختلفة عن الـ Server والـ برده حتلاقيه مش زي الـ Laptop بتاع ميمى صحبتك الـ عايز تخش عندها :3 \n\nدي كلها Technologies مختلفة وبتشتغل بطرق مختلفة وحتى لو قررت انك عايز تخش على Lap طنط نوال طب هل انت ناوى تخش عليه عن طريق الـ Web service وﻻ عن طريق Malware مثلا وهل انت عارف الـ Web Technology شغاله ازاى يعنى لو افترضنا يعنى ان الجهاز عليه موقع وممكن تTest الموقع ده وتلاقى فيه ثغرة مثلا سواء Known or Unknown تقدر تخش بيها هل انت فاهم الدنيا دى طب لو قلنا انك فاهم افرض دخلت عند طنط ميمى ولقيت هى شغالة Linux هل انت فاهم Linux اصلا عشان تعرف تعمل Remove او Upload للـ Files الـ انت عايزها :3 \n\nالموضوع كبير كبير كبير :3 وهل انت لو نويت انك تخش عن طريق Malware بفلاشة معفنة هل انت عندك الفهم الكافى للـ IP Technology والـ DNS Technology عشان تعرف تظبط Reverse Shell يجيلك صح وتعرف تظبط External IP ويكون Static كمان او لو Dynamic فا تربطه بي Domain وتعمل update للـ Dns هل انت فاهم كل ده بشكل كويس ده غير الـ Antivirus والـ Firewalls ده اذا كانوا موجودين اصلا يعنى :3 \n\nهل انت فهمت حجم اجابة سؤالك عاملة ازاى :3 \n\nبص افضل هاكر هو الـ عنده افضل Knowledge للعالم الـ حواليه يعنى طول ما انت عايش ادرس واتعلم وحتلاقى نفسك من غير ما تحس بتعرف تBreak اى حاجة عشان انت فعلا بقيت فاهم الحاجة دى شغالة ازاى :3\n\nيعنى ملخص الكلام :3\nمش حتفرق انك تبدء لينكس وﻻ شبكات وﻻ برمجة وﻻ جن ازرق :3\nوﻻ حتفرق انك تتعلم من Offensive Security وﻻ sans وﻻ ec council وﻻ حتى FBI , زي ما احنا قولنالكوا \" افضل هاكر هو الـ عنده افضل Knowledge \" :3\n\nابدء بقه زي ما تبدء مش حتفرق واتعلم من اى مكان وبأى طريقة مش حتفرق برده .\n\nالمهم انك تكون محدد انت عايز تعمل ايه وحتعمله ازاى , وتكون منظم دماغك بشكل كويس ^_^ \n\nيعنى ﻻزم تفهم الدنيا دى كلها ماشية ازاى ومتوصلة مع بعض ازاى والجهاز الـ انت عايز تخش عليه ده شغال ازاى وبمجرد ما انت حتفهم النقطة دى حتلاقى ان انت الـ بقيت بتكتشف طريق جديدة وبتعملها Publish كمان عشان توضح عيوب منتج او عيوب Technology :3\n\nونصيحة اخيرة لو انت بتفكر مثلا انك تخترق Smart Phone هل انت محتاج تعرف الـ Server شغال ازاى ! \n\nيعنى من الاخر لو انت واحد لسه بادىء فا اهم حاجة تعرفها الـ Computer شغال ازاى والـ Network الـ مابين الـ Computers دى شغاله ازاى بس كده :3","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1362161733823531"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1362161733823531"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"photo","object_id":"689059447920461","created_time":"2017-01-22T18:01:44+0000","updated_time":"2017-01-22T18:01:44+0000","is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"906278899525350","name":"Amr Mahanna"},{"id":"1833165443600780","name":"Ahmed Magdy"}],"paging":{"cursors":{"before":"OTA2Mjc4ODk5NTI1MzUw","after":"MTgzMzE2NTQ0MzYwMDc4MAZDZD"}}}}