{"id":"172338516139198_1409022192470818","from":{"name":"Farouk Elabady","id":"10155088250877299"},"message":"How to write a proper Software developer/engineer C.V?\nI have read many articles and templates regarding this topic till I reached to the current format for my C.V which can be found here\nI would like to hear you opinion about the C.V Format and information, and also help others to write their own C.V\n","story":"Farouk Elabady shared a link to the group: Egyptian Geeks.","story_tags":{"0":[{"id":"10155088250877299","name":"Farouk Elabady","type":"user","offset":0,"length":14}],"43":[{"id":"172338516139198","name":"Egyptian Geeks","type":"group","offset":43,"length":14}]},"picture":"https://fbexternal-a.akamaihd.net/safe_image.php?d=AQBIwjErIw-FHhCs&w=130&h=130&url=https%3A%2F%2Flh3.googleusercontent.com%2FU5UvKEN8Z2hL5oLX0vYL78J0PCaApFU_EQC402xFq-IxCI9-qTPSMPIIDgmvrd0jifA_Kg%3Dw1200-h630-p&cfs=1&_nc_hash=AQBKU5C3yhJdegZQ","link":"https://docs.google.com/document/d/1rNR4dZ2NnYhoUniZJHqLYs1I1tDvMGSu6fdydih1R2E/edit?usp=sharing","name":"Farouk_ELabady_CV","caption":"docs.google.com","description":"Farouk Mohey El-Deen El-Abady 8 Hussanya St atafa elashakar gamalya, Cairo, Egypt +2 01001033180 . faroukelabady@hotmail.com . https://www.linkedin.com/in/faroukelabady/ JAVA Software Engineer Career objective: To be a Software Architect and build my own IT company one day, building a better ...","icon":"https://www.facebook.com/images/icons/post.gif","actions":[{"name":"Comment","link":"https://www.facebook.com/172338516139198/posts/1409022192470818"},{"name":"Like","link":"https://www.facebook.com/172338516139198/posts/1409022192470818"},{"name":"Report Post to Admin","link":"https://www.facebook.com/groups/egyptian.geeks/members/"}],"privacy":{"value":"","description":"","friends":"","allow":"","deny":""},"type":"link","status_type":"shared_story","created_time":"2017-03-04T17:17:07+0000","updated_time":"2017-03-05T08:59:24+0000","shares":{"count":6},"is_hidden":false,"is_expired":false,"likes":{"data":[{"id":"10155057984387292","name":"Hany Ahmed"},{"id":"10155204641740962","name":"Mohamed Fouad Shaheen"},{"id":"1282471681844502","name":"Ahmed Shawkii Awwad"},{"id":"10155099548114764","name":"Mahmoud Tantawy"},{"id":"258456741277110","name":"Eslam Esso"},{"id":"10213195944439691","name":"Hisham Mounir Ahmed"},{"id":"1567195056628221","name":"Mohammed Hassan"},{"id":"1472664136117757","name":"Mahmoud M Hassan"},{"id":"10155252594718081","name":"Ahmed Zain Mohammed"},{"id":"10154910282501578","name":"Mohamed Salem"}],"paging":{"cursors":{"before":"MTAxNTUwNTc5ODQzODcyOTIZD","after":"MTAxNTQ5MTAyODI1MDE1NzgZD"}}},"comments":{"data":[{"created_time":"2017-03-04T17:17:43+0000","from":{"name":"Farouk Elabady","id":"10155088250877299"},"message":"http://www.techrepublic.com/blog/10-things/10-tips-for-writing-a-job-winning-developer-resume/","can_remove":false,"like_count":0,"user_likes":false,"id":"1409022435804127"},{"created_time":"2017-03-04T17:23:53+0000","from":{"name":"محمد عرفة","id":"10154943779149651"},"message":"what i do and have done for years is to paste everything into linkedin. then go use the export to pdf option in linkein. paste that output into word and remove the references section. \n\nthe recruiters' have a program that only imports word format and in a certain format. i havent had any recruiteres tell me to reformat my resume since i began doing this. \n\nplus, the added advantage is that recruiters can also find me on linkedin.","can_remove":false,"like_count":2,"user_likes":false,"id":"1409026325803738"},{"created_time":"2017-03-04T17:38:46+0000","from":{"name":"Mohamed Salah","id":"10158350433120162"},"message":"impressive Farouk Sabry, i will give you two advices:\n- Think about what to exclude from the CV, less is more, if you write a technology and the interviewer asks you a question about it and you tell him i haven't used it in 5 years it makes you look bad.\n- Customize your CV for each job category (or even for each job if possible). for example, if you are applying for a frontend position make the frontend section stand out, bring it to top add more details, highlight with fonts. still include something about backend but with less focus.\n\ngood luck","can_remove":false,"like_count":2,"message_tags":[{"id":"1237747669657240","length":12,"name":"Farouk Sabry","offset":11,"type":"user"}],"user_likes":false,"id":"1409043615802009"},{"created_time":"2017-03-04T18:18:49+0000","from":{"name":"Diaa Sami","id":"10212782797230132"},"message":"https://www.careercup.com/resume","can_remove":false,"like_count":1,"user_likes":false,"id":"1409080005798370"},{"created_time":"2017-03-04T18:44:00+0000","from":{"name":"Abdelrahman Y. El-Fiky","id":"10154763290933941"},"message":"Well organized (Y)\nI think you should move the certifications part to the top of the list or place it under the \"JAVA Software Engineer\" title on the top, to grab the attention of the reader as a lot of companies care about this part more than anything else.\nSoftware Engineer - HTI E&C ENG graduate 2010/11 ;)","can_remove":false,"like_count":1,"user_likes":false,"id":"1409098232463214"},{"created_time":"2017-03-04T20:02:05+0000","from":{"name":"Ahmed Abdalla","id":"10154648711618621"},"message":"On top of the above, I believe you need you to reduce the skills section significantly. Focus on what matters for your career. i.e. as Software Engineer. So\n- It doesn't matter to write that you know XHTML & HTML5 (I don't even think it matters to write that you know HTML if you wrote that you know jquery for example\n- XML (or all its related technologies, believe me no one is expecting someone who doesn't know what XML is)\n- Waterfall \n- IDEs \n- Web Servers\n- Issue Tracker\n- CVS / SVN. (If you wrote you know git, that's enough)\n- Atom, MySQL workbench, PhpMyAdmin, Trello (They might ask in the interview what's your fav. IDE, but believe me no one will select you for a job cause you know Atom or use Eclipse)\n- in OS(you used Platform which I don't find really accurate): Just put Linux (which level, power user, strongly experienced ..etc) and  Windows. No need to write Windows xp, 7 & 10 (unless you're a sysadmin who will be chosen for being strongly familiar with all Windows editions)\n- Soft Skills, I find that personally no longer needed or viable simply cause someone won't reject you cause you didn't write you a fast learner, and also no one will choose you cause you wrote you are.\n\nOverall you did a good job in summarizing your CV and again this is just my opinion","can_remove":false,"like_count":1,"user_likes":false,"id":"1409163279123376"},{"created_time":"2017-03-04T20:57:14+0000","from":{"name":"محمد عرفة","id":"10154943779149651"},"message":"if the resume is going online. stick it full of anything you have ever touched. believe me it helps when a recruiter is looking. believe me i once wrote \"coordinated between my dept and network dept\" and now i get job offers that require ccie","can_remove":false,"like_count":0,"user_likes":false,"id":"1409210689118635"},{"created_time":"2017-03-05T03:48:26+0000","from":{"name":"Ahmed Aboulenein","id":"10158457549660438"},"message":"\"Reduce the skills section significantly\".... that really depends on who is reading your resume, a machine or a human? And if human, technical or recruiter looking for matching keywords. Some software (or may be many) parses and indexes resumes then sort them with the number of matching keywords. This makes a difference when there are hundreds of applicants, so the less keywords in your resume the lower your resume is rated - if it even appears. If a human and non-technical, that's really tricky. My manager somehow liked my performance and another colleague whose name happened to be Ahmed as well - a very rare coincident, he sent our resumes to the recruiter asking him to find people of similar profiles. Guess what? He brought him a candidate named Ahmed, haha. That might be okay in Cairo where there so many Ahmed, but it's not very common to find software engineers called Ahmed in Toronto with profiles similar to ours. Unfortunately he didn't have the needed skills and didn't even get a phone screening interview! A technical human who would understand that SVN and Git are similar and he has enough time to do a first scan of resumes. That's usually an Engineer busy with other tasks. My guess it's a low probability but may still work out for some. I would suggest you keep all the keywords but if you don't like them from a formatting perspective, you may want to push them to the bottom under Detailed Skills or Keywords section and have a summary at the top. In such a case and in the summary, I may choose to write version control systems instead of SVN or Git. These are always personal preferences and different resumes format reflect our different experiences after all - or so they should. All the best and great work!!!","can_remove":false,"like_count":0,"user_likes":false,"id":"1409561522416885"},{"created_time":"2017-03-05T06:35:54+0000","from":{"name":"Mohammed Ezzat","id":"10209738059582902"},"message":"Farouk Elabady it was discussed before with many great advices, check this link:\nhttps://m.facebook.com/groups/172338516139198?view=permalink&id=1379782352061469","can_remove":false,"like_count":0,"message_tags":[{"id":"10155088250877299","length":14,"name":"Farouk Elabady","offset":0,"type":"user"}],"user_likes":false,"id":"1409661359073568"},{"created_time":"2017-03-05T08:59:22+0000","from":{"name":"Youssef Botros","id":"10154171455311901"},"message":"I see no use for the objectives section. This should be the role of a cover letter which is customized based on the job. Even the current objective of starting your own company might result in some recruiters excluding your CV because it gives the feeling that you are joining for a temporary period only. Good luck!","can_remove":false,"like_count":1,"user_likes":false,"id":"1409741062398931"}],"paging":{"cursors":{"before":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVFF3T1RBeU1qUXpOVGd3TkRFeU56b3hORGc0TmpRM09EWTAZD","after":"WTI5dGJXVnVkRjlqZAFhKemIzSTZANVFF3T1RjME1UQTJNak01T0Rrek1Ub3hORGc0TnpBME16WXkZD"}}}}